nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Read current value of the LCD_GCR_LCDEN field. */
#define BR_LCD_GCR_LCDEN(x)  (BME_UBFX32(HW_LCD_GCR_ADDR(x), BP_LCD_GCR_LCDEN, BS_LCD_GCR_LCDEN))

/*! @brief Format value for bitfield LCD_GCR_LCDEN. */
#define BF_LCD_GCR_LCDEN(v)  ((uint32_t)((uint32_t)(v) << BP_LCD_GCR_LCDEN) & BM_LCD_GCR_LCDEN)

/*! @brief Set the LCDEN field to a new value. */
#define BW_LCD_GCR_LCDEN(x, v) (BME_BFI32(HW_LCD_GCR_ADDR(x), ((uint32_t)(v) << BP_LCD_GCR_LCDEN), BP_LCD_GCR_LCDEN, 1))
/*@}*/

/*!
 * @name Register LCD_GCR, field LCDSTP[8] (RW)
 *
 * LCD driver, charge pump, resistor bias network, and voltage regulator stop
 * while in Stop mode.
 *
 * Values:
 * - 0 - Allows the LCD driver, charge pump, resistor bias network, and voltage
 *     regulator to continue running during Stop mode.
 * - 1 - Disables the LCD driver, charge pump, resistor bias network, and
 *     voltage regulator when MCU enters Stop mode.
 */
/*@{*/
#define BP_LCD_GCR_LCDSTP    (8U)          /*!< Bit position for LCD_GCR_LCDSTP. */
#define BM_LCD_GCR_LCDSTP    (0x00000100U) /*!< Bit mask for LCD_GCR_LCDSTP. */
#define BS_LCD_GCR_LCDSTP    (1U)          /*!< Bit field size in bits for LCD_GCR_LCDSTP. */

/*! @brief Read current value of the LCD_GCR_LCDSTP field. */
#define BR_LCD_GCR_LCDSTP(x) (BME_UBFX32(HW_LCD_GCR_ADDR(x), BP_LCD_GCR_LCDSTP, BS_LCD_GCR_LCDSTP))

/*! @brief Format value for bitfield LCD_GCR_LCDSTP. */
#define BF_LCD_GCR_LCDSTP(v) ((uint32_t)((uint32_t)(v) << BP_LCD_GCR_LCDSTP) & BM_LCD_GCR_LCDSTP)

/*! @brief Set the LCDSTP field to a new value. */
#define BW_LCD_GCR_LCDSTP(x, v) (BME_BFI32(HW_LCD_GCR_ADDR(x), ((uint32_t)(v) << BP_LCD_GCR_LCDSTP), BP_LCD_GCR_LCDSTP, 1))
/*@}*/

/*!
 * @name Register LCD_GCR, field LCDDOZE[9] (RW)
 *
 * LCD driver, charge pump, resistor bias network, and voltage regulator stop
 * while in Doze mode.
 *
 * Values:
 * - 0 - Allows the LCD driver, charge pump, resistor bias network, and voltage
 *     regulator to continue running during Doze mode.
 * - 1 - Disables the LCD driver, charge pump, resistor bias network, and
 *     voltage regulator when MCU enters Doze mode.
 */
/*@{*/
#define BP_LCD_GCR_LCDDOZE   (9U)          /*!< Bit position for LCD_GCR_LCDDOZE. */
#define BM_LCD_GCR_LCDDOZE   (0x00000200U) /*!< Bit mask for LCD_GCR_LCDDOZE. */
#define BS_LCD_GCR_LCDDOZE   (1U)          /*!< Bit field size in bits for LCD_GCR_LCDDOZE. */

/*! @brief Read current value of the LCD_GCR_LCDDOZE field. */
#define BR_LCD_GCR_LCDDOZE(x) (BME_UBFX32(HW_LCD_GCR_ADDR(x), BP_LCD_GCR_LCDDOZE, BS_LCD_GCR_LCDDOZE))

/*! @brief Format value for bitfield LCD_GCR_LCDDOZE. */
#define BF_LCD_GCR_LCDDOZE(v) ((uint32_t)((uint32_t)(v) << BP_LCD_GCR_LCDDOZE) & BM_LCD_GCR_LCDDOZE)

/*! @brief Set the LCDDOZE field to a new value. */
#define BW_LCD_GCR_LCDDOZE(x, v) (BME_BFI32(HW_LCD_GCR_ADDR(x), ((uint32_t)(v) << BP_LCD_GCR_LCDDOZE), BP_LCD_GCR_LCDDOZE, 1))
/*@}*/

/*!
 * @name Register LCD_GCR, field FFR[10] (RW)
 *
 * Increases the Frame Clock Frequency.
 *
 * Values:
 * - 0 - Standard Frame Rate LCD Frame Freq: 23.3 (min) 73.1 (max)
 * - 1 - Fast Frame Rate (Standard Frame Rate x2) LCD Frame Freq: 46.6 (min)
 *     146.2 (max)
 */
/*@{*/
#define BP_LCD_GCR_FFR       (10U)         /*!< Bit position for LCD_GCR_FFR. */
#define BM_LCD_GCR_FFR       (0x00000400U) /*!< Bit mask for LCD_GCR_FFR. */
#define BS_LCD_GCR_FFR       (1U)          /*!< Bit field size in bits for LCD_GCR_FFR. */

/*! @brief Read current value of the LCD_GCR_FFR field. */
#define BR_LCD_GCR_FFR(x)    (BME_UBFX32(HW_LCD_GCR_ADDR(x), BP_LCD_GCR_FFR, BS_LCD_GCR_FFR))

/*! @brief Format value for bitfield LCD_GCR_FFR. */
#define BF_LCD_GCR_FFR(v)    ((uint32_t)((uint32_t)(v) << BP_LCD_GCR_FFR) & BM_LCD_GCR_FFR)

/*! @brief Set the FFR field to a new value. */
#define BW_LCD_GCR_FFR(x, v) (BME_BFI32(HW_LCD_GCR_ADDR(x), ((uint32_t)(v) << BP_LCD_GCR_FFR), BP_LCD_GCR_FFR, 1))
/*@}*/

/*!
 * @name Register LCD_GCR, field ALTSOURCE[11] (RW)
 *
 * Values:
 * - 0 - Select Alternate Clock Source 1 (default)
 * - 1 - Select Alternate Clock Source 2
 */
/*@{*/
#define BP_LCD_GCR_ALTSOURCE (11U)         /*!< Bit position for LCD_GCR_ALTSOURCE. */
#define BM_LCD_GCR_ALTSOURCE (0x00000800U) /*!< Bit mask for LCD_GCR_ALTSOURCE. */
#define BS_LCD_GCR_ALTSOURCE (1U)          /*!< Bit field size in bits for LCD_GCR_ALTSOURCE. */

/*! @brief Read current value of the LCD_GCR_ALTSOURCE field. */
#define BR_LCD_GCR_ALTSOURCE(x) (BME_UBFX32(HW_LCD_GCR_ADDR(x), BP_LCD_GCR_ALTSOURCE, BS_LCD_GCR_ALTSOURCE))

/*! @brief Format value for bitfield LCD_GCR_ALTSOURCE. */
#define BF_LCD_GCR_ALTSOURCE(v) ((uint32_t)((uint32_t)(v) << BP_LCD_GCR_ALTSOURCE) & BM_LCD_GCR_ALTSOURCE)

/*! @brief Set the ALTSOURCE field to a new value. */
#define BW_LCD_GCR_ALTSOURCE(x, v) (BME_BFI32(HW_LCD_GCR_ADDR(x), ((uint32_t)(v) << BP_LCD_GCR_ALTSOURCE), BP_LCD_GCR_ALTSOURCE, 1))
/*@}*/

/*!
 * @name Register LCD_GCR, field ALTDIV[13:12] (RW)
 *
 * Functions as a clock divider to divide the alternate clock before it is
 * selected as LCD clock source.
 *
 * Values:
 * - 0 - Divide factor = 1 (No divide)
 * - 1 - Divide factor = 8
 */
/*@{*/
#define BP_LCD_GCR_ALTDIV    (12U)         /*!< Bit position for LCD_GCR_ALTDIV. */
#define BM_LCD_GCR_ALTDIV    (0x00003000U) /*!< Bit mask for LCD_GCR_ALTDIV. */
#define BS_LCD_GCR_ALTDIV    (2U)          /*!< Bit field size in bits for LCD_GCR_ALTDIV. */

/*! @brief Read current value of the LCD_GCR_ALTDIV field. */
#define BR_LCD_GCR_ALTDIV(x) (BME_UBFX32(HW_LCD_GCR_ADDR(x), BP_LCD_GCR_ALTDIV, BS_LCD_GCR_ALTDIV))

/*! @brief Format value for bitfield LCD_GCR_ALTDIV. */
#define BF_LCD_GCR_ALTDIV(v) ((uint32_t)((uint32_t)(v) << BP_LCD_GCR_ALTDIV) & BM_LCD_GCR_ALTDIV)

/*! @brief Set the ALTDIV field to a new value. */
#define BW_LCD_GCR_ALTDIV(x, v) (BME_BFI32(HW_LCD_GCR_ADDR(x), ((uint32_t)(v) << BP_LCD_GCR_ALTDIV), BP_LCD_GCR_ALTDIV, 2))
/*@}*/

/*!
 * @name Register LCD_GCR, field FDCIEN[14] (RW)
 *
 * Enables an LCD interrupt event when fault detection is completed.
 *
 * Values:
 * - 0 - No interrupt request is generated by this event.
 * - 1 - When a fault is detected and FDCF bit is set, this event causes an
 *     interrupt request.
 */
/*@{*/
#define BP_LCD_GCR_FDCIEN    (14U)         /*!< Bit position for LCD_GCR_FDCIEN. */
#define BM_LCD_GCR_FDCIEN    (0x00004000U) /*!< Bit mask for LCD_GCR_FDCIEN. */
#define BS_LCD_GCR_FDCIEN    (1U)          /*!< Bit field size in bits for LCD_GCR_FDCIEN. */

