nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*
 * Constants & macros for individual LCD_WF3TO0 bitfields
 */

/*!
 * @name Register LCD_WF3TO0, field WF0[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P0 as described above for WF3.
 */
/*@{*/
#define BP_LCD_WF3TO0_WF0    (0U)          /*!< Bit position for LCD_WF3TO0_WF0. */
#define BM_LCD_WF3TO0_WF0    (0x000000FFU) /*!< Bit mask for LCD_WF3TO0_WF0. */
#define BS_LCD_WF3TO0_WF0    (8U)          /*!< Bit field size in bits for LCD_WF3TO0_WF0. */

/*! @brief Read current value of the LCD_WF3TO0_WF0 field. */
#define BR_LCD_WF3TO0_WF0(x) (BME_UBFX32(HW_LCD_WF3TO0_ADDR(x), BP_LCD_WF3TO0_WF0, BS_LCD_WF3TO0_WF0))

/*! @brief Format value for bitfield LCD_WF3TO0_WF0. */
#define BF_LCD_WF3TO0_WF0(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF3TO0_WF0) & BM_LCD_WF3TO0_WF0)

/*! @brief Set the WF0 field to a new value. */
#define BW_LCD_WF3TO0_WF0(x, v) (BME_BFI32(HW_LCD_WF3TO0_ADDR(x), ((uint32_t)(v) << BP_LCD_WF3TO0_WF0), BP_LCD_WF3TO0_WF0, 8))
/*@}*/

/*!
 * @name Register LCD_WF3TO0, field WF1[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P1 as described above for WF3.
 */
/*@{*/
#define BP_LCD_WF3TO0_WF1    (8U)          /*!< Bit position for LCD_WF3TO0_WF1. */
#define BM_LCD_WF3TO0_WF1    (0x0000FF00U) /*!< Bit mask for LCD_WF3TO0_WF1. */
#define BS_LCD_WF3TO0_WF1    (8U)          /*!< Bit field size in bits for LCD_WF3TO0_WF1. */

/*! @brief Read current value of the LCD_WF3TO0_WF1 field. */
#define BR_LCD_WF3TO0_WF1(x) (BME_UBFX32(HW_LCD_WF3TO0_ADDR(x), BP_LCD_WF3TO0_WF1, BS_LCD_WF3TO0_WF1))

/*! @brief Format value for bitfield LCD_WF3TO0_WF1. */
#define BF_LCD_WF3TO0_WF1(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF3TO0_WF1) & BM_LCD_WF3TO0_WF1)

/*! @brief Set the WF1 field to a new value. */
#define BW_LCD_WF3TO0_WF1(x, v) (BME_BFI32(HW_LCD_WF3TO0_ADDR(x), ((uint32_t)(v) << BP_LCD_WF3TO0_WF1), BP_LCD_WF3TO0_WF1, 8))
/*@}*/

/*!
 * @name Register LCD_WF3TO0, field WF2[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P2 as described above for WF3.
 */
/*@{*/
#define BP_LCD_WF3TO0_WF2    (16U)         /*!< Bit position for LCD_WF3TO0_WF2. */
#define BM_LCD_WF3TO0_WF2    (0x00FF0000U) /*!< Bit mask for LCD_WF3TO0_WF2. */
#define BS_LCD_WF3TO0_WF2    (8U)          /*!< Bit field size in bits for LCD_WF3TO0_WF2. */

/*! @brief Read current value of the LCD_WF3TO0_WF2 field. */
#define BR_LCD_WF3TO0_WF2(x) (BME_UBFX32(HW_LCD_WF3TO0_ADDR(x), BP_LCD_WF3TO0_WF2, BS_LCD_WF3TO0_WF2))

/*! @brief Format value for bitfield LCD_WF3TO0_WF2. */
#define BF_LCD_WF3TO0_WF2(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF3TO0_WF2) & BM_LCD_WF3TO0_WF2)

/*! @brief Set the WF2 field to a new value. */
#define BW_LCD_WF3TO0_WF2(x, v) (BME_BFI32(HW_LCD_WF3TO0_ADDR(x), ((uint32_t)(v) << BP_LCD_WF3TO0_WF2), BP_LCD_WF3TO0_WF2, 8))
/*@}*/

/*!
 * @name Register LCD_WF3TO0, field WF3[31:24] (RW)
 *
 * Segment-on front plane operation - Each bit turns on or off the segments
 * associated with LCD_P3 in the following pattern: HGFEDCBA (most significant bit
 * controls segment H and least significant bit controls segment A). Segment-on
 * back plane operation - Each bit activates or deactivates the phases associated
 * with LCD_P3 in the following pattern: HGFEDCBA (most significant bit controls
 * phase H and least significant bit controls phase A). For each bit: 0 Segment off
 * or phase deactivated 1 Segment on or phase activated
 */
/*@{*/
#define BP_LCD_WF3TO0_WF3    (24U)         /*!< Bit position for LCD_WF3TO0_WF3. */
#define BM_LCD_WF3TO0_WF3    (0xFF000000U) /*!< Bit mask for LCD_WF3TO0_WF3. */
#define BS_LCD_WF3TO0_WF3    (8U)          /*!< Bit field size in bits for LCD_WF3TO0_WF3. */

/*! @brief Read current value of the LCD_WF3TO0_WF3 field. */
#define BR_LCD_WF3TO0_WF3(x) (BME_UBFX32(HW_LCD_WF3TO0_ADDR(x), BP_LCD_WF3TO0_WF3, BS_LCD_WF3TO0_WF3))

/*! @brief Format value for bitfield LCD_WF3TO0_WF3. */
#define BF_LCD_WF3TO0_WF3(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF3TO0_WF3) & BM_LCD_WF3TO0_WF3)

/*! @brief Set the WF3 field to a new value. */
#define BW_LCD_WF3TO0_WF3(x, v) (BME_BFI32(HW_LCD_WF3TO0_ADDR(x), ((uint32_t)(v) << BP_LCD_WF3TO0_WF3), BP_LCD_WF3TO0_WF3, 8))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF7TO4 - LCD Waveform register
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF7TO4 - LCD Waveform register (RW)
 *
 * Reset value: 0x00000000U
 *
 * See the LCD Waveform register (WFC3TO0) for register and field descriptions.
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_wf7to4
{
    uint32_t U;
    struct _hw_lcd_wf7to4_bitfields
    {
        uint32_t WF4 : 8;              /*!< [7:0]  */
        uint32_t WF5 : 8;              /*!< [15:8]  */
        uint32_t WF6 : 8;              /*!< [23:16]  */
        uint32_t WF7 : 8;              /*!< [31:24]  */
    } B;
} hw_lcd_wf7to4_t;

/*!
 * @name Constants and macros for entire LCD_WF7TO4 register
 */
/*@{*/
#define HW_LCD_WF7TO4_ADDR(x)    ((x) + 0x24U)

#define HW_LCD_WF7TO4(x)         (*(__IO hw_lcd_wf7to4_t *) HW_LCD_WF7TO4_ADDR(x))
#define HW_LCD_WF7TO4_RD(x)      (HW_LCD_WF7TO4(x).U)
#define HW_LCD_WF7TO4_WR(x, v)   (HW_LCD_WF7TO4(x).U = (v))
#define HW_LCD_WF7TO4_SET(x, v)  (BME_OR32(HW_LCD_WF7TO4_ADDR(x), (uint32_t)(v)))
#define HW_LCD_WF7TO4_CLR(x, v)  (BME_AND32(HW_LCD_WF7TO4_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_WF7TO4_TOG(x, v)  (BME_XOR32(HW_LCD_WF7TO4_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF7TO4 bitfields
 */

/*!
 * @name Register LCD_WF7TO4, field WF4[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P4 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF7TO4_WF4    (0U)          /*!< Bit position for LCD_WF7TO4_WF4. */
#define BM_LCD_WF7TO4_WF4    (0x000000FFU) /*!< Bit mask for LCD_WF7TO4_WF4. */
#define BS_LCD_WF7TO4_WF4    (8U)          /*!< Bit field size in bits for LCD_WF7TO4_WF4. */

