nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*
 * Constants & macros for individual LCD_WF31TO28 bitfields
 */

/*!
 * @name Register LCD_WF31TO28, field WF28[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P28 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF31TO28_WF28 (0U)          /*!< Bit position for LCD_WF31TO28_WF28. */
#define BM_LCD_WF31TO28_WF28 (0x000000FFU) /*!< Bit mask for LCD_WF31TO28_WF28. */
#define BS_LCD_WF31TO28_WF28 (8U)          /*!< Bit field size in bits for LCD_WF31TO28_WF28. */

/*! @brief Read current value of the LCD_WF31TO28_WF28 field. */
#define BR_LCD_WF31TO28_WF28(x) (BME_UBFX32(HW_LCD_WF31TO28_ADDR(x), BP_LCD_WF31TO28_WF28, BS_LCD_WF31TO28_WF28))

/*! @brief Format value for bitfield LCD_WF31TO28_WF28. */
#define BF_LCD_WF31TO28_WF28(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF31TO28_WF28) & BM_LCD_WF31TO28_WF28)

/*! @brief Set the WF28 field to a new value. */
#define BW_LCD_WF31TO28_WF28(x, v) (BME_BFI32(HW_LCD_WF31TO28_ADDR(x), ((uint32_t)(v) << BP_LCD_WF31TO28_WF28), BP_LCD_WF31TO28_WF28, 8))
/*@}*/

/*!
 * @name Register LCD_WF31TO28, field WF29[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P29 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF31TO28_WF29 (8U)          /*!< Bit position for LCD_WF31TO28_WF29. */
#define BM_LCD_WF31TO28_WF29 (0x0000FF00U) /*!< Bit mask for LCD_WF31TO28_WF29. */
#define BS_LCD_WF31TO28_WF29 (8U)          /*!< Bit field size in bits for LCD_WF31TO28_WF29. */

/*! @brief Read current value of the LCD_WF31TO28_WF29 field. */
#define BR_LCD_WF31TO28_WF29(x) (BME_UBFX32(HW_LCD_WF31TO28_ADDR(x), BP_LCD_WF31TO28_WF29, BS_LCD_WF31TO28_WF29))

/*! @brief Format value for bitfield LCD_WF31TO28_WF29. */
#define BF_LCD_WF31TO28_WF29(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF31TO28_WF29) & BM_LCD_WF31TO28_WF29)

/*! @brief Set the WF29 field to a new value. */
#define BW_LCD_WF31TO28_WF29(x, v) (BME_BFI32(HW_LCD_WF31TO28_ADDR(x), ((uint32_t)(v) << BP_LCD_WF31TO28_WF29), BP_LCD_WF31TO28_WF29, 8))
/*@}*/

/*!
 * @name Register LCD_WF31TO28, field WF30[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P30 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF31TO28_WF30 (16U)         /*!< Bit position for LCD_WF31TO28_WF30. */
#define BM_LCD_WF31TO28_WF30 (0x00FF0000U) /*!< Bit mask for LCD_WF31TO28_WF30. */
#define BS_LCD_WF31TO28_WF30 (8U)          /*!< Bit field size in bits for LCD_WF31TO28_WF30. */

/*! @brief Read current value of the LCD_WF31TO28_WF30 field. */
#define BR_LCD_WF31TO28_WF30(x) (BME_UBFX32(HW_LCD_WF31TO28_ADDR(x), BP_LCD_WF31TO28_WF30, BS_LCD_WF31TO28_WF30))

/*! @brief Format value for bitfield LCD_WF31TO28_WF30. */
#define BF_LCD_WF31TO28_WF30(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF31TO28_WF30) & BM_LCD_WF31TO28_WF30)

/*! @brief Set the WF30 field to a new value. */
#define BW_LCD_WF31TO28_WF30(x, v) (BME_BFI32(HW_LCD_WF31TO28_ADDR(x), ((uint32_t)(v) << BP_LCD_WF31TO28_WF30), BP_LCD_WF31TO28_WF30, 8))
/*@}*/

/*!
 * @name Register LCD_WF31TO28, field WF31[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P31 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF31TO28_WF31 (24U)         /*!< Bit position for LCD_WF31TO28_WF31. */
#define BM_LCD_WF31TO28_WF31 (0xFF000000U) /*!< Bit mask for LCD_WF31TO28_WF31. */
#define BS_LCD_WF31TO28_WF31 (8U)          /*!< Bit field size in bits for LCD_WF31TO28_WF31. */

/*! @brief Read current value of the LCD_WF31TO28_WF31 field. */
#define BR_LCD_WF31TO28_WF31(x) (BME_UBFX32(HW_LCD_WF31TO28_ADDR(x), BP_LCD_WF31TO28_WF31, BS_LCD_WF31TO28_WF31))

/*! @brief Format value for bitfield LCD_WF31TO28_WF31. */
#define BF_LCD_WF31TO28_WF31(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF31TO28_WF31) & BM_LCD_WF31TO28_WF31)

/*! @brief Set the WF31 field to a new value. */
#define BW_LCD_WF31TO28_WF31(x, v) (BME_BFI32(HW_LCD_WF31TO28_ADDR(x), ((uint32_t)(v) << BP_LCD_WF31TO28_WF31), BP_LCD_WF31TO28_WF31, 8))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF35TO32 - LCD Waveform register
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF35TO32 - LCD Waveform register (RW)
 *
 * Reset value: 0x00000000U
 *
 * See the LCD Waveform register (WFC3TO0) for register and field descriptions.
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_wf35to32
{
    uint32_t U;
    struct _hw_lcd_wf35to32_bitfields
    {
        uint32_t WF32 : 8;             /*!< [7:0]  */
        uint32_t WF33 : 8;             /*!< [15:8]  */
        uint32_t WF34 : 8;             /*!< [23:16]  */
        uint32_t WF35 : 8;             /*!< [31:24]  */
    } B;
} hw_lcd_wf35to32_t;

/*!
 * @name Constants and macros for entire LCD_WF35TO32 register
 */
/*@{*/
#define HW_LCD_WF35TO32_ADDR(x)  ((x) + 0x40U)

#define HW_LCD_WF35TO32(x)       (*(__IO hw_lcd_wf35to32_t *) HW_LCD_WF35TO32_ADDR(x))
#define HW_LCD_WF35TO32_RD(x)    (HW_LCD_WF35TO32(x).U)
#define HW_LCD_WF35TO32_WR(x, v) (HW_LCD_WF35TO32(x).U = (v))
#define HW_LCD_WF35TO32_SET(x, v) (BME_OR32(HW_LCD_WF35TO32_ADDR(x), (uint32_t)(v)))
#define HW_LCD_WF35TO32_CLR(x, v) (BME_AND32(HW_LCD_WF35TO32_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_WF35TO32_TOG(x, v) (BME_XOR32(HW_LCD_WF35TO32_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF35TO32 bitfields
 */

/*!
 * @name Register LCD_WF35TO32, field WF32[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P32 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF35TO32_WF32 (0U)          /*!< Bit position for LCD_WF35TO32_WF32. */
#define BM_LCD_WF35TO32_WF32 (0x000000FFU) /*!< Bit mask for LCD_WF35TO32_WF32. */
#define BS_LCD_WF35TO32_WF32 (8U)          /*!< Bit field size in bits for LCD_WF35TO32_WF32. */

/*! @brief Read current value of the LCD_WF35TO32_WF32 field. */
#define BR_LCD_WF35TO32_WF32(x) (BME_UBFX32(HW_LCD_WF35TO32_ADDR(x), BP_LCD_WF35TO32_WF32, BS_LCD_WF35TO32_WF32))

