nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Format value for bitfield LCD_WF35TO32_WF32. */
#define BF_LCD_WF35TO32_WF32(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF35TO32_WF32) & BM_LCD_WF35TO32_WF32)

/*! @brief Set the WF32 field to a new value. */
#define BW_LCD_WF35TO32_WF32(x, v) (BME_BFI32(HW_LCD_WF35TO32_ADDR(x), ((uint32_t)(v) << BP_LCD_WF35TO32_WF32), BP_LCD_WF35TO32_WF32, 8))
/*@}*/

/*!
 * @name Register LCD_WF35TO32, field WF33[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P33 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF35TO32_WF33 (8U)          /*!< Bit position for LCD_WF35TO32_WF33. */
#define BM_LCD_WF35TO32_WF33 (0x0000FF00U) /*!< Bit mask for LCD_WF35TO32_WF33. */
#define BS_LCD_WF35TO32_WF33 (8U)          /*!< Bit field size in bits for LCD_WF35TO32_WF33. */

/*! @brief Read current value of the LCD_WF35TO32_WF33 field. */
#define BR_LCD_WF35TO32_WF33(x) (BME_UBFX32(HW_LCD_WF35TO32_ADDR(x), BP_LCD_WF35TO32_WF33, BS_LCD_WF35TO32_WF33))

/*! @brief Format value for bitfield LCD_WF35TO32_WF33. */
#define BF_LCD_WF35TO32_WF33(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF35TO32_WF33) & BM_LCD_WF35TO32_WF33)

/*! @brief Set the WF33 field to a new value. */
#define BW_LCD_WF35TO32_WF33(x, v) (BME_BFI32(HW_LCD_WF35TO32_ADDR(x), ((uint32_t)(v) << BP_LCD_WF35TO32_WF33), BP_LCD_WF35TO32_WF33, 8))
/*@}*/

/*!
 * @name Register LCD_WF35TO32, field WF34[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P34 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF35TO32_WF34 (16U)         /*!< Bit position for LCD_WF35TO32_WF34. */
#define BM_LCD_WF35TO32_WF34 (0x00FF0000U) /*!< Bit mask for LCD_WF35TO32_WF34. */
#define BS_LCD_WF35TO32_WF34 (8U)          /*!< Bit field size in bits for LCD_WF35TO32_WF34. */

/*! @brief Read current value of the LCD_WF35TO32_WF34 field. */
#define BR_LCD_WF35TO32_WF34(x) (BME_UBFX32(HW_LCD_WF35TO32_ADDR(x), BP_LCD_WF35TO32_WF34, BS_LCD_WF35TO32_WF34))

/*! @brief Format value for bitfield LCD_WF35TO32_WF34. */
#define BF_LCD_WF35TO32_WF34(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF35TO32_WF34) & BM_LCD_WF35TO32_WF34)

/*! @brief Set the WF34 field to a new value. */
#define BW_LCD_WF35TO32_WF34(x, v) (BME_BFI32(HW_LCD_WF35TO32_ADDR(x), ((uint32_t)(v) << BP_LCD_WF35TO32_WF34), BP_LCD_WF35TO32_WF34, 8))
/*@}*/

/*!
 * @name Register LCD_WF35TO32, field WF35[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P35 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF35TO32_WF35 (24U)         /*!< Bit position for LCD_WF35TO32_WF35. */
#define BM_LCD_WF35TO32_WF35 (0xFF000000U) /*!< Bit mask for LCD_WF35TO32_WF35. */
#define BS_LCD_WF35TO32_WF35 (8U)          /*!< Bit field size in bits for LCD_WF35TO32_WF35. */

/*! @brief Read current value of the LCD_WF35TO32_WF35 field. */
#define BR_LCD_WF35TO32_WF35(x) (BME_UBFX32(HW_LCD_WF35TO32_ADDR(x), BP_LCD_WF35TO32_WF35, BS_LCD_WF35TO32_WF35))

/*! @brief Format value for bitfield LCD_WF35TO32_WF35. */
#define BF_LCD_WF35TO32_WF35(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF35TO32_WF35) & BM_LCD_WF35TO32_WF35)

/*! @brief Set the WF35 field to a new value. */
#define BW_LCD_WF35TO32_WF35(x, v) (BME_BFI32(HW_LCD_WF35TO32_ADDR(x), ((uint32_t)(v) << BP_LCD_WF35TO32_WF35), BP_LCD_WF35TO32_WF35, 8))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF39TO36 - LCD Waveform register
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF39TO36 - LCD Waveform register (RW)
 *
 * Reset value: 0x00000000U
 *
 * See the LCD Waveform register (WFC3TO0) for register and field descriptions.
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_wf39to36
{
    uint32_t U;
    struct _hw_lcd_wf39to36_bitfields
    {
        uint32_t WF36 : 8;             /*!< [7:0]  */
        uint32_t WF37 : 8;             /*!< [15:8]  */
        uint32_t WF38 : 8;             /*!< [23:16]  */
        uint32_t WF39 : 8;             /*!< [31:24]  */
    } B;
} hw_lcd_wf39to36_t;

/*!
 * @name Constants and macros for entire LCD_WF39TO36 register
 */
/*@{*/
#define HW_LCD_WF39TO36_ADDR(x)  ((x) + 0x44U)

#define HW_LCD_WF39TO36(x)       (*(__IO hw_lcd_wf39to36_t *) HW_LCD_WF39TO36_ADDR(x))
#define HW_LCD_WF39TO36_RD(x)    (HW_LCD_WF39TO36(x).U)
#define HW_LCD_WF39TO36_WR(x, v) (HW_LCD_WF39TO36(x).U = (v))
#define HW_LCD_WF39TO36_SET(x, v) (BME_OR32(HW_LCD_WF39TO36_ADDR(x), (uint32_t)(v)))
#define HW_LCD_WF39TO36_CLR(x, v) (BME_AND32(HW_LCD_WF39TO36_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_WF39TO36_TOG(x, v) (BME_XOR32(HW_LCD_WF39TO36_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF39TO36 bitfields
 */

/*!
 * @name Register LCD_WF39TO36, field WF36[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P36 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF39TO36_WF36 (0U)          /*!< Bit position for LCD_WF39TO36_WF36. */
#define BM_LCD_WF39TO36_WF36 (0x000000FFU) /*!< Bit mask for LCD_WF39TO36_WF36. */
#define BS_LCD_WF39TO36_WF36 (8U)          /*!< Bit field size in bits for LCD_WF39TO36_WF36. */

/*! @brief Read current value of the LCD_WF39TO36_WF36 field. */
#define BR_LCD_WF39TO36_WF36(x) (BME_UBFX32(HW_LCD_WF39TO36_ADDR(x), BP_LCD_WF39TO36_WF36, BS_LCD_WF39TO36_WF36))

/*! @brief Format value for bitfield LCD_WF39TO36_WF36. */
#define BF_LCD_WF39TO36_WF36(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF39TO36_WF36) & BM_LCD_WF39TO36_WF36)

/*! @brief Set the WF36 field to a new value. */
#define BW_LCD_WF39TO36_WF36(x, v) (BME_BFI32(HW_LCD_WF39TO36_ADDR(x), ((uint32_t)(v) << BP_LCD_WF39TO36_WF36), BP_LCD_WF39TO36_WF36, 8))
/*@}*/

/*!
 * @name Register LCD_WF39TO36, field WF37[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P37 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF39TO36_WF37 (8U)          /*!< Bit position for LCD_WF39TO36_WF37. */
#define BM_LCD_WF39TO36_WF37 (0x0000FF00U) /*!< Bit mask for LCD_WF39TO36_WF37. */
#define BS_LCD_WF39TO36_WF37 (8U)          /*!< Bit field size in bits for LCD_WF39TO36_WF37. */

/*! @brief Read current value of the LCD_WF39TO36_WF37 field. */
#define BR_LCD_WF39TO36_WF37(x) (BME_UBFX32(HW_LCD_WF39TO36_ADDR(x), BP_LCD_WF39TO36_WF37, BS_LCD_WF39TO36_WF37))

/*! @brief Format value for bitfield LCD_WF39TO36_WF37. */
#define BF_LCD_WF39TO36_WF37(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF39TO36_WF37) & BM_LCD_WF39TO36_WF37)

