nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Format value for bitfield LCD_WF55TO52_WF52. */
#define BF_LCD_WF55TO52_WF52(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF55TO52_WF52) & BM_LCD_WF55TO52_WF52)

/*! @brief Set the WF52 field to a new value. */
#define BW_LCD_WF55TO52_WF52(x, v) (BME_BFI32(HW_LCD_WF55TO52_ADDR(x), ((uint32_t)(v) << BP_LCD_WF55TO52_WF52), BP_LCD_WF55TO52_WF52, 8))
/*@}*/

/*!
 * @name Register LCD_WF55TO52, field WF53[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P53 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF55TO52_WF53 (8U)          /*!< Bit position for LCD_WF55TO52_WF53. */
#define BM_LCD_WF55TO52_WF53 (0x0000FF00U) /*!< Bit mask for LCD_WF55TO52_WF53. */
#define BS_LCD_WF55TO52_WF53 (8U)          /*!< Bit field size in bits for LCD_WF55TO52_WF53. */

/*! @brief Read current value of the LCD_WF55TO52_WF53 field. */
#define BR_LCD_WF55TO52_WF53(x) (BME_UBFX32(HW_LCD_WF55TO52_ADDR(x), BP_LCD_WF55TO52_WF53, BS_LCD_WF55TO52_WF53))

/*! @brief Format value for bitfield LCD_WF55TO52_WF53. */
#define BF_LCD_WF55TO52_WF53(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF55TO52_WF53) & BM_LCD_WF55TO52_WF53)

/*! @brief Set the WF53 field to a new value. */
#define BW_LCD_WF55TO52_WF53(x, v) (BME_BFI32(HW_LCD_WF55TO52_ADDR(x), ((uint32_t)(v) << BP_LCD_WF55TO52_WF53), BP_LCD_WF55TO52_WF53, 8))
/*@}*/

/*!
 * @name Register LCD_WF55TO52, field WF54[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P54 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF55TO52_WF54 (16U)         /*!< Bit position for LCD_WF55TO52_WF54. */
#define BM_LCD_WF55TO52_WF54 (0x00FF0000U) /*!< Bit mask for LCD_WF55TO52_WF54. */
#define BS_LCD_WF55TO52_WF54 (8U)          /*!< Bit field size in bits for LCD_WF55TO52_WF54. */

/*! @brief Read current value of the LCD_WF55TO52_WF54 field. */
#define BR_LCD_WF55TO52_WF54(x) (BME_UBFX32(HW_LCD_WF55TO52_ADDR(x), BP_LCD_WF55TO52_WF54, BS_LCD_WF55TO52_WF54))

/*! @brief Format value for bitfield LCD_WF55TO52_WF54. */
#define BF_LCD_WF55TO52_WF54(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF55TO52_WF54) & BM_LCD_WF55TO52_WF54)

/*! @brief Set the WF54 field to a new value. */
#define BW_LCD_WF55TO52_WF54(x, v) (BME_BFI32(HW_LCD_WF55TO52_ADDR(x), ((uint32_t)(v) << BP_LCD_WF55TO52_WF54), BP_LCD_WF55TO52_WF54, 8))
/*@}*/

/*!
 * @name Register LCD_WF55TO52, field WF55[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P55 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF55TO52_WF55 (24U)         /*!< Bit position for LCD_WF55TO52_WF55. */
#define BM_LCD_WF55TO52_WF55 (0xFF000000U) /*!< Bit mask for LCD_WF55TO52_WF55. */
#define BS_LCD_WF55TO52_WF55 (8U)          /*!< Bit field size in bits for LCD_WF55TO52_WF55. */

/*! @brief Read current value of the LCD_WF55TO52_WF55 field. */
#define BR_LCD_WF55TO52_WF55(x) (BME_UBFX32(HW_LCD_WF55TO52_ADDR(x), BP_LCD_WF55TO52_WF55, BS_LCD_WF55TO52_WF55))

/*! @brief Format value for bitfield LCD_WF55TO52_WF55. */
#define BF_LCD_WF55TO52_WF55(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF55TO52_WF55) & BM_LCD_WF55TO52_WF55)

/*! @brief Set the WF55 field to a new value. */
#define BW_LCD_WF55TO52_WF55(x, v) (BME_BFI32(HW_LCD_WF55TO52_ADDR(x), ((uint32_t)(v) << BP_LCD_WF55TO52_WF55), BP_LCD_WF55TO52_WF55, 8))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF59TO56 - LCD Waveform register
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF59TO56 - LCD Waveform register (RW)
 *
 * Reset value: 0x00000000U
 *
 * See the LCD Waveform register (WFC3TO0) for register and field descriptions.
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_wf59to56
{
    uint32_t U;
    struct _hw_lcd_wf59to56_bitfields
    {
        uint32_t WF56 : 8;             /*!< [7:0]  */
        uint32_t WF57 : 8;             /*!< [15:8]  */
        uint32_t WF58 : 8;             /*!< [23:16]  */
        uint32_t WF59 : 8;             /*!< [31:24]  */
    } B;
} hw_lcd_wf59to56_t;

/*!
 * @name Constants and macros for entire LCD_WF59TO56 register
 */
/*@{*/
#define HW_LCD_WF59TO56_ADDR(x)  ((x) + 0x58U)

#define HW_LCD_WF59TO56(x)       (*(__IO hw_lcd_wf59to56_t *) HW_LCD_WF59TO56_ADDR(x))
#define HW_LCD_WF59TO56_RD(x)    (HW_LCD_WF59TO56(x).U)
#define HW_LCD_WF59TO56_WR(x, v) (HW_LCD_WF59TO56(x).U = (v))
#define HW_LCD_WF59TO56_SET(x, v) (BME_OR32(HW_LCD_WF59TO56_ADDR(x), (uint32_t)(v)))
#define HW_LCD_WF59TO56_CLR(x, v) (BME_AND32(HW_LCD_WF59TO56_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_WF59TO56_TOG(x, v) (BME_XOR32(HW_LCD_WF59TO56_ADDR(x), (uint32_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF59TO56 bitfields
 */

/*!
 * @name Register LCD_WF59TO56, field WF56[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P56 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF59TO56_WF56 (0U)          /*!< Bit position for LCD_WF59TO56_WF56. */
#define BM_LCD_WF59TO56_WF56 (0x000000FFU) /*!< Bit mask for LCD_WF59TO56_WF56. */
#define BS_LCD_WF59TO56_WF56 (8U)          /*!< Bit field size in bits for LCD_WF59TO56_WF56. */

/*! @brief Read current value of the LCD_WF59TO56_WF56 field. */
#define BR_LCD_WF59TO56_WF56(x) (BME_UBFX32(HW_LCD_WF59TO56_ADDR(x), BP_LCD_WF59TO56_WF56, BS_LCD_WF59TO56_WF56))

/*! @brief Format value for bitfield LCD_WF59TO56_WF56. */
#define BF_LCD_WF59TO56_WF56(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF59TO56_WF56) & BM_LCD_WF59TO56_WF56)

/*! @brief Set the WF56 field to a new value. */
#define BW_LCD_WF59TO56_WF56(x, v) (BME_BFI32(HW_LCD_WF59TO56_ADDR(x), ((uint32_t)(v) << BP_LCD_WF59TO56_WF56), BP_LCD_WF59TO56_WF56, 8))
/*@}*/

/*!
 * @name Register LCD_WF59TO56, field WF57[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P57 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF59TO56_WF57 (8U)          /*!< Bit position for LCD_WF59TO56_WF57. */
#define BM_LCD_WF59TO56_WF57 (0x0000FF00U) /*!< Bit mask for LCD_WF59TO56_WF57. */
#define BS_LCD_WF59TO56_WF57 (8U)          /*!< Bit field size in bits for LCD_WF59TO56_WF57. */

/*! @brief Read current value of the LCD_WF59TO56_WF57 field. */
#define BR_LCD_WF59TO56_WF57(x) (BME_UBFX32(HW_LCD_WF59TO56_ADDR(x), BP_LCD_WF59TO56_WF57, BS_LCD_WF59TO56_WF57))

/*! @brief Format value for bitfield LCD_WF59TO56_WF57. */
#define BF_LCD_WF59TO56_WF57(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF59TO56_WF57) & BM_LCD_WF59TO56_WF57)

/*! @brief Set the WF57 field to a new value. */
#define BW_LCD_WF59TO56_WF57(x, v) (BME_BFI32(HW_LCD_WF59TO56_ADDR(x), ((uint32_t)(v) << BP_LCD_WF59TO56_WF57), BP_LCD_WF59TO56_WF57, 8))
/*@}*/

/*!
 * @name Register LCD_WF59TO56, field WF58[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P58 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF59TO56_WF58 (16U)         /*!< Bit position for LCD_WF59TO56_WF58. */
#define BM_LCD_WF59TO56_WF58 (0x00FF0000U) /*!< Bit mask for LCD_WF59TO56_WF58. */
#define BS_LCD_WF59TO56_WF58 (8U)          /*!< Bit field size in bits for LCD_WF59TO56_WF58. */

/*! @brief Read current value of the LCD_WF59TO56_WF58 field. */
#define BR_LCD_WF59TO56_WF58(x) (BME_UBFX32(HW_LCD_WF59TO56_ADDR(x), BP_LCD_WF59TO56_WF58, BS_LCD_WF59TO56_WF58))

/*! @brief Format value for bitfield LCD_WF59TO56_WF58. */
#define BF_LCD_WF59TO56_WF58(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF59TO56_WF58) & BM_LCD_WF59TO56_WF58)

/*! @brief Set the WF58 field to a new value. */
#define BW_LCD_WF59TO56_WF58(x, v) (BME_BFI32(HW_LCD_WF59TO56_ADDR(x), ((uint32_t)(v) << BP_LCD_WF59TO56_WF58), BP_LCD_WF59TO56_WF58, 8))
/*@}*/

/*!
 * @name Register LCD_WF59TO56, field WF59[31:24] (RW)
 *
 * Controls segments or phases connected to LCD_P59 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
#define BP_LCD_WF59TO56_WF59 (24U)         /*!< Bit position for LCD_WF59TO56_WF59. */
#define BM_LCD_WF59TO56_WF59 (0xFF000000U) /*!< Bit mask for LCD_WF59TO56_WF59. */
#define BS_LCD_WF59TO56_WF59 (8U)          /*!< Bit field size in bits for LCD_WF59TO56_WF59. */

/*! @brief Read current value of the LCD_WF59TO56_WF59 field. */
#define BR_LCD_WF59TO56_WF59(x) (BME_UBFX32(HW_LCD_WF59TO56_ADDR(x), BP_LCD_WF59TO56_WF59, BS_LCD_WF59TO56_WF59))

/*! @brief Format value for bitfield LCD_WF59TO56_WF59. */
#define BF_LCD_WF59TO56_WF59(v) ((uint32_t)((uint32_t)(v) << BP_LCD_WF59TO56_WF59) & BM_LCD_WF59TO56_WF59)

/*! @brief Set the WF59 field to a new value. */
#define BW_LCD_WF59TO56_WF59(x, v) (BME_BFI32(HW_LCD_WF59TO56_ADDR(x), ((uint32_t)(v) << BP_LCD_WF59TO56_WF59), BP_LCD_WF59TO56_WF59, 8))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF63TO60 - LCD Waveform register
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF63TO60 - LCD Waveform register (RW)
 *
 * Reset value: 0x00000000U
 *
 * See the LCD Waveform register (WFC3TO0) for register and field descriptions.
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
typedef union _hw_lcd_wf63to60
{
    uint32_t U;
    struct _hw_lcd_wf63to60_bitfields
    {
        uint32_t WF60 : 8;             /*!< [7:0]  */
        uint32_t WF61 : 8;             /*!< [15:8]  */
        uint32_t WF62 : 8;             /*!< [23:16]  */
        uint32_t WF63 : 8;             /*!< [31:24]  */
    } B;
} hw_lcd_wf63to60_t;

/*!
 * @name Constants and macros for entire LCD_WF63TO60 register
 */
/*@{*/
#define HW_LCD_WF63TO60_ADDR(x)  ((x) + 0x5CU)

#define HW_LCD_WF63TO60(x)       (*(__IO hw_lcd_wf63to60_t *) HW_LCD_WF63TO60_ADDR(x))
#define HW_LCD_WF63TO60_RD(x)    (HW_LCD_WF63TO60(x).U)
#define HW_LCD_WF63TO60_WR(x, v) (HW_LCD_WF63TO60(x).U = (v))
#define HW_LCD_WF63TO60_SET(x, v) (BME_OR32(HW_LCD_WF63TO60_ADDR(x), (uint32_t)(v)))
#define HW_LCD_WF63TO60_CLR(x, v) (BME_AND32(HW_LCD_WF63TO60_ADDR(x), (uint32_t)(~(v))))
#define HW_LCD_WF63TO60_TOG(x, v) (BME_XOR32(HW_LCD_WF63TO60_ADDR(x), (uint32_t)(v)))
/*@}*/

