nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Format value for bitfield LCD_WF13_BPBLCD13. */
#define BF_LCD_WF13_BPBLCD13(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF13_BPBLCD13) & BM_LCD_WF13_BPBLCD13)

/*! @brief Set the BPBLCD13 field to a new value. */
#define BW_LCD_WF13_BPBLCD13(x, v) (BME_BFI8(HW_LCD_WF13_ADDR(x), ((uint8_t)(v) << BP_LCD_WF13_BPBLCD13), BP_LCD_WF13_BPBLCD13, 1))
/*@}*/

/*!
 * @name Register LCD_WF13, field BPCLCD13[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF13_BPCLCD13 (2U)          /*!< Bit position for LCD_WF13_BPCLCD13. */
#define BM_LCD_WF13_BPCLCD13 (0x04U)       /*!< Bit mask for LCD_WF13_BPCLCD13. */
#define BS_LCD_WF13_BPCLCD13 (1U)          /*!< Bit field size in bits for LCD_WF13_BPCLCD13. */

/*! @brief Read current value of the LCD_WF13_BPCLCD13 field. */
#define BR_LCD_WF13_BPCLCD13(x) (BME_UBFX8(HW_LCD_WF13_ADDR(x), BP_LCD_WF13_BPCLCD13, BS_LCD_WF13_BPCLCD13))

/*! @brief Format value for bitfield LCD_WF13_BPCLCD13. */
#define BF_LCD_WF13_BPCLCD13(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF13_BPCLCD13) & BM_LCD_WF13_BPCLCD13)

/*! @brief Set the BPCLCD13 field to a new value. */
#define BW_LCD_WF13_BPCLCD13(x, v) (BME_BFI8(HW_LCD_WF13_ADDR(x), ((uint8_t)(v) << BP_LCD_WF13_BPCLCD13), BP_LCD_WF13_BPCLCD13, 1))
/*@}*/

/*!
 * @name Register LCD_WF13, field BPDLCD13[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF13_BPDLCD13 (3U)          /*!< Bit position for LCD_WF13_BPDLCD13. */
#define BM_LCD_WF13_BPDLCD13 (0x08U)       /*!< Bit mask for LCD_WF13_BPDLCD13. */
#define BS_LCD_WF13_BPDLCD13 (1U)          /*!< Bit field size in bits for LCD_WF13_BPDLCD13. */

/*! @brief Read current value of the LCD_WF13_BPDLCD13 field. */
#define BR_LCD_WF13_BPDLCD13(x) (BME_UBFX8(HW_LCD_WF13_ADDR(x), BP_LCD_WF13_BPDLCD13, BS_LCD_WF13_BPDLCD13))

/*! @brief Format value for bitfield LCD_WF13_BPDLCD13. */
#define BF_LCD_WF13_BPDLCD13(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF13_BPDLCD13) & BM_LCD_WF13_BPDLCD13)

/*! @brief Set the BPDLCD13 field to a new value. */
#define BW_LCD_WF13_BPDLCD13(x, v) (BME_BFI8(HW_LCD_WF13_ADDR(x), ((uint8_t)(v) << BP_LCD_WF13_BPDLCD13), BP_LCD_WF13_BPDLCD13, 1))
/*@}*/

/*!
 * @name Register LCD_WF13, field BPELCD13[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF13_BPELCD13 (4U)          /*!< Bit position for LCD_WF13_BPELCD13. */
#define BM_LCD_WF13_BPELCD13 (0x10U)       /*!< Bit mask for LCD_WF13_BPELCD13. */
#define BS_LCD_WF13_BPELCD13 (1U)          /*!< Bit field size in bits for LCD_WF13_BPELCD13. */

/*! @brief Read current value of the LCD_WF13_BPELCD13 field. */
#define BR_LCD_WF13_BPELCD13(x) (BME_UBFX8(HW_LCD_WF13_ADDR(x), BP_LCD_WF13_BPELCD13, BS_LCD_WF13_BPELCD13))

/*! @brief Format value for bitfield LCD_WF13_BPELCD13. */
#define BF_LCD_WF13_BPELCD13(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF13_BPELCD13) & BM_LCD_WF13_BPELCD13)

/*! @brief Set the BPELCD13 field to a new value. */
#define BW_LCD_WF13_BPELCD13(x, v) (BME_BFI8(HW_LCD_WF13_ADDR(x), ((uint8_t)(v) << BP_LCD_WF13_BPELCD13), BP_LCD_WF13_BPELCD13, 1))
/*@}*/

/*!
 * @name Register LCD_WF13, field BPFLCD13[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF13_BPFLCD13 (5U)          /*!< Bit position for LCD_WF13_BPFLCD13. */
#define BM_LCD_WF13_BPFLCD13 (0x20U)       /*!< Bit mask for LCD_WF13_BPFLCD13. */
#define BS_LCD_WF13_BPFLCD13 (1U)          /*!< Bit field size in bits for LCD_WF13_BPFLCD13. */

/*! @brief Read current value of the LCD_WF13_BPFLCD13 field. */
#define BR_LCD_WF13_BPFLCD13(x) (BME_UBFX8(HW_LCD_WF13_ADDR(x), BP_LCD_WF13_BPFLCD13, BS_LCD_WF13_BPFLCD13))

/*! @brief Format value for bitfield LCD_WF13_BPFLCD13. */
#define BF_LCD_WF13_BPFLCD13(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF13_BPFLCD13) & BM_LCD_WF13_BPFLCD13)

/*! @brief Set the BPFLCD13 field to a new value. */
#define BW_LCD_WF13_BPFLCD13(x, v) (BME_BFI8(HW_LCD_WF13_ADDR(x), ((uint8_t)(v) << BP_LCD_WF13_BPFLCD13), BP_LCD_WF13_BPFLCD13, 1))
/*@}*/

/*!
 * @name Register LCD_WF13, field BPGLCD13[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF13_BPGLCD13 (6U)          /*!< Bit position for LCD_WF13_BPGLCD13. */
#define BM_LCD_WF13_BPGLCD13 (0x40U)       /*!< Bit mask for LCD_WF13_BPGLCD13. */
#define BS_LCD_WF13_BPGLCD13 (1U)          /*!< Bit field size in bits for LCD_WF13_BPGLCD13. */

/*! @brief Read current value of the LCD_WF13_BPGLCD13 field. */
#define BR_LCD_WF13_BPGLCD13(x) (BME_UBFX8(HW_LCD_WF13_ADDR(x), BP_LCD_WF13_BPGLCD13, BS_LCD_WF13_BPGLCD13))

/*! @brief Format value for bitfield LCD_WF13_BPGLCD13. */
#define BF_LCD_WF13_BPGLCD13(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF13_BPGLCD13) & BM_LCD_WF13_BPGLCD13)

/*! @brief Set the BPGLCD13 field to a new value. */
#define BW_LCD_WF13_BPGLCD13(x, v) (BME_BFI8(HW_LCD_WF13_ADDR(x), ((uint8_t)(v) << BP_LCD_WF13_BPGLCD13), BP_LCD_WF13_BPGLCD13, 1))
/*@}*/

/*!
 * @name Register LCD_WF13, field BPHLCD13[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF13_BPHLCD13 (7U)          /*!< Bit position for LCD_WF13_BPHLCD13. */
#define BM_LCD_WF13_BPHLCD13 (0x80U)       /*!< Bit mask for LCD_WF13_BPHLCD13. */
#define BS_LCD_WF13_BPHLCD13 (1U)          /*!< Bit field size in bits for LCD_WF13_BPHLCD13. */

/*! @brief Read current value of the LCD_WF13_BPHLCD13 field. */
#define BR_LCD_WF13_BPHLCD13(x) (BME_UBFX8(HW_LCD_WF13_ADDR(x), BP_LCD_WF13_BPHLCD13, BS_LCD_WF13_BPHLCD13))

/*! @brief Format value for bitfield LCD_WF13_BPHLCD13. */
#define BF_LCD_WF13_BPHLCD13(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF13_BPHLCD13) & BM_LCD_WF13_BPHLCD13)

/*! @brief Set the BPHLCD13 field to a new value. */
#define BW_LCD_WF13_BPHLCD13(x, v) (BME_BFI8(HW_LCD_WF13_ADDR(x), ((uint8_t)(v) << BP_LCD_WF13_BPHLCD13), BP_LCD_WF13_BPHLCD13, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF14 - LCD Waveform Register 14.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF14 - LCD Waveform Register 14. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf14
{
    uint8_t U;
    struct _hw_lcd_wf14_bitfields
    {
        uint8_t BPALCD14 : 1;          /*!< [0]  */
        uint8_t BPBLCD14 : 1;          /*!< [1]  */
        uint8_t BPCLCD14 : 1;          /*!< [2]  */
        uint8_t BPDLCD14 : 1;          /*!< [3]  */
        uint8_t BPELCD14 : 1;          /*!< [4]  */
        uint8_t BPFLCD14 : 1;          /*!< [5]  */
        uint8_t BPGLCD14 : 1;          /*!< [6]  */
        uint8_t BPHLCD14 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf14_t;

/*!
 * @name Constants and macros for entire LCD_WF14 register
 */
/*@{*/
#define HW_LCD_WF14_ADDR(x)      ((x) + 0x2EU)

