nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Read current value of the LCD_WF19_BPDLCD19 field. */
#define BR_LCD_WF19_BPDLCD19(x) (BME_UBFX8(HW_LCD_WF19_ADDR(x), BP_LCD_WF19_BPDLCD19, BS_LCD_WF19_BPDLCD19))

/*! @brief Format value for bitfield LCD_WF19_BPDLCD19. */
#define BF_LCD_WF19_BPDLCD19(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF19_BPDLCD19) & BM_LCD_WF19_BPDLCD19)

/*! @brief Set the BPDLCD19 field to a new value. */
#define BW_LCD_WF19_BPDLCD19(x, v) (BME_BFI8(HW_LCD_WF19_ADDR(x), ((uint8_t)(v) << BP_LCD_WF19_BPDLCD19), BP_LCD_WF19_BPDLCD19, 1))
/*@}*/

/*!
 * @name Register LCD_WF19, field BPELCD19[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF19_BPELCD19 (4U)          /*!< Bit position for LCD_WF19_BPELCD19. */
#define BM_LCD_WF19_BPELCD19 (0x10U)       /*!< Bit mask for LCD_WF19_BPELCD19. */
#define BS_LCD_WF19_BPELCD19 (1U)          /*!< Bit field size in bits for LCD_WF19_BPELCD19. */

/*! @brief Read current value of the LCD_WF19_BPELCD19 field. */
#define BR_LCD_WF19_BPELCD19(x) (BME_UBFX8(HW_LCD_WF19_ADDR(x), BP_LCD_WF19_BPELCD19, BS_LCD_WF19_BPELCD19))

/*! @brief Format value for bitfield LCD_WF19_BPELCD19. */
#define BF_LCD_WF19_BPELCD19(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF19_BPELCD19) & BM_LCD_WF19_BPELCD19)

/*! @brief Set the BPELCD19 field to a new value. */
#define BW_LCD_WF19_BPELCD19(x, v) (BME_BFI8(HW_LCD_WF19_ADDR(x), ((uint8_t)(v) << BP_LCD_WF19_BPELCD19), BP_LCD_WF19_BPELCD19, 1))
/*@}*/

/*!
 * @name Register LCD_WF19, field BPFLCD19[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF19_BPFLCD19 (5U)          /*!< Bit position for LCD_WF19_BPFLCD19. */
#define BM_LCD_WF19_BPFLCD19 (0x20U)       /*!< Bit mask for LCD_WF19_BPFLCD19. */
#define BS_LCD_WF19_BPFLCD19 (1U)          /*!< Bit field size in bits for LCD_WF19_BPFLCD19. */

/*! @brief Read current value of the LCD_WF19_BPFLCD19 field. */
#define BR_LCD_WF19_BPFLCD19(x) (BME_UBFX8(HW_LCD_WF19_ADDR(x), BP_LCD_WF19_BPFLCD19, BS_LCD_WF19_BPFLCD19))

/*! @brief Format value for bitfield LCD_WF19_BPFLCD19. */
#define BF_LCD_WF19_BPFLCD19(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF19_BPFLCD19) & BM_LCD_WF19_BPFLCD19)

/*! @brief Set the BPFLCD19 field to a new value. */
#define BW_LCD_WF19_BPFLCD19(x, v) (BME_BFI8(HW_LCD_WF19_ADDR(x), ((uint8_t)(v) << BP_LCD_WF19_BPFLCD19), BP_LCD_WF19_BPFLCD19, 1))
/*@}*/

/*!
 * @name Register LCD_WF19, field BPGLCD19[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF19_BPGLCD19 (6U)          /*!< Bit position for LCD_WF19_BPGLCD19. */
#define BM_LCD_WF19_BPGLCD19 (0x40U)       /*!< Bit mask for LCD_WF19_BPGLCD19. */
#define BS_LCD_WF19_BPGLCD19 (1U)          /*!< Bit field size in bits for LCD_WF19_BPGLCD19. */

/*! @brief Read current value of the LCD_WF19_BPGLCD19 field. */
#define BR_LCD_WF19_BPGLCD19(x) (BME_UBFX8(HW_LCD_WF19_ADDR(x), BP_LCD_WF19_BPGLCD19, BS_LCD_WF19_BPGLCD19))

/*! @brief Format value for bitfield LCD_WF19_BPGLCD19. */
#define BF_LCD_WF19_BPGLCD19(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF19_BPGLCD19) & BM_LCD_WF19_BPGLCD19)

/*! @brief Set the BPGLCD19 field to a new value. */
#define BW_LCD_WF19_BPGLCD19(x, v) (BME_BFI8(HW_LCD_WF19_ADDR(x), ((uint8_t)(v) << BP_LCD_WF19_BPGLCD19), BP_LCD_WF19_BPGLCD19, 1))
/*@}*/

/*!
 * @name Register LCD_WF19, field BPHLCD19[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF19_BPHLCD19 (7U)          /*!< Bit position for LCD_WF19_BPHLCD19. */
#define BM_LCD_WF19_BPHLCD19 (0x80U)       /*!< Bit mask for LCD_WF19_BPHLCD19. */
#define BS_LCD_WF19_BPHLCD19 (1U)          /*!< Bit field size in bits for LCD_WF19_BPHLCD19. */

/*! @brief Read current value of the LCD_WF19_BPHLCD19 field. */
#define BR_LCD_WF19_BPHLCD19(x) (BME_UBFX8(HW_LCD_WF19_ADDR(x), BP_LCD_WF19_BPHLCD19, BS_LCD_WF19_BPHLCD19))

/*! @brief Format value for bitfield LCD_WF19_BPHLCD19. */
#define BF_LCD_WF19_BPHLCD19(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF19_BPHLCD19) & BM_LCD_WF19_BPHLCD19)

/*! @brief Set the BPHLCD19 field to a new value. */
#define BW_LCD_WF19_BPHLCD19(x, v) (BME_BFI8(HW_LCD_WF19_ADDR(x), ((uint8_t)(v) << BP_LCD_WF19_BPHLCD19), BP_LCD_WF19_BPHLCD19, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF20 - LCD Waveform Register 20.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF20 - LCD Waveform Register 20. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf20
{
    uint8_t U;
    struct _hw_lcd_wf20_bitfields
    {
        uint8_t BPALCD20 : 1;          /*!< [0]  */
        uint8_t BPBLCD20 : 1;          /*!< [1]  */
        uint8_t BPCLCD20 : 1;          /*!< [2]  */
        uint8_t BPDLCD20 : 1;          /*!< [3]  */
        uint8_t BPELCD20 : 1;          /*!< [4]  */
        uint8_t BPFLCD20 : 1;          /*!< [5]  */
        uint8_t BPGLCD20 : 1;          /*!< [6]  */
        uint8_t BPHLCD20 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf20_t;

/*!
 * @name Constants and macros for entire LCD_WF20 register
 */
/*@{*/
#define HW_LCD_WF20_ADDR(x)      ((x) + 0x34U)

#define HW_LCD_WF20(x)           (*(__IO hw_lcd_wf20_t *) HW_LCD_WF20_ADDR(x))
#define HW_LCD_WF20_RD(x)        (HW_LCD_WF20(x).U)
#define HW_LCD_WF20_WR(x, v)     (HW_LCD_WF20(x).U = (v))
#define HW_LCD_WF20_SET(x, v)    (BME_OR8(HW_LCD_WF20_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF20_CLR(x, v)    (BME_AND8(HW_LCD_WF20_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF20_TOG(x, v)    (BME_XOR8(HW_LCD_WF20_ADDR(x), (uint8_t)(v)))
/*@}*/

