nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Read current value of the LCD_WF21_BPDLCD21 field. */
#define BR_LCD_WF21_BPDLCD21(x) (BME_UBFX8(HW_LCD_WF21_ADDR(x), BP_LCD_WF21_BPDLCD21, BS_LCD_WF21_BPDLCD21))

/*! @brief Format value for bitfield LCD_WF21_BPDLCD21. */
#define BF_LCD_WF21_BPDLCD21(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF21_BPDLCD21) & BM_LCD_WF21_BPDLCD21)

/*! @brief Set the BPDLCD21 field to a new value. */
#define BW_LCD_WF21_BPDLCD21(x, v) (BME_BFI8(HW_LCD_WF21_ADDR(x), ((uint8_t)(v) << BP_LCD_WF21_BPDLCD21), BP_LCD_WF21_BPDLCD21, 1))
/*@}*/

/*!
 * @name Register LCD_WF21, field BPELCD21[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF21_BPELCD21 (4U)          /*!< Bit position for LCD_WF21_BPELCD21. */
#define BM_LCD_WF21_BPELCD21 (0x10U)       /*!< Bit mask for LCD_WF21_BPELCD21. */
#define BS_LCD_WF21_BPELCD21 (1U)          /*!< Bit field size in bits for LCD_WF21_BPELCD21. */

/*! @brief Read current value of the LCD_WF21_BPELCD21 field. */
#define BR_LCD_WF21_BPELCD21(x) (BME_UBFX8(HW_LCD_WF21_ADDR(x), BP_LCD_WF21_BPELCD21, BS_LCD_WF21_BPELCD21))

/*! @brief Format value for bitfield LCD_WF21_BPELCD21. */
#define BF_LCD_WF21_BPELCD21(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF21_BPELCD21) & BM_LCD_WF21_BPELCD21)

/*! @brief Set the BPELCD21 field to a new value. */
#define BW_LCD_WF21_BPELCD21(x, v) (BME_BFI8(HW_LCD_WF21_ADDR(x), ((uint8_t)(v) << BP_LCD_WF21_BPELCD21), BP_LCD_WF21_BPELCD21, 1))
/*@}*/

/*!
 * @name Register LCD_WF21, field BPFLCD21[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF21_BPFLCD21 (5U)          /*!< Bit position for LCD_WF21_BPFLCD21. */
#define BM_LCD_WF21_BPFLCD21 (0x20U)       /*!< Bit mask for LCD_WF21_BPFLCD21. */
#define BS_LCD_WF21_BPFLCD21 (1U)          /*!< Bit field size in bits for LCD_WF21_BPFLCD21. */

/*! @brief Read current value of the LCD_WF21_BPFLCD21 field. */
#define BR_LCD_WF21_BPFLCD21(x) (BME_UBFX8(HW_LCD_WF21_ADDR(x), BP_LCD_WF21_BPFLCD21, BS_LCD_WF21_BPFLCD21))

/*! @brief Format value for bitfield LCD_WF21_BPFLCD21. */
#define BF_LCD_WF21_BPFLCD21(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF21_BPFLCD21) & BM_LCD_WF21_BPFLCD21)

/*! @brief Set the BPFLCD21 field to a new value. */
#define BW_LCD_WF21_BPFLCD21(x, v) (BME_BFI8(HW_LCD_WF21_ADDR(x), ((uint8_t)(v) << BP_LCD_WF21_BPFLCD21), BP_LCD_WF21_BPFLCD21, 1))
/*@}*/

/*!
 * @name Register LCD_WF21, field BPGLCD21[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF21_BPGLCD21 (6U)          /*!< Bit position for LCD_WF21_BPGLCD21. */
#define BM_LCD_WF21_BPGLCD21 (0x40U)       /*!< Bit mask for LCD_WF21_BPGLCD21. */
#define BS_LCD_WF21_BPGLCD21 (1U)          /*!< Bit field size in bits for LCD_WF21_BPGLCD21. */

/*! @brief Read current value of the LCD_WF21_BPGLCD21 field. */
#define BR_LCD_WF21_BPGLCD21(x) (BME_UBFX8(HW_LCD_WF21_ADDR(x), BP_LCD_WF21_BPGLCD21, BS_LCD_WF21_BPGLCD21))

/*! @brief Format value for bitfield LCD_WF21_BPGLCD21. */
#define BF_LCD_WF21_BPGLCD21(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF21_BPGLCD21) & BM_LCD_WF21_BPGLCD21)

/*! @brief Set the BPGLCD21 field to a new value. */
#define BW_LCD_WF21_BPGLCD21(x, v) (BME_BFI8(HW_LCD_WF21_ADDR(x), ((uint8_t)(v) << BP_LCD_WF21_BPGLCD21), BP_LCD_WF21_BPGLCD21, 1))
/*@}*/

/*!
 * @name Register LCD_WF21, field BPHLCD21[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF21_BPHLCD21 (7U)          /*!< Bit position for LCD_WF21_BPHLCD21. */
#define BM_LCD_WF21_BPHLCD21 (0x80U)       /*!< Bit mask for LCD_WF21_BPHLCD21. */
#define BS_LCD_WF21_BPHLCD21 (1U)          /*!< Bit field size in bits for LCD_WF21_BPHLCD21. */

/*! @brief Read current value of the LCD_WF21_BPHLCD21 field. */
#define BR_LCD_WF21_BPHLCD21(x) (BME_UBFX8(HW_LCD_WF21_ADDR(x), BP_LCD_WF21_BPHLCD21, BS_LCD_WF21_BPHLCD21))

/*! @brief Format value for bitfield LCD_WF21_BPHLCD21. */
#define BF_LCD_WF21_BPHLCD21(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF21_BPHLCD21) & BM_LCD_WF21_BPHLCD21)

/*! @brief Set the BPHLCD21 field to a new value. */
#define BW_LCD_WF21_BPHLCD21(x, v) (BME_BFI8(HW_LCD_WF21_ADDR(x), ((uint8_t)(v) << BP_LCD_WF21_BPHLCD21), BP_LCD_WF21_BPHLCD21, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF22 - LCD Waveform Register 22.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF22 - LCD Waveform Register 22. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf22
{
    uint8_t U;
    struct _hw_lcd_wf22_bitfields
    {
        uint8_t BPALCD22 : 1;          /*!< [0]  */
        uint8_t BPBLCD22 : 1;          /*!< [1]  */
        uint8_t BPCLCD22 : 1;          /*!< [2]  */
        uint8_t BPDLCD22 : 1;          /*!< [3]  */
        uint8_t BPELCD22 : 1;          /*!< [4]  */
        uint8_t BPFLCD22 : 1;          /*!< [5]  */
        uint8_t BPGLCD22 : 1;          /*!< [6]  */
        uint8_t BPHLCD22 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf22_t;

/*!
 * @name Constants and macros for entire LCD_WF22 register
 */
/*@{*/
#define HW_LCD_WF22_ADDR(x)      ((x) + 0x36U)

#define HW_LCD_WF22(x)           (*(__IO hw_lcd_wf22_t *) HW_LCD_WF22_ADDR(x))
#define HW_LCD_WF22_RD(x)        (HW_LCD_WF22(x).U)
#define HW_LCD_WF22_WR(x, v)     (HW_LCD_WF22(x).U = (v))
#define HW_LCD_WF22_SET(x, v)    (BME_OR8(HW_LCD_WF22_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF22_CLR(x, v)    (BME_AND8(HW_LCD_WF22_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF22_TOG(x, v)    (BME_XOR8(HW_LCD_WF22_ADDR(x), (uint8_t)(v)))
/*@}*/

