nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*
 * Constants & macros for individual LCD_WF24 bitfields
 */

/*!
 * @name Register LCD_WF24, field BPALCD24[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF24_BPALCD24 (0U)          /*!< Bit position for LCD_WF24_BPALCD24. */
#define BM_LCD_WF24_BPALCD24 (0x01U)       /*!< Bit mask for LCD_WF24_BPALCD24. */
#define BS_LCD_WF24_BPALCD24 (1U)          /*!< Bit field size in bits for LCD_WF24_BPALCD24. */

/*! @brief Read current value of the LCD_WF24_BPALCD24 field. */
#define BR_LCD_WF24_BPALCD24(x) (BME_UBFX8(HW_LCD_WF24_ADDR(x), BP_LCD_WF24_BPALCD24, BS_LCD_WF24_BPALCD24))

/*! @brief Format value for bitfield LCD_WF24_BPALCD24. */
#define BF_LCD_WF24_BPALCD24(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF24_BPALCD24) & BM_LCD_WF24_BPALCD24)

/*! @brief Set the BPALCD24 field to a new value. */
#define BW_LCD_WF24_BPALCD24(x, v) (BME_BFI8(HW_LCD_WF24_ADDR(x), ((uint8_t)(v) << BP_LCD_WF24_BPALCD24), BP_LCD_WF24_BPALCD24, 1))
/*@}*/

/*!
 * @name Register LCD_WF24, field BPBLCD24[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF24_BPBLCD24 (1U)          /*!< Bit position for LCD_WF24_BPBLCD24. */
#define BM_LCD_WF24_BPBLCD24 (0x02U)       /*!< Bit mask for LCD_WF24_BPBLCD24. */
#define BS_LCD_WF24_BPBLCD24 (1U)          /*!< Bit field size in bits for LCD_WF24_BPBLCD24. */

/*! @brief Read current value of the LCD_WF24_BPBLCD24 field. */
#define BR_LCD_WF24_BPBLCD24(x) (BME_UBFX8(HW_LCD_WF24_ADDR(x), BP_LCD_WF24_BPBLCD24, BS_LCD_WF24_BPBLCD24))

/*! @brief Format value for bitfield LCD_WF24_BPBLCD24. */
#define BF_LCD_WF24_BPBLCD24(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF24_BPBLCD24) & BM_LCD_WF24_BPBLCD24)

/*! @brief Set the BPBLCD24 field to a new value. */
#define BW_LCD_WF24_BPBLCD24(x, v) (BME_BFI8(HW_LCD_WF24_ADDR(x), ((uint8_t)(v) << BP_LCD_WF24_BPBLCD24), BP_LCD_WF24_BPBLCD24, 1))
/*@}*/

/*!
 * @name Register LCD_WF24, field BPCLCD24[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF24_BPCLCD24 (2U)          /*!< Bit position for LCD_WF24_BPCLCD24. */
#define BM_LCD_WF24_BPCLCD24 (0x04U)       /*!< Bit mask for LCD_WF24_BPCLCD24. */
#define BS_LCD_WF24_BPCLCD24 (1U)          /*!< Bit field size in bits for LCD_WF24_BPCLCD24. */

/*! @brief Read current value of the LCD_WF24_BPCLCD24 field. */
#define BR_LCD_WF24_BPCLCD24(x) (BME_UBFX8(HW_LCD_WF24_ADDR(x), BP_LCD_WF24_BPCLCD24, BS_LCD_WF24_BPCLCD24))

/*! @brief Format value for bitfield LCD_WF24_BPCLCD24. */
#define BF_LCD_WF24_BPCLCD24(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF24_BPCLCD24) & BM_LCD_WF24_BPCLCD24)

/*! @brief Set the BPCLCD24 field to a new value. */
#define BW_LCD_WF24_BPCLCD24(x, v) (BME_BFI8(HW_LCD_WF24_ADDR(x), ((uint8_t)(v) << BP_LCD_WF24_BPCLCD24), BP_LCD_WF24_BPCLCD24, 1))
/*@}*/

/*!
 * @name Register LCD_WF24, field BPDLCD24[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF24_BPDLCD24 (3U)          /*!< Bit position for LCD_WF24_BPDLCD24. */
#define BM_LCD_WF24_BPDLCD24 (0x08U)       /*!< Bit mask for LCD_WF24_BPDLCD24. */
#define BS_LCD_WF24_BPDLCD24 (1U)          /*!< Bit field size in bits for LCD_WF24_BPDLCD24. */

/*! @brief Read current value of the LCD_WF24_BPDLCD24 field. */
#define BR_LCD_WF24_BPDLCD24(x) (BME_UBFX8(HW_LCD_WF24_ADDR(x), BP_LCD_WF24_BPDLCD24, BS_LCD_WF24_BPDLCD24))

/*! @brief Format value for bitfield LCD_WF24_BPDLCD24. */
#define BF_LCD_WF24_BPDLCD24(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF24_BPDLCD24) & BM_LCD_WF24_BPDLCD24)

/*! @brief Set the BPDLCD24 field to a new value. */
#define BW_LCD_WF24_BPDLCD24(x, v) (BME_BFI8(HW_LCD_WF24_ADDR(x), ((uint8_t)(v) << BP_LCD_WF24_BPDLCD24), BP_LCD_WF24_BPDLCD24, 1))
/*@}*/

/*!
 * @name Register LCD_WF24, field BPELCD24[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF24_BPELCD24 (4U)          /*!< Bit position for LCD_WF24_BPELCD24. */
#define BM_LCD_WF24_BPELCD24 (0x10U)       /*!< Bit mask for LCD_WF24_BPELCD24. */
#define BS_LCD_WF24_BPELCD24 (1U)          /*!< Bit field size in bits for LCD_WF24_BPELCD24. */

/*! @brief Read current value of the LCD_WF24_BPELCD24 field. */
#define BR_LCD_WF24_BPELCD24(x) (BME_UBFX8(HW_LCD_WF24_ADDR(x), BP_LCD_WF24_BPELCD24, BS_LCD_WF24_BPELCD24))

/*! @brief Format value for bitfield LCD_WF24_BPELCD24. */
#define BF_LCD_WF24_BPELCD24(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF24_BPELCD24) & BM_LCD_WF24_BPELCD24)

/*! @brief Set the BPELCD24 field to a new value. */
#define BW_LCD_WF24_BPELCD24(x, v) (BME_BFI8(HW_LCD_WF24_ADDR(x), ((uint8_t)(v) << BP_LCD_WF24_BPELCD24), BP_LCD_WF24_BPELCD24, 1))
/*@}*/

/*!
 * @name Register LCD_WF24, field BPFLCD24[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF24_BPFLCD24 (5U)          /*!< Bit position for LCD_WF24_BPFLCD24. */
#define BM_LCD_WF24_BPFLCD24 (0x20U)       /*!< Bit mask for LCD_WF24_BPFLCD24. */
#define BS_LCD_WF24_BPFLCD24 (1U)          /*!< Bit field size in bits for LCD_WF24_BPFLCD24. */

/*! @brief Read current value of the LCD_WF24_BPFLCD24 field. */
#define BR_LCD_WF24_BPFLCD24(x) (BME_UBFX8(HW_LCD_WF24_ADDR(x), BP_LCD_WF24_BPFLCD24, BS_LCD_WF24_BPFLCD24))

/*! @brief Format value for bitfield LCD_WF24_BPFLCD24. */
#define BF_LCD_WF24_BPFLCD24(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF24_BPFLCD24) & BM_LCD_WF24_BPFLCD24)

/*! @brief Set the BPFLCD24 field to a new value. */
#define BW_LCD_WF24_BPFLCD24(x, v) (BME_BFI8(HW_LCD_WF24_ADDR(x), ((uint8_t)(v) << BP_LCD_WF24_BPFLCD24), BP_LCD_WF24_BPFLCD24, 1))
/*@}*/

/*!
 * @name Register LCD_WF24, field BPGLCD24[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF24_BPGLCD24 (6U)          /*!< Bit position for LCD_WF24_BPGLCD24. */
#define BM_LCD_WF24_BPGLCD24 (0x40U)       /*!< Bit mask for LCD_WF24_BPGLCD24. */
#define BS_LCD_WF24_BPGLCD24 (1U)          /*!< Bit field size in bits for LCD_WF24_BPGLCD24. */

/*! @brief Read current value of the LCD_WF24_BPGLCD24 field. */
#define BR_LCD_WF24_BPGLCD24(x) (BME_UBFX8(HW_LCD_WF24_ADDR(x), BP_LCD_WF24_BPGLCD24, BS_LCD_WF24_BPGLCD24))

/*! @brief Format value for bitfield LCD_WF24_BPGLCD24. */
#define BF_LCD_WF24_BPGLCD24(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF24_BPGLCD24) & BM_LCD_WF24_BPGLCD24)

