nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Set the BPGLCD24 field to a new value. */
#define BW_LCD_WF24_BPGLCD24(x, v) (BME_BFI8(HW_LCD_WF24_ADDR(x), ((uint8_t)(v) << BP_LCD_WF24_BPGLCD24), BP_LCD_WF24_BPGLCD24, 1))
/*@}*/

/*!
 * @name Register LCD_WF24, field BPHLCD24[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF24_BPHLCD24 (7U)          /*!< Bit position for LCD_WF24_BPHLCD24. */
#define BM_LCD_WF24_BPHLCD24 (0x80U)       /*!< Bit mask for LCD_WF24_BPHLCD24. */
#define BS_LCD_WF24_BPHLCD24 (1U)          /*!< Bit field size in bits for LCD_WF24_BPHLCD24. */

/*! @brief Read current value of the LCD_WF24_BPHLCD24 field. */
#define BR_LCD_WF24_BPHLCD24(x) (BME_UBFX8(HW_LCD_WF24_ADDR(x), BP_LCD_WF24_BPHLCD24, BS_LCD_WF24_BPHLCD24))

/*! @brief Format value for bitfield LCD_WF24_BPHLCD24. */
#define BF_LCD_WF24_BPHLCD24(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF24_BPHLCD24) & BM_LCD_WF24_BPHLCD24)

/*! @brief Set the BPHLCD24 field to a new value. */
#define BW_LCD_WF24_BPHLCD24(x, v) (BME_BFI8(HW_LCD_WF24_ADDR(x), ((uint8_t)(v) << BP_LCD_WF24_BPHLCD24), BP_LCD_WF24_BPHLCD24, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF25 - LCD Waveform Register 25.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF25 - LCD Waveform Register 25. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf25
{
    uint8_t U;
    struct _hw_lcd_wf25_bitfields
    {
        uint8_t BPALCD25 : 1;          /*!< [0]  */
        uint8_t BPBLCD25 : 1;          /*!< [1]  */
        uint8_t BPCLCD25 : 1;          /*!< [2]  */
        uint8_t BPDLCD25 : 1;          /*!< [3]  */
        uint8_t BPELCD25 : 1;          /*!< [4]  */
        uint8_t BPFLCD25 : 1;          /*!< [5]  */
        uint8_t BPGLCD25 : 1;          /*!< [6]  */
        uint8_t BPHLCD25 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf25_t;

/*!
 * @name Constants and macros for entire LCD_WF25 register
 */
/*@{*/
#define HW_LCD_WF25_ADDR(x)      ((x) + 0x39U)

#define HW_LCD_WF25(x)           (*(__IO hw_lcd_wf25_t *) HW_LCD_WF25_ADDR(x))
#define HW_LCD_WF25_RD(x)        (HW_LCD_WF25(x).U)
#define HW_LCD_WF25_WR(x, v)     (HW_LCD_WF25(x).U = (v))
#define HW_LCD_WF25_SET(x, v)    (BME_OR8(HW_LCD_WF25_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF25_CLR(x, v)    (BME_AND8(HW_LCD_WF25_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF25_TOG(x, v)    (BME_XOR8(HW_LCD_WF25_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF25 bitfields
 */

/*!
 * @name Register LCD_WF25, field BPALCD25[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF25_BPALCD25 (0U)          /*!< Bit position for LCD_WF25_BPALCD25. */
#define BM_LCD_WF25_BPALCD25 (0x01U)       /*!< Bit mask for LCD_WF25_BPALCD25. */
#define BS_LCD_WF25_BPALCD25 (1U)          /*!< Bit field size in bits for LCD_WF25_BPALCD25. */

/*! @brief Read current value of the LCD_WF25_BPALCD25 field. */
#define BR_LCD_WF25_BPALCD25(x) (BME_UBFX8(HW_LCD_WF25_ADDR(x), BP_LCD_WF25_BPALCD25, BS_LCD_WF25_BPALCD25))

/*! @brief Format value for bitfield LCD_WF25_BPALCD25. */
#define BF_LCD_WF25_BPALCD25(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF25_BPALCD25) & BM_LCD_WF25_BPALCD25)

/*! @brief Set the BPALCD25 field to a new value. */
#define BW_LCD_WF25_BPALCD25(x, v) (BME_BFI8(HW_LCD_WF25_ADDR(x), ((uint8_t)(v) << BP_LCD_WF25_BPALCD25), BP_LCD_WF25_BPALCD25, 1))
/*@}*/

/*!
 * @name Register LCD_WF25, field BPBLCD25[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF25_BPBLCD25 (1U)          /*!< Bit position for LCD_WF25_BPBLCD25. */
#define BM_LCD_WF25_BPBLCD25 (0x02U)       /*!< Bit mask for LCD_WF25_BPBLCD25. */
#define BS_LCD_WF25_BPBLCD25 (1U)          /*!< Bit field size in bits for LCD_WF25_BPBLCD25. */

/*! @brief Read current value of the LCD_WF25_BPBLCD25 field. */
#define BR_LCD_WF25_BPBLCD25(x) (BME_UBFX8(HW_LCD_WF25_ADDR(x), BP_LCD_WF25_BPBLCD25, BS_LCD_WF25_BPBLCD25))

/*! @brief Format value for bitfield LCD_WF25_BPBLCD25. */
#define BF_LCD_WF25_BPBLCD25(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF25_BPBLCD25) & BM_LCD_WF25_BPBLCD25)

/*! @brief Set the BPBLCD25 field to a new value. */
#define BW_LCD_WF25_BPBLCD25(x, v) (BME_BFI8(HW_LCD_WF25_ADDR(x), ((uint8_t)(v) << BP_LCD_WF25_BPBLCD25), BP_LCD_WF25_BPBLCD25, 1))
/*@}*/

/*!
 * @name Register LCD_WF25, field BPCLCD25[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF25_BPCLCD25 (2U)          /*!< Bit position for LCD_WF25_BPCLCD25. */
#define BM_LCD_WF25_BPCLCD25 (0x04U)       /*!< Bit mask for LCD_WF25_BPCLCD25. */
#define BS_LCD_WF25_BPCLCD25 (1U)          /*!< Bit field size in bits for LCD_WF25_BPCLCD25. */

/*! @brief Read current value of the LCD_WF25_BPCLCD25 field. */
#define BR_LCD_WF25_BPCLCD25(x) (BME_UBFX8(HW_LCD_WF25_ADDR(x), BP_LCD_WF25_BPCLCD25, BS_LCD_WF25_BPCLCD25))

/*! @brief Format value for bitfield LCD_WF25_BPCLCD25. */
#define BF_LCD_WF25_BPCLCD25(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF25_BPCLCD25) & BM_LCD_WF25_BPCLCD25)

/*! @brief Set the BPCLCD25 field to a new value. */
#define BW_LCD_WF25_BPCLCD25(x, v) (BME_BFI8(HW_LCD_WF25_ADDR(x), ((uint8_t)(v) << BP_LCD_WF25_BPCLCD25), BP_LCD_WF25_BPCLCD25, 1))
/*@}*/

/*!
 * @name Register LCD_WF25, field BPDLCD25[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF25_BPDLCD25 (3U)          /*!< Bit position for LCD_WF25_BPDLCD25. */
#define BM_LCD_WF25_BPDLCD25 (0x08U)       /*!< Bit mask for LCD_WF25_BPDLCD25. */
#define BS_LCD_WF25_BPDLCD25 (1U)          /*!< Bit field size in bits for LCD_WF25_BPDLCD25. */

/*! @brief Read current value of the LCD_WF25_BPDLCD25 field. */
#define BR_LCD_WF25_BPDLCD25(x) (BME_UBFX8(HW_LCD_WF25_ADDR(x), BP_LCD_WF25_BPDLCD25, BS_LCD_WF25_BPDLCD25))

/*! @brief Format value for bitfield LCD_WF25_BPDLCD25. */
#define BF_LCD_WF25_BPDLCD25(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF25_BPDLCD25) & BM_LCD_WF25_BPDLCD25)

