nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Format value for bitfield LCD_WF28_BPDLCD28. */
#define BF_LCD_WF28_BPDLCD28(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF28_BPDLCD28) & BM_LCD_WF28_BPDLCD28)

/*! @brief Set the BPDLCD28 field to a new value. */
#define BW_LCD_WF28_BPDLCD28(x, v) (BME_BFI8(HW_LCD_WF28_ADDR(x), ((uint8_t)(v) << BP_LCD_WF28_BPDLCD28), BP_LCD_WF28_BPDLCD28, 1))
/*@}*/

/*!
 * @name Register LCD_WF28, field BPELCD28[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF28_BPELCD28 (4U)          /*!< Bit position for LCD_WF28_BPELCD28. */
#define BM_LCD_WF28_BPELCD28 (0x10U)       /*!< Bit mask for LCD_WF28_BPELCD28. */
#define BS_LCD_WF28_BPELCD28 (1U)          /*!< Bit field size in bits for LCD_WF28_BPELCD28. */

/*! @brief Read current value of the LCD_WF28_BPELCD28 field. */
#define BR_LCD_WF28_BPELCD28(x) (BME_UBFX8(HW_LCD_WF28_ADDR(x), BP_LCD_WF28_BPELCD28, BS_LCD_WF28_BPELCD28))

/*! @brief Format value for bitfield LCD_WF28_BPELCD28. */
#define BF_LCD_WF28_BPELCD28(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF28_BPELCD28) & BM_LCD_WF28_BPELCD28)

/*! @brief Set the BPELCD28 field to a new value. */
#define BW_LCD_WF28_BPELCD28(x, v) (BME_BFI8(HW_LCD_WF28_ADDR(x), ((uint8_t)(v) << BP_LCD_WF28_BPELCD28), BP_LCD_WF28_BPELCD28, 1))
/*@}*/

/*!
 * @name Register LCD_WF28, field BPFLCD28[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF28_BPFLCD28 (5U)          /*!< Bit position for LCD_WF28_BPFLCD28. */
#define BM_LCD_WF28_BPFLCD28 (0x20U)       /*!< Bit mask for LCD_WF28_BPFLCD28. */
#define BS_LCD_WF28_BPFLCD28 (1U)          /*!< Bit field size in bits for LCD_WF28_BPFLCD28. */

/*! @brief Read current value of the LCD_WF28_BPFLCD28 field. */
#define BR_LCD_WF28_BPFLCD28(x) (BME_UBFX8(HW_LCD_WF28_ADDR(x), BP_LCD_WF28_BPFLCD28, BS_LCD_WF28_BPFLCD28))

/*! @brief Format value for bitfield LCD_WF28_BPFLCD28. */
#define BF_LCD_WF28_BPFLCD28(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF28_BPFLCD28) & BM_LCD_WF28_BPFLCD28)

/*! @brief Set the BPFLCD28 field to a new value. */
#define BW_LCD_WF28_BPFLCD28(x, v) (BME_BFI8(HW_LCD_WF28_ADDR(x), ((uint8_t)(v) << BP_LCD_WF28_BPFLCD28), BP_LCD_WF28_BPFLCD28, 1))
/*@}*/

/*!
 * @name Register LCD_WF28, field BPGLCD28[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF28_BPGLCD28 (6U)          /*!< Bit position for LCD_WF28_BPGLCD28. */
#define BM_LCD_WF28_BPGLCD28 (0x40U)       /*!< Bit mask for LCD_WF28_BPGLCD28. */
#define BS_LCD_WF28_BPGLCD28 (1U)          /*!< Bit field size in bits for LCD_WF28_BPGLCD28. */

/*! @brief Read current value of the LCD_WF28_BPGLCD28 field. */
#define BR_LCD_WF28_BPGLCD28(x) (BME_UBFX8(HW_LCD_WF28_ADDR(x), BP_LCD_WF28_BPGLCD28, BS_LCD_WF28_BPGLCD28))

/*! @brief Format value for bitfield LCD_WF28_BPGLCD28. */
#define BF_LCD_WF28_BPGLCD28(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF28_BPGLCD28) & BM_LCD_WF28_BPGLCD28)

/*! @brief Set the BPGLCD28 field to a new value. */
#define BW_LCD_WF28_BPGLCD28(x, v) (BME_BFI8(HW_LCD_WF28_ADDR(x), ((uint8_t)(v) << BP_LCD_WF28_BPGLCD28), BP_LCD_WF28_BPGLCD28, 1))
/*@}*/

/*!
 * @name Register LCD_WF28, field BPHLCD28[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF28_BPHLCD28 (7U)          /*!< Bit position for LCD_WF28_BPHLCD28. */
#define BM_LCD_WF28_BPHLCD28 (0x80U)       /*!< Bit mask for LCD_WF28_BPHLCD28. */
#define BS_LCD_WF28_BPHLCD28 (1U)          /*!< Bit field size in bits for LCD_WF28_BPHLCD28. */

/*! @brief Read current value of the LCD_WF28_BPHLCD28 field. */
#define BR_LCD_WF28_BPHLCD28(x) (BME_UBFX8(HW_LCD_WF28_ADDR(x), BP_LCD_WF28_BPHLCD28, BS_LCD_WF28_BPHLCD28))

/*! @brief Format value for bitfield LCD_WF28_BPHLCD28. */
#define BF_LCD_WF28_BPHLCD28(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF28_BPHLCD28) & BM_LCD_WF28_BPHLCD28)

/*! @brief Set the BPHLCD28 field to a new value. */
#define BW_LCD_WF28_BPHLCD28(x, v) (BME_BFI8(HW_LCD_WF28_ADDR(x), ((uint8_t)(v) << BP_LCD_WF28_BPHLCD28), BP_LCD_WF28_BPHLCD28, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF29 - LCD Waveform Register 29.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF29 - LCD Waveform Register 29. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf29
{
    uint8_t U;
    struct _hw_lcd_wf29_bitfields
    {
        uint8_t BPALCD29 : 1;          /*!< [0]  */
        uint8_t BPBLCD29 : 1;          /*!< [1]  */
        uint8_t BPCLCD29 : 1;          /*!< [2]  */
        uint8_t BPDLCD29 : 1;          /*!< [3]  */
        uint8_t BPELCD29 : 1;          /*!< [4]  */
        uint8_t BPFLCD29 : 1;          /*!< [5]  */
        uint8_t BPGLCD29 : 1;          /*!< [6]  */
        uint8_t BPHLCD29 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf29_t;

/*!
 * @name Constants and macros for entire LCD_WF29 register
 */
/*@{*/
#define HW_LCD_WF29_ADDR(x)      ((x) + 0x3DU)

#define HW_LCD_WF29(x)           (*(__IO hw_lcd_wf29_t *) HW_LCD_WF29_ADDR(x))
#define HW_LCD_WF29_RD(x)        (HW_LCD_WF29(x).U)
#define HW_LCD_WF29_WR(x, v)     (HW_LCD_WF29(x).U = (v))
#define HW_LCD_WF29_SET(x, v)    (BME_OR8(HW_LCD_WF29_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF29_CLR(x, v)    (BME_AND8(HW_LCD_WF29_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF29_TOG(x, v)    (BME_XOR8(HW_LCD_WF29_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF29 bitfields
 */

/*!
 * @name Register LCD_WF29, field BPALCD29[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF29_BPALCD29 (0U)          /*!< Bit position for LCD_WF29_BPALCD29. */
#define BM_LCD_WF29_BPALCD29 (0x01U)       /*!< Bit mask for LCD_WF29_BPALCD29. */
#define BS_LCD_WF29_BPALCD29 (1U)          /*!< Bit field size in bits for LCD_WF29_BPALCD29. */

/*! @brief Read current value of the LCD_WF29_BPALCD29 field. */
#define BR_LCD_WF29_BPALCD29(x) (BME_UBFX8(HW_LCD_WF29_ADDR(x), BP_LCD_WF29_BPALCD29, BS_LCD_WF29_BPALCD29))

/*! @brief Format value for bitfield LCD_WF29_BPALCD29. */
#define BF_LCD_WF29_BPALCD29(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF29_BPALCD29) & BM_LCD_WF29_BPALCD29)

/*! @brief Set the BPALCD29 field to a new value. */
#define BW_LCD_WF29_BPALCD29(x, v) (BME_BFI8(HW_LCD_WF29_ADDR(x), ((uint8_t)(v) << BP_LCD_WF29_BPALCD29), BP_LCD_WF29_BPALCD29, 1))
/*@}*/

/*!
 * @name Register LCD_WF29, field BPBLCD29[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF29_BPBLCD29 (1U)          /*!< Bit position for LCD_WF29_BPBLCD29. */
#define BM_LCD_WF29_BPBLCD29 (0x02U)       /*!< Bit mask for LCD_WF29_BPBLCD29. */
#define BS_LCD_WF29_BPBLCD29 (1U)          /*!< Bit field size in bits for LCD_WF29_BPBLCD29. */

/*! @brief Read current value of the LCD_WF29_BPBLCD29 field. */
#define BR_LCD_WF29_BPBLCD29(x) (BME_UBFX8(HW_LCD_WF29_ADDR(x), BP_LCD_WF29_BPBLCD29, BS_LCD_WF29_BPBLCD29))

/*! @brief Format value for bitfield LCD_WF29_BPBLCD29. */
#define BF_LCD_WF29_BPBLCD29(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF29_BPBLCD29) & BM_LCD_WF29_BPBLCD29)

