nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Read current value of the LCD_WF31_BPCLCD31 field. */
#define BR_LCD_WF31_BPCLCD31(x) (BME_UBFX8(HW_LCD_WF31_ADDR(x), BP_LCD_WF31_BPCLCD31, BS_LCD_WF31_BPCLCD31))

/*! @brief Format value for bitfield LCD_WF31_BPCLCD31. */
#define BF_LCD_WF31_BPCLCD31(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF31_BPCLCD31) & BM_LCD_WF31_BPCLCD31)

/*! @brief Set the BPCLCD31 field to a new value. */
#define BW_LCD_WF31_BPCLCD31(x, v) (BME_BFI8(HW_LCD_WF31_ADDR(x), ((uint8_t)(v) << BP_LCD_WF31_BPCLCD31), BP_LCD_WF31_BPCLCD31, 1))
/*@}*/

/*!
 * @name Register LCD_WF31, field BPDLCD31[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF31_BPDLCD31 (3U)          /*!< Bit position for LCD_WF31_BPDLCD31. */
#define BM_LCD_WF31_BPDLCD31 (0x08U)       /*!< Bit mask for LCD_WF31_BPDLCD31. */
#define BS_LCD_WF31_BPDLCD31 (1U)          /*!< Bit field size in bits for LCD_WF31_BPDLCD31. */

/*! @brief Read current value of the LCD_WF31_BPDLCD31 field. */
#define BR_LCD_WF31_BPDLCD31(x) (BME_UBFX8(HW_LCD_WF31_ADDR(x), BP_LCD_WF31_BPDLCD31, BS_LCD_WF31_BPDLCD31))

/*! @brief Format value for bitfield LCD_WF31_BPDLCD31. */
#define BF_LCD_WF31_BPDLCD31(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF31_BPDLCD31) & BM_LCD_WF31_BPDLCD31)

/*! @brief Set the BPDLCD31 field to a new value. */
#define BW_LCD_WF31_BPDLCD31(x, v) (BME_BFI8(HW_LCD_WF31_ADDR(x), ((uint8_t)(v) << BP_LCD_WF31_BPDLCD31), BP_LCD_WF31_BPDLCD31, 1))
/*@}*/

/*!
 * @name Register LCD_WF31, field BPELCD31[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF31_BPELCD31 (4U)          /*!< Bit position for LCD_WF31_BPELCD31. */
#define BM_LCD_WF31_BPELCD31 (0x10U)       /*!< Bit mask for LCD_WF31_BPELCD31. */
#define BS_LCD_WF31_BPELCD31 (1U)          /*!< Bit field size in bits for LCD_WF31_BPELCD31. */

/*! @brief Read current value of the LCD_WF31_BPELCD31 field. */
#define BR_LCD_WF31_BPELCD31(x) (BME_UBFX8(HW_LCD_WF31_ADDR(x), BP_LCD_WF31_BPELCD31, BS_LCD_WF31_BPELCD31))

/*! @brief Format value for bitfield LCD_WF31_BPELCD31. */
#define BF_LCD_WF31_BPELCD31(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF31_BPELCD31) & BM_LCD_WF31_BPELCD31)

/*! @brief Set the BPELCD31 field to a new value. */
#define BW_LCD_WF31_BPELCD31(x, v) (BME_BFI8(HW_LCD_WF31_ADDR(x), ((uint8_t)(v) << BP_LCD_WF31_BPELCD31), BP_LCD_WF31_BPELCD31, 1))
/*@}*/

/*!
 * @name Register LCD_WF31, field BPFLCD31[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF31_BPFLCD31 (5U)          /*!< Bit position for LCD_WF31_BPFLCD31. */
#define BM_LCD_WF31_BPFLCD31 (0x20U)       /*!< Bit mask for LCD_WF31_BPFLCD31. */
#define BS_LCD_WF31_BPFLCD31 (1U)          /*!< Bit field size in bits for LCD_WF31_BPFLCD31. */

/*! @brief Read current value of the LCD_WF31_BPFLCD31 field. */
#define BR_LCD_WF31_BPFLCD31(x) (BME_UBFX8(HW_LCD_WF31_ADDR(x), BP_LCD_WF31_BPFLCD31, BS_LCD_WF31_BPFLCD31))

/*! @brief Format value for bitfield LCD_WF31_BPFLCD31. */
#define BF_LCD_WF31_BPFLCD31(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF31_BPFLCD31) & BM_LCD_WF31_BPFLCD31)

/*! @brief Set the BPFLCD31 field to a new value. */
#define BW_LCD_WF31_BPFLCD31(x, v) (BME_BFI8(HW_LCD_WF31_ADDR(x), ((uint8_t)(v) << BP_LCD_WF31_BPFLCD31), BP_LCD_WF31_BPFLCD31, 1))
/*@}*/

/*!
 * @name Register LCD_WF31, field BPGLCD31[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF31_BPGLCD31 (6U)          /*!< Bit position for LCD_WF31_BPGLCD31. */
#define BM_LCD_WF31_BPGLCD31 (0x40U)       /*!< Bit mask for LCD_WF31_BPGLCD31. */
#define BS_LCD_WF31_BPGLCD31 (1U)          /*!< Bit field size in bits for LCD_WF31_BPGLCD31. */

/*! @brief Read current value of the LCD_WF31_BPGLCD31 field. */
#define BR_LCD_WF31_BPGLCD31(x) (BME_UBFX8(HW_LCD_WF31_ADDR(x), BP_LCD_WF31_BPGLCD31, BS_LCD_WF31_BPGLCD31))

/*! @brief Format value for bitfield LCD_WF31_BPGLCD31. */
#define BF_LCD_WF31_BPGLCD31(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF31_BPGLCD31) & BM_LCD_WF31_BPGLCD31)

/*! @brief Set the BPGLCD31 field to a new value. */
#define BW_LCD_WF31_BPGLCD31(x, v) (BME_BFI8(HW_LCD_WF31_ADDR(x), ((uint8_t)(v) << BP_LCD_WF31_BPGLCD31), BP_LCD_WF31_BPGLCD31, 1))
/*@}*/

/*!
 * @name Register LCD_WF31, field BPHLCD31[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF31_BPHLCD31 (7U)          /*!< Bit position for LCD_WF31_BPHLCD31. */
#define BM_LCD_WF31_BPHLCD31 (0x80U)       /*!< Bit mask for LCD_WF31_BPHLCD31. */
#define BS_LCD_WF31_BPHLCD31 (1U)          /*!< Bit field size in bits for LCD_WF31_BPHLCD31. */

/*! @brief Read current value of the LCD_WF31_BPHLCD31 field. */
#define BR_LCD_WF31_BPHLCD31(x) (BME_UBFX8(HW_LCD_WF31_ADDR(x), BP_LCD_WF31_BPHLCD31, BS_LCD_WF31_BPHLCD31))

/*! @brief Format value for bitfield LCD_WF31_BPHLCD31. */
#define BF_LCD_WF31_BPHLCD31(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF31_BPHLCD31) & BM_LCD_WF31_BPHLCD31)

/*! @brief Set the BPHLCD31 field to a new value. */
#define BW_LCD_WF31_BPHLCD31(x, v) (BME_BFI8(HW_LCD_WF31_ADDR(x), ((uint8_t)(v) << BP_LCD_WF31_BPHLCD31), BP_LCD_WF31_BPHLCD31, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF32 - LCD Waveform Register 32.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF32 - LCD Waveform Register 32. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf32
{
    uint8_t U;
    struct _hw_lcd_wf32_bitfields
    {
        uint8_t BPALCD32 : 1;          /*!< [0]  */
        uint8_t BPBLCD32 : 1;          /*!< [1]  */
        uint8_t BPCLCD32 : 1;          /*!< [2]  */
        uint8_t BPDLCD32 : 1;          /*!< [3]  */
        uint8_t BPELCD32 : 1;          /*!< [4]  */
        uint8_t BPFLCD32 : 1;          /*!< [5]  */
        uint8_t BPGLCD32 : 1;          /*!< [6]  */
        uint8_t BPHLCD32 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf32_t;

/*!
 * @name Constants and macros for entire LCD_WF32 register
 */
/*@{*/
#define HW_LCD_WF32_ADDR(x)      ((x) + 0x40U)

