nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Read current value of the LCD_WF32_BPGLCD32 field. */
#define BR_LCD_WF32_BPGLCD32(x) (BME_UBFX8(HW_LCD_WF32_ADDR(x), BP_LCD_WF32_BPGLCD32, BS_LCD_WF32_BPGLCD32))

/*! @brief Format value for bitfield LCD_WF32_BPGLCD32. */
#define BF_LCD_WF32_BPGLCD32(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF32_BPGLCD32) & BM_LCD_WF32_BPGLCD32)

/*! @brief Set the BPGLCD32 field to a new value. */
#define BW_LCD_WF32_BPGLCD32(x, v) (BME_BFI8(HW_LCD_WF32_ADDR(x), ((uint8_t)(v) << BP_LCD_WF32_BPGLCD32), BP_LCD_WF32_BPGLCD32, 1))
/*@}*/

/*!
 * @name Register LCD_WF32, field BPHLCD32[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF32_BPHLCD32 (7U)          /*!< Bit position for LCD_WF32_BPHLCD32. */
#define BM_LCD_WF32_BPHLCD32 (0x80U)       /*!< Bit mask for LCD_WF32_BPHLCD32. */
#define BS_LCD_WF32_BPHLCD32 (1U)          /*!< Bit field size in bits for LCD_WF32_BPHLCD32. */

/*! @brief Read current value of the LCD_WF32_BPHLCD32 field. */
#define BR_LCD_WF32_BPHLCD32(x) (BME_UBFX8(HW_LCD_WF32_ADDR(x), BP_LCD_WF32_BPHLCD32, BS_LCD_WF32_BPHLCD32))

/*! @brief Format value for bitfield LCD_WF32_BPHLCD32. */
#define BF_LCD_WF32_BPHLCD32(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF32_BPHLCD32) & BM_LCD_WF32_BPHLCD32)

/*! @brief Set the BPHLCD32 field to a new value. */
#define BW_LCD_WF32_BPHLCD32(x, v) (BME_BFI8(HW_LCD_WF32_ADDR(x), ((uint8_t)(v) << BP_LCD_WF32_BPHLCD32), BP_LCD_WF32_BPHLCD32, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF33 - LCD Waveform Register 33.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF33 - LCD Waveform Register 33. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf33
{
    uint8_t U;
    struct _hw_lcd_wf33_bitfields
    {
        uint8_t BPALCD33 : 1;          /*!< [0]  */
        uint8_t BPBLCD33 : 1;          /*!< [1]  */
        uint8_t BPCLCD33 : 1;          /*!< [2]  */
        uint8_t BPDLCD33 : 1;          /*!< [3]  */
        uint8_t BPELCD33 : 1;          /*!< [4]  */
        uint8_t BPFLCD33 : 1;          /*!< [5]  */
        uint8_t BPGLCD33 : 1;          /*!< [6]  */
        uint8_t BPHLCD33 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf33_t;

/*!
 * @name Constants and macros for entire LCD_WF33 register
 */
/*@{*/
#define HW_LCD_WF33_ADDR(x)      ((x) + 0x41U)

#define HW_LCD_WF33(x)           (*(__IO hw_lcd_wf33_t *) HW_LCD_WF33_ADDR(x))
#define HW_LCD_WF33_RD(x)        (HW_LCD_WF33(x).U)
#define HW_LCD_WF33_WR(x, v)     (HW_LCD_WF33(x).U = (v))
#define HW_LCD_WF33_SET(x, v)    (BME_OR8(HW_LCD_WF33_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF33_CLR(x, v)    (BME_AND8(HW_LCD_WF33_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF33_TOG(x, v)    (BME_XOR8(HW_LCD_WF33_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF33 bitfields
 */

/*!
 * @name Register LCD_WF33, field BPALCD33[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF33_BPALCD33 (0U)          /*!< Bit position for LCD_WF33_BPALCD33. */
#define BM_LCD_WF33_BPALCD33 (0x01U)       /*!< Bit mask for LCD_WF33_BPALCD33. */
#define BS_LCD_WF33_BPALCD33 (1U)          /*!< Bit field size in bits for LCD_WF33_BPALCD33. */

/*! @brief Read current value of the LCD_WF33_BPALCD33 field. */
#define BR_LCD_WF33_BPALCD33(x) (BME_UBFX8(HW_LCD_WF33_ADDR(x), BP_LCD_WF33_BPALCD33, BS_LCD_WF33_BPALCD33))

/*! @brief Format value for bitfield LCD_WF33_BPALCD33. */
#define BF_LCD_WF33_BPALCD33(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF33_BPALCD33) & BM_LCD_WF33_BPALCD33)

/*! @brief Set the BPALCD33 field to a new value. */
#define BW_LCD_WF33_BPALCD33(x, v) (BME_BFI8(HW_LCD_WF33_ADDR(x), ((uint8_t)(v) << BP_LCD_WF33_BPALCD33), BP_LCD_WF33_BPALCD33, 1))
/*@}*/

/*!
 * @name Register LCD_WF33, field BPBLCD33[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF33_BPBLCD33 (1U)          /*!< Bit position for LCD_WF33_BPBLCD33. */
#define BM_LCD_WF33_BPBLCD33 (0x02U)       /*!< Bit mask for LCD_WF33_BPBLCD33. */
#define BS_LCD_WF33_BPBLCD33 (1U)          /*!< Bit field size in bits for LCD_WF33_BPBLCD33. */

/*! @brief Read current value of the LCD_WF33_BPBLCD33 field. */
#define BR_LCD_WF33_BPBLCD33(x) (BME_UBFX8(HW_LCD_WF33_ADDR(x), BP_LCD_WF33_BPBLCD33, BS_LCD_WF33_BPBLCD33))

/*! @brief Format value for bitfield LCD_WF33_BPBLCD33. */
#define BF_LCD_WF33_BPBLCD33(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF33_BPBLCD33) & BM_LCD_WF33_BPBLCD33)

/*! @brief Set the BPBLCD33 field to a new value. */
#define BW_LCD_WF33_BPBLCD33(x, v) (BME_BFI8(HW_LCD_WF33_ADDR(x), ((uint8_t)(v) << BP_LCD_WF33_BPBLCD33), BP_LCD_WF33_BPBLCD33, 1))
/*@}*/

/*!
 * @name Register LCD_WF33, field BPCLCD33[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF33_BPCLCD33 (2U)          /*!< Bit position for LCD_WF33_BPCLCD33. */
#define BM_LCD_WF33_BPCLCD33 (0x04U)       /*!< Bit mask for LCD_WF33_BPCLCD33. */
#define BS_LCD_WF33_BPCLCD33 (1U)          /*!< Bit field size in bits for LCD_WF33_BPCLCD33. */

/*! @brief Read current value of the LCD_WF33_BPCLCD33 field. */
#define BR_LCD_WF33_BPCLCD33(x) (BME_UBFX8(HW_LCD_WF33_ADDR(x), BP_LCD_WF33_BPCLCD33, BS_LCD_WF33_BPCLCD33))

/*! @brief Format value for bitfield LCD_WF33_BPCLCD33. */
#define BF_LCD_WF33_BPCLCD33(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF33_BPCLCD33) & BM_LCD_WF33_BPCLCD33)

/*! @brief Set the BPCLCD33 field to a new value. */
#define BW_LCD_WF33_BPCLCD33(x, v) (BME_BFI8(HW_LCD_WF33_ADDR(x), ((uint8_t)(v) << BP_LCD_WF33_BPCLCD33), BP_LCD_WF33_BPCLCD33, 1))
/*@}*/

/*!
 * @name Register LCD_WF33, field BPDLCD33[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF33_BPDLCD33 (3U)          /*!< Bit position for LCD_WF33_BPDLCD33. */
#define BM_LCD_WF33_BPDLCD33 (0x08U)       /*!< Bit mask for LCD_WF33_BPDLCD33. */
#define BS_LCD_WF33_BPDLCD33 (1U)          /*!< Bit field size in bits for LCD_WF33_BPDLCD33. */

