nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Set the BPFLCD34 field to a new value. */
#define BW_LCD_WF34_BPFLCD34(x, v) (BME_BFI8(HW_LCD_WF34_ADDR(x), ((uint8_t)(v) << BP_LCD_WF34_BPFLCD34), BP_LCD_WF34_BPFLCD34, 1))
/*@}*/

/*!
 * @name Register LCD_WF34, field BPGLCD34[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF34_BPGLCD34 (6U)          /*!< Bit position for LCD_WF34_BPGLCD34. */
#define BM_LCD_WF34_BPGLCD34 (0x40U)       /*!< Bit mask for LCD_WF34_BPGLCD34. */
#define BS_LCD_WF34_BPGLCD34 (1U)          /*!< Bit field size in bits for LCD_WF34_BPGLCD34. */

/*! @brief Read current value of the LCD_WF34_BPGLCD34 field. */
#define BR_LCD_WF34_BPGLCD34(x) (BME_UBFX8(HW_LCD_WF34_ADDR(x), BP_LCD_WF34_BPGLCD34, BS_LCD_WF34_BPGLCD34))

/*! @brief Format value for bitfield LCD_WF34_BPGLCD34. */
#define BF_LCD_WF34_BPGLCD34(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF34_BPGLCD34) & BM_LCD_WF34_BPGLCD34)

/*! @brief Set the BPGLCD34 field to a new value. */
#define BW_LCD_WF34_BPGLCD34(x, v) (BME_BFI8(HW_LCD_WF34_ADDR(x), ((uint8_t)(v) << BP_LCD_WF34_BPGLCD34), BP_LCD_WF34_BPGLCD34, 1))
/*@}*/

/*!
 * @name Register LCD_WF34, field BPHLCD34[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF34_BPHLCD34 (7U)          /*!< Bit position for LCD_WF34_BPHLCD34. */
#define BM_LCD_WF34_BPHLCD34 (0x80U)       /*!< Bit mask for LCD_WF34_BPHLCD34. */
#define BS_LCD_WF34_BPHLCD34 (1U)          /*!< Bit field size in bits for LCD_WF34_BPHLCD34. */

/*! @brief Read current value of the LCD_WF34_BPHLCD34 field. */
#define BR_LCD_WF34_BPHLCD34(x) (BME_UBFX8(HW_LCD_WF34_ADDR(x), BP_LCD_WF34_BPHLCD34, BS_LCD_WF34_BPHLCD34))

/*! @brief Format value for bitfield LCD_WF34_BPHLCD34. */
#define BF_LCD_WF34_BPHLCD34(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF34_BPHLCD34) & BM_LCD_WF34_BPHLCD34)

/*! @brief Set the BPHLCD34 field to a new value. */
#define BW_LCD_WF34_BPHLCD34(x, v) (BME_BFI8(HW_LCD_WF34_ADDR(x), ((uint8_t)(v) << BP_LCD_WF34_BPHLCD34), BP_LCD_WF34_BPHLCD34, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF35 - LCD Waveform Register 35.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF35 - LCD Waveform Register 35. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf35
{
    uint8_t U;
    struct _hw_lcd_wf35_bitfields
    {
        uint8_t BPALCD35 : 1;          /*!< [0]  */
        uint8_t BPBLCD35 : 1;          /*!< [1]  */
        uint8_t BPCLCD35 : 1;          /*!< [2]  */
        uint8_t BPDLCD35 : 1;          /*!< [3]  */
        uint8_t BPELCD35 : 1;          /*!< [4]  */
        uint8_t BPFLCD35 : 1;          /*!< [5]  */
        uint8_t BPGLCD35 : 1;          /*!< [6]  */
        uint8_t BPHLCD35 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf35_t;

/*!
 * @name Constants and macros for entire LCD_WF35 register
 */
/*@{*/
#define HW_LCD_WF35_ADDR(x)      ((x) + 0x43U)

#define HW_LCD_WF35(x)           (*(__IO hw_lcd_wf35_t *) HW_LCD_WF35_ADDR(x))
#define HW_LCD_WF35_RD(x)        (HW_LCD_WF35(x).U)
#define HW_LCD_WF35_WR(x, v)     (HW_LCD_WF35(x).U = (v))
#define HW_LCD_WF35_SET(x, v)    (BME_OR8(HW_LCD_WF35_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF35_CLR(x, v)    (BME_AND8(HW_LCD_WF35_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF35_TOG(x, v)    (BME_XOR8(HW_LCD_WF35_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF35 bitfields
 */

/*!
 * @name Register LCD_WF35, field BPALCD35[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF35_BPALCD35 (0U)          /*!< Bit position for LCD_WF35_BPALCD35. */
#define BM_LCD_WF35_BPALCD35 (0x01U)       /*!< Bit mask for LCD_WF35_BPALCD35. */
#define BS_LCD_WF35_BPALCD35 (1U)          /*!< Bit field size in bits for LCD_WF35_BPALCD35. */

/*! @brief Read current value of the LCD_WF35_BPALCD35 field. */
#define BR_LCD_WF35_BPALCD35(x) (BME_UBFX8(HW_LCD_WF35_ADDR(x), BP_LCD_WF35_BPALCD35, BS_LCD_WF35_BPALCD35))

/*! @brief Format value for bitfield LCD_WF35_BPALCD35. */
#define BF_LCD_WF35_BPALCD35(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF35_BPALCD35) & BM_LCD_WF35_BPALCD35)

/*! @brief Set the BPALCD35 field to a new value. */
#define BW_LCD_WF35_BPALCD35(x, v) (BME_BFI8(HW_LCD_WF35_ADDR(x), ((uint8_t)(v) << BP_LCD_WF35_BPALCD35), BP_LCD_WF35_BPALCD35, 1))
/*@}*/

/*!
 * @name Register LCD_WF35, field BPBLCD35[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF35_BPBLCD35 (1U)          /*!< Bit position for LCD_WF35_BPBLCD35. */
#define BM_LCD_WF35_BPBLCD35 (0x02U)       /*!< Bit mask for LCD_WF35_BPBLCD35. */
#define BS_LCD_WF35_BPBLCD35 (1U)          /*!< Bit field size in bits for LCD_WF35_BPBLCD35. */

/*! @brief Read current value of the LCD_WF35_BPBLCD35 field. */
#define BR_LCD_WF35_BPBLCD35(x) (BME_UBFX8(HW_LCD_WF35_ADDR(x), BP_LCD_WF35_BPBLCD35, BS_LCD_WF35_BPBLCD35))

/*! @brief Format value for bitfield LCD_WF35_BPBLCD35. */
#define BF_LCD_WF35_BPBLCD35(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF35_BPBLCD35) & BM_LCD_WF35_BPBLCD35)

/*! @brief Set the BPBLCD35 field to a new value. */
#define BW_LCD_WF35_BPBLCD35(x, v) (BME_BFI8(HW_LCD_WF35_ADDR(x), ((uint8_t)(v) << BP_LCD_WF35_BPBLCD35), BP_LCD_WF35_BPBLCD35, 1))
/*@}*/

/*!
 * @name Register LCD_WF35, field BPCLCD35[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF35_BPCLCD35 (2U)          /*!< Bit position for LCD_WF35_BPCLCD35. */
#define BM_LCD_WF35_BPCLCD35 (0x04U)       /*!< Bit mask for LCD_WF35_BPCLCD35. */
#define BS_LCD_WF35_BPCLCD35 (1U)          /*!< Bit field size in bits for LCD_WF35_BPCLCD35. */

/*! @brief Read current value of the LCD_WF35_BPCLCD35 field. */
#define BR_LCD_WF35_BPCLCD35(x) (BME_UBFX8(HW_LCD_WF35_ADDR(x), BP_LCD_WF35_BPCLCD35, BS_LCD_WF35_BPCLCD35))

/*! @brief Format value for bitfield LCD_WF35_BPCLCD35. */
#define BF_LCD_WF35_BPCLCD35(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF35_BPCLCD35) & BM_LCD_WF35_BPCLCD35)

/*! @brief Set the BPCLCD35 field to a new value. */
#define BW_LCD_WF35_BPCLCD35(x, v) (BME_BFI8(HW_LCD_WF35_ADDR(x), ((uint8_t)(v) << BP_LCD_WF35_BPCLCD35), BP_LCD_WF35_BPCLCD35, 1))
/*@}*/

/*!
 * @name Register LCD_WF35, field BPDLCD35[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF35_BPDLCD35 (3U)          /*!< Bit position for LCD_WF35_BPDLCD35. */
#define BM_LCD_WF35_BPDLCD35 (0x08U)       /*!< Bit mask for LCD_WF35_BPDLCD35. */
#define BS_LCD_WF35_BPDLCD35 (1U)          /*!< Bit field size in bits for LCD_WF35_BPDLCD35. */

/*! @brief Read current value of the LCD_WF35_BPDLCD35 field. */
#define BR_LCD_WF35_BPDLCD35(x) (BME_UBFX8(HW_LCD_WF35_ADDR(x), BP_LCD_WF35_BPDLCD35, BS_LCD_WF35_BPDLCD35))

/*! @brief Format value for bitfield LCD_WF35_BPDLCD35. */
#define BF_LCD_WF35_BPDLCD35(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF35_BPDLCD35) & BM_LCD_WF35_BPDLCD35)

/*! @brief Set the BPDLCD35 field to a new value. */
#define BW_LCD_WF35_BPDLCD35(x, v) (BME_BFI8(HW_LCD_WF35_ADDR(x), ((uint8_t)(v) << BP_LCD_WF35_BPDLCD35), BP_LCD_WF35_BPDLCD35, 1))
/*@}*/

/*!
 * @name Register LCD_WF35, field BPELCD35[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF35_BPELCD35 (4U)          /*!< Bit position for LCD_WF35_BPELCD35. */
#define BM_LCD_WF35_BPELCD35 (0x10U)       /*!< Bit mask for LCD_WF35_BPELCD35. */
#define BS_LCD_WF35_BPELCD35 (1U)          /*!< Bit field size in bits for LCD_WF35_BPELCD35. */

/*! @brief Read current value of the LCD_WF35_BPELCD35 field. */
#define BR_LCD_WF35_BPELCD35(x) (BME_UBFX8(HW_LCD_WF35_ADDR(x), BP_LCD_WF35_BPELCD35, BS_LCD_WF35_BPELCD35))

/*! @brief Format value for bitfield LCD_WF35_BPELCD35. */
#define BF_LCD_WF35_BPELCD35(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF35_BPELCD35) & BM_LCD_WF35_BPELCD35)

