nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Format value for bitfield LCD_WF38_BPCLCD38. */
#define BF_LCD_WF38_BPCLCD38(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF38_BPCLCD38) & BM_LCD_WF38_BPCLCD38)

/*! @brief Set the BPCLCD38 field to a new value. */
#define BW_LCD_WF38_BPCLCD38(x, v) (BME_BFI8(HW_LCD_WF38_ADDR(x), ((uint8_t)(v) << BP_LCD_WF38_BPCLCD38), BP_LCD_WF38_BPCLCD38, 1))
/*@}*/

/*!
 * @name Register LCD_WF38, field BPDLCD38[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF38_BPDLCD38 (3U)          /*!< Bit position for LCD_WF38_BPDLCD38. */
#define BM_LCD_WF38_BPDLCD38 (0x08U)       /*!< Bit mask for LCD_WF38_BPDLCD38. */
#define BS_LCD_WF38_BPDLCD38 (1U)          /*!< Bit field size in bits for LCD_WF38_BPDLCD38. */

/*! @brief Read current value of the LCD_WF38_BPDLCD38 field. */
#define BR_LCD_WF38_BPDLCD38(x) (BME_UBFX8(HW_LCD_WF38_ADDR(x), BP_LCD_WF38_BPDLCD38, BS_LCD_WF38_BPDLCD38))

/*! @brief Format value for bitfield LCD_WF38_BPDLCD38. */
#define BF_LCD_WF38_BPDLCD38(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF38_BPDLCD38) & BM_LCD_WF38_BPDLCD38)

/*! @brief Set the BPDLCD38 field to a new value. */
#define BW_LCD_WF38_BPDLCD38(x, v) (BME_BFI8(HW_LCD_WF38_ADDR(x), ((uint8_t)(v) << BP_LCD_WF38_BPDLCD38), BP_LCD_WF38_BPDLCD38, 1))
/*@}*/

/*!
 * @name Register LCD_WF38, field BPELCD38[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF38_BPELCD38 (4U)          /*!< Bit position for LCD_WF38_BPELCD38. */
#define BM_LCD_WF38_BPELCD38 (0x10U)       /*!< Bit mask for LCD_WF38_BPELCD38. */
#define BS_LCD_WF38_BPELCD38 (1U)          /*!< Bit field size in bits for LCD_WF38_BPELCD38. */

/*! @brief Read current value of the LCD_WF38_BPELCD38 field. */
#define BR_LCD_WF38_BPELCD38(x) (BME_UBFX8(HW_LCD_WF38_ADDR(x), BP_LCD_WF38_BPELCD38, BS_LCD_WF38_BPELCD38))

/*! @brief Format value for bitfield LCD_WF38_BPELCD38. */
#define BF_LCD_WF38_BPELCD38(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF38_BPELCD38) & BM_LCD_WF38_BPELCD38)

/*! @brief Set the BPELCD38 field to a new value. */
#define BW_LCD_WF38_BPELCD38(x, v) (BME_BFI8(HW_LCD_WF38_ADDR(x), ((uint8_t)(v) << BP_LCD_WF38_BPELCD38), BP_LCD_WF38_BPELCD38, 1))
/*@}*/

/*!
 * @name Register LCD_WF38, field BPFLCD38[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF38_BPFLCD38 (5U)          /*!< Bit position for LCD_WF38_BPFLCD38. */
#define BM_LCD_WF38_BPFLCD38 (0x20U)       /*!< Bit mask for LCD_WF38_BPFLCD38. */
#define BS_LCD_WF38_BPFLCD38 (1U)          /*!< Bit field size in bits for LCD_WF38_BPFLCD38. */

/*! @brief Read current value of the LCD_WF38_BPFLCD38 field. */
#define BR_LCD_WF38_BPFLCD38(x) (BME_UBFX8(HW_LCD_WF38_ADDR(x), BP_LCD_WF38_BPFLCD38, BS_LCD_WF38_BPFLCD38))

/*! @brief Format value for bitfield LCD_WF38_BPFLCD38. */
#define BF_LCD_WF38_BPFLCD38(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF38_BPFLCD38) & BM_LCD_WF38_BPFLCD38)

/*! @brief Set the BPFLCD38 field to a new value. */
#define BW_LCD_WF38_BPFLCD38(x, v) (BME_BFI8(HW_LCD_WF38_ADDR(x), ((uint8_t)(v) << BP_LCD_WF38_BPFLCD38), BP_LCD_WF38_BPFLCD38, 1))
/*@}*/

/*!
 * @name Register LCD_WF38, field BPGLCD38[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF38_BPGLCD38 (6U)          /*!< Bit position for LCD_WF38_BPGLCD38. */
#define BM_LCD_WF38_BPGLCD38 (0x40U)       /*!< Bit mask for LCD_WF38_BPGLCD38. */
#define BS_LCD_WF38_BPGLCD38 (1U)          /*!< Bit field size in bits for LCD_WF38_BPGLCD38. */

/*! @brief Read current value of the LCD_WF38_BPGLCD38 field. */
#define BR_LCD_WF38_BPGLCD38(x) (BME_UBFX8(HW_LCD_WF38_ADDR(x), BP_LCD_WF38_BPGLCD38, BS_LCD_WF38_BPGLCD38))

/*! @brief Format value for bitfield LCD_WF38_BPGLCD38. */
#define BF_LCD_WF38_BPGLCD38(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF38_BPGLCD38) & BM_LCD_WF38_BPGLCD38)

/*! @brief Set the BPGLCD38 field to a new value. */
#define BW_LCD_WF38_BPGLCD38(x, v) (BME_BFI8(HW_LCD_WF38_ADDR(x), ((uint8_t)(v) << BP_LCD_WF38_BPGLCD38), BP_LCD_WF38_BPGLCD38, 1))
/*@}*/

/*!
 * @name Register LCD_WF38, field BPHLCD38[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF38_BPHLCD38 (7U)          /*!< Bit position for LCD_WF38_BPHLCD38. */
#define BM_LCD_WF38_BPHLCD38 (0x80U)       /*!< Bit mask for LCD_WF38_BPHLCD38. */
#define BS_LCD_WF38_BPHLCD38 (1U)          /*!< Bit field size in bits for LCD_WF38_BPHLCD38. */

/*! @brief Read current value of the LCD_WF38_BPHLCD38 field. */
#define BR_LCD_WF38_BPHLCD38(x) (BME_UBFX8(HW_LCD_WF38_ADDR(x), BP_LCD_WF38_BPHLCD38, BS_LCD_WF38_BPHLCD38))

/*! @brief Format value for bitfield LCD_WF38_BPHLCD38. */
#define BF_LCD_WF38_BPHLCD38(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF38_BPHLCD38) & BM_LCD_WF38_BPHLCD38)

/*! @brief Set the BPHLCD38 field to a new value. */
#define BW_LCD_WF38_BPHLCD38(x, v) (BME_BFI8(HW_LCD_WF38_ADDR(x), ((uint8_t)(v) << BP_LCD_WF38_BPHLCD38), BP_LCD_WF38_BPHLCD38, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF39 - LCD Waveform Register 39.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF39 - LCD Waveform Register 39. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf39
{
    uint8_t U;
    struct _hw_lcd_wf39_bitfields
    {
        uint8_t BPALCD39 : 1;          /*!< [0]  */
        uint8_t BPBLCD39 : 1;          /*!< [1]  */
        uint8_t BPCLCD39 : 1;          /*!< [2]  */
        uint8_t BPDLCD39 : 1;          /*!< [3]  */
        uint8_t BPELCD39 : 1;          /*!< [4]  */
        uint8_t BPFLCD39 : 1;          /*!< [5]  */
        uint8_t BPGLCD39 : 1;          /*!< [6]  */
        uint8_t BPHLCD39 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf39_t;

/*!
 * @name Constants and macros for entire LCD_WF39 register
 */
/*@{*/
#define HW_LCD_WF39_ADDR(x)      ((x) + 0x47U)

#define HW_LCD_WF39(x)           (*(__IO hw_lcd_wf39_t *) HW_LCD_WF39_ADDR(x))
#define HW_LCD_WF39_RD(x)        (HW_LCD_WF39(x).U)
#define HW_LCD_WF39_WR(x, v)     (HW_LCD_WF39(x).U = (v))
#define HW_LCD_WF39_SET(x, v)    (BME_OR8(HW_LCD_WF39_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF39_CLR(x, v)    (BME_AND8(HW_LCD_WF39_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF39_TOG(x, v)    (BME_XOR8(HW_LCD_WF39_ADDR(x), (uint8_t)(v)))
/*@}*/

