nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Read current value of the LCD_WF41_BPGLCD41 field. */
#define BR_LCD_WF41_BPGLCD41(x) (BME_UBFX8(HW_LCD_WF41_ADDR(x), BP_LCD_WF41_BPGLCD41, BS_LCD_WF41_BPGLCD41))

/*! @brief Format value for bitfield LCD_WF41_BPGLCD41. */
#define BF_LCD_WF41_BPGLCD41(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF41_BPGLCD41) & BM_LCD_WF41_BPGLCD41)

/*! @brief Set the BPGLCD41 field to a new value. */
#define BW_LCD_WF41_BPGLCD41(x, v) (BME_BFI8(HW_LCD_WF41_ADDR(x), ((uint8_t)(v) << BP_LCD_WF41_BPGLCD41), BP_LCD_WF41_BPGLCD41, 1))
/*@}*/

/*!
 * @name Register LCD_WF41, field BPHLCD41[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF41_BPHLCD41 (7U)          /*!< Bit position for LCD_WF41_BPHLCD41. */
#define BM_LCD_WF41_BPHLCD41 (0x80U)       /*!< Bit mask for LCD_WF41_BPHLCD41. */
#define BS_LCD_WF41_BPHLCD41 (1U)          /*!< Bit field size in bits for LCD_WF41_BPHLCD41. */

/*! @brief Read current value of the LCD_WF41_BPHLCD41 field. */
#define BR_LCD_WF41_BPHLCD41(x) (BME_UBFX8(HW_LCD_WF41_ADDR(x), BP_LCD_WF41_BPHLCD41, BS_LCD_WF41_BPHLCD41))

/*! @brief Format value for bitfield LCD_WF41_BPHLCD41. */
#define BF_LCD_WF41_BPHLCD41(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF41_BPHLCD41) & BM_LCD_WF41_BPHLCD41)

/*! @brief Set the BPHLCD41 field to a new value. */
#define BW_LCD_WF41_BPHLCD41(x, v) (BME_BFI8(HW_LCD_WF41_ADDR(x), ((uint8_t)(v) << BP_LCD_WF41_BPHLCD41), BP_LCD_WF41_BPHLCD41, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF42 - LCD Waveform Register 42.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF42 - LCD Waveform Register 42. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf42
{
    uint8_t U;
    struct _hw_lcd_wf42_bitfields
    {
        uint8_t BPALCD42 : 1;          /*!< [0]  */
        uint8_t BPBLCD42 : 1;          /*!< [1]  */
        uint8_t BPCLCD42 : 1;          /*!< [2]  */
        uint8_t BPDLCD42 : 1;          /*!< [3]  */
        uint8_t BPELCD42 : 1;          /*!< [4]  */
        uint8_t BPFLCD42 : 1;          /*!< [5]  */
        uint8_t BPGLCD42 : 1;          /*!< [6]  */
        uint8_t BPHLCD42 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf42_t;

/*!
 * @name Constants and macros for entire LCD_WF42 register
 */
/*@{*/
#define HW_LCD_WF42_ADDR(x)      ((x) + 0x4AU)

#define HW_LCD_WF42(x)           (*(__IO hw_lcd_wf42_t *) HW_LCD_WF42_ADDR(x))
#define HW_LCD_WF42_RD(x)        (HW_LCD_WF42(x).U)
#define HW_LCD_WF42_WR(x, v)     (HW_LCD_WF42(x).U = (v))
#define HW_LCD_WF42_SET(x, v)    (BME_OR8(HW_LCD_WF42_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF42_CLR(x, v)    (BME_AND8(HW_LCD_WF42_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF42_TOG(x, v)    (BME_XOR8(HW_LCD_WF42_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF42 bitfields
 */

/*!
 * @name Register LCD_WF42, field BPALCD42[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF42_BPALCD42 (0U)          /*!< Bit position for LCD_WF42_BPALCD42. */
#define BM_LCD_WF42_BPALCD42 (0x01U)       /*!< Bit mask for LCD_WF42_BPALCD42. */
#define BS_LCD_WF42_BPALCD42 (1U)          /*!< Bit field size in bits for LCD_WF42_BPALCD42. */

/*! @brief Read current value of the LCD_WF42_BPALCD42 field. */
#define BR_LCD_WF42_BPALCD42(x) (BME_UBFX8(HW_LCD_WF42_ADDR(x), BP_LCD_WF42_BPALCD42, BS_LCD_WF42_BPALCD42))

/*! @brief Format value for bitfield LCD_WF42_BPALCD42. */
#define BF_LCD_WF42_BPALCD42(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF42_BPALCD42) & BM_LCD_WF42_BPALCD42)

/*! @brief Set the BPALCD42 field to a new value. */
#define BW_LCD_WF42_BPALCD42(x, v) (BME_BFI8(HW_LCD_WF42_ADDR(x), ((uint8_t)(v) << BP_LCD_WF42_BPALCD42), BP_LCD_WF42_BPALCD42, 1))
/*@}*/

/*!
 * @name Register LCD_WF42, field BPBLCD42[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF42_BPBLCD42 (1U)          /*!< Bit position for LCD_WF42_BPBLCD42. */
#define BM_LCD_WF42_BPBLCD42 (0x02U)       /*!< Bit mask for LCD_WF42_BPBLCD42. */
#define BS_LCD_WF42_BPBLCD42 (1U)          /*!< Bit field size in bits for LCD_WF42_BPBLCD42. */

/*! @brief Read current value of the LCD_WF42_BPBLCD42 field. */
#define BR_LCD_WF42_BPBLCD42(x) (BME_UBFX8(HW_LCD_WF42_ADDR(x), BP_LCD_WF42_BPBLCD42, BS_LCD_WF42_BPBLCD42))

/*! @brief Format value for bitfield LCD_WF42_BPBLCD42. */
#define BF_LCD_WF42_BPBLCD42(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF42_BPBLCD42) & BM_LCD_WF42_BPBLCD42)

/*! @brief Set the BPBLCD42 field to a new value. */
#define BW_LCD_WF42_BPBLCD42(x, v) (BME_BFI8(HW_LCD_WF42_ADDR(x), ((uint8_t)(v) << BP_LCD_WF42_BPBLCD42), BP_LCD_WF42_BPBLCD42, 1))
/*@}*/

/*!
 * @name Register LCD_WF42, field BPCLCD42[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF42_BPCLCD42 (2U)          /*!< Bit position for LCD_WF42_BPCLCD42. */
#define BM_LCD_WF42_BPCLCD42 (0x04U)       /*!< Bit mask for LCD_WF42_BPCLCD42. */
#define BS_LCD_WF42_BPCLCD42 (1U)          /*!< Bit field size in bits for LCD_WF42_BPCLCD42. */

/*! @brief Read current value of the LCD_WF42_BPCLCD42 field. */
#define BR_LCD_WF42_BPCLCD42(x) (BME_UBFX8(HW_LCD_WF42_ADDR(x), BP_LCD_WF42_BPCLCD42, BS_LCD_WF42_BPCLCD42))

/*! @brief Format value for bitfield LCD_WF42_BPCLCD42. */
#define BF_LCD_WF42_BPCLCD42(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF42_BPCLCD42) & BM_LCD_WF42_BPCLCD42)

/*! @brief Set the BPCLCD42 field to a new value. */
#define BW_LCD_WF42_BPCLCD42(x, v) (BME_BFI8(HW_LCD_WF42_ADDR(x), ((uint8_t)(v) << BP_LCD_WF42_BPCLCD42), BP_LCD_WF42_BPCLCD42, 1))
/*@}*/

/*!
 * @name Register LCD_WF42, field BPDLCD42[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF42_BPDLCD42 (3U)          /*!< Bit position for LCD_WF42_BPDLCD42. */
#define BM_LCD_WF42_BPDLCD42 (0x08U)       /*!< Bit mask for LCD_WF42_BPDLCD42. */
#define BS_LCD_WF42_BPDLCD42 (1U)          /*!< Bit field size in bits for LCD_WF42_BPDLCD42. */

/*! @brief Read current value of the LCD_WF42_BPDLCD42 field. */
#define BR_LCD_WF42_BPDLCD42(x) (BME_UBFX8(HW_LCD_WF42_ADDR(x), BP_LCD_WF42_BPDLCD42, BS_LCD_WF42_BPDLCD42))

/*! @brief Format value for bitfield LCD_WF42_BPDLCD42. */
#define BF_LCD_WF42_BPDLCD42(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF42_BPDLCD42) & BM_LCD_WF42_BPDLCD42)

/*! @brief Set the BPDLCD42 field to a new value. */
#define BW_LCD_WF42_BPDLCD42(x, v) (BME_BFI8(HW_LCD_WF42_ADDR(x), ((uint8_t)(v) << BP_LCD_WF42_BPDLCD42), BP_LCD_WF42_BPDLCD42, 1))
/*@}*/

/*!
 * @name Register LCD_WF42, field BPELCD42[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF42_BPELCD42 (4U)          /*!< Bit position for LCD_WF42_BPELCD42. */
#define BM_LCD_WF42_BPELCD42 (0x10U)       /*!< Bit mask for LCD_WF42_BPELCD42. */
#define BS_LCD_WF42_BPELCD42 (1U)          /*!< Bit field size in bits for LCD_WF42_BPELCD42. */

