nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Format value for bitfield LCD_WF44_BPGLCD44. */
#define BF_LCD_WF44_BPGLCD44(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF44_BPGLCD44) & BM_LCD_WF44_BPGLCD44)

/*! @brief Set the BPGLCD44 field to a new value. */
#define BW_LCD_WF44_BPGLCD44(x, v) (BME_BFI8(HW_LCD_WF44_ADDR(x), ((uint8_t)(v) << BP_LCD_WF44_BPGLCD44), BP_LCD_WF44_BPGLCD44, 1))
/*@}*/

/*!
 * @name Register LCD_WF44, field BPHLCD44[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF44_BPHLCD44 (7U)          /*!< Bit position for LCD_WF44_BPHLCD44. */
#define BM_LCD_WF44_BPHLCD44 (0x80U)       /*!< Bit mask for LCD_WF44_BPHLCD44. */
#define BS_LCD_WF44_BPHLCD44 (1U)          /*!< Bit field size in bits for LCD_WF44_BPHLCD44. */

/*! @brief Read current value of the LCD_WF44_BPHLCD44 field. */
#define BR_LCD_WF44_BPHLCD44(x) (BME_UBFX8(HW_LCD_WF44_ADDR(x), BP_LCD_WF44_BPHLCD44, BS_LCD_WF44_BPHLCD44))

/*! @brief Format value for bitfield LCD_WF44_BPHLCD44. */
#define BF_LCD_WF44_BPHLCD44(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF44_BPHLCD44) & BM_LCD_WF44_BPHLCD44)

/*! @brief Set the BPHLCD44 field to a new value. */
#define BW_LCD_WF44_BPHLCD44(x, v) (BME_BFI8(HW_LCD_WF44_ADDR(x), ((uint8_t)(v) << BP_LCD_WF44_BPHLCD44), BP_LCD_WF44_BPHLCD44, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF45 - LCD Waveform Register 45.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF45 - LCD Waveform Register 45. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf45
{
    uint8_t U;
    struct _hw_lcd_wf45_bitfields
    {
        uint8_t BPALCD45 : 1;          /*!< [0]  */
        uint8_t BPBLCD45 : 1;          /*!< [1]  */
        uint8_t BPCLCD45 : 1;          /*!< [2]  */
        uint8_t BPDLCD45 : 1;          /*!< [3]  */
        uint8_t BPELCD45 : 1;          /*!< [4]  */
        uint8_t BPFLCD45 : 1;          /*!< [5]  */
        uint8_t BPGLCD45 : 1;          /*!< [6]  */
        uint8_t BPHLCD45 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf45_t;

/*!
 * @name Constants and macros for entire LCD_WF45 register
 */
/*@{*/
#define HW_LCD_WF45_ADDR(x)      ((x) + 0x4DU)

#define HW_LCD_WF45(x)           (*(__IO hw_lcd_wf45_t *) HW_LCD_WF45_ADDR(x))
#define HW_LCD_WF45_RD(x)        (HW_LCD_WF45(x).U)
#define HW_LCD_WF45_WR(x, v)     (HW_LCD_WF45(x).U = (v))
#define HW_LCD_WF45_SET(x, v)    (BME_OR8(HW_LCD_WF45_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF45_CLR(x, v)    (BME_AND8(HW_LCD_WF45_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF45_TOG(x, v)    (BME_XOR8(HW_LCD_WF45_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF45 bitfields
 */

/*!
 * @name Register LCD_WF45, field BPALCD45[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF45_BPALCD45 (0U)          /*!< Bit position for LCD_WF45_BPALCD45. */
#define BM_LCD_WF45_BPALCD45 (0x01U)       /*!< Bit mask for LCD_WF45_BPALCD45. */
#define BS_LCD_WF45_BPALCD45 (1U)          /*!< Bit field size in bits for LCD_WF45_BPALCD45. */

/*! @brief Read current value of the LCD_WF45_BPALCD45 field. */
#define BR_LCD_WF45_BPALCD45(x) (BME_UBFX8(HW_LCD_WF45_ADDR(x), BP_LCD_WF45_BPALCD45, BS_LCD_WF45_BPALCD45))

/*! @brief Format value for bitfield LCD_WF45_BPALCD45. */
#define BF_LCD_WF45_BPALCD45(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF45_BPALCD45) & BM_LCD_WF45_BPALCD45)

/*! @brief Set the BPALCD45 field to a new value. */
#define BW_LCD_WF45_BPALCD45(x, v) (BME_BFI8(HW_LCD_WF45_ADDR(x), ((uint8_t)(v) << BP_LCD_WF45_BPALCD45), BP_LCD_WF45_BPALCD45, 1))
/*@}*/

/*!
 * @name Register LCD_WF45, field BPBLCD45[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF45_BPBLCD45 (1U)          /*!< Bit position for LCD_WF45_BPBLCD45. */
#define BM_LCD_WF45_BPBLCD45 (0x02U)       /*!< Bit mask for LCD_WF45_BPBLCD45. */
#define BS_LCD_WF45_BPBLCD45 (1U)          /*!< Bit field size in bits for LCD_WF45_BPBLCD45. */

/*! @brief Read current value of the LCD_WF45_BPBLCD45 field. */
#define BR_LCD_WF45_BPBLCD45(x) (BME_UBFX8(HW_LCD_WF45_ADDR(x), BP_LCD_WF45_BPBLCD45, BS_LCD_WF45_BPBLCD45))

/*! @brief Format value for bitfield LCD_WF45_BPBLCD45. */
#define BF_LCD_WF45_BPBLCD45(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF45_BPBLCD45) & BM_LCD_WF45_BPBLCD45)

/*! @brief Set the BPBLCD45 field to a new value. */
#define BW_LCD_WF45_BPBLCD45(x, v) (BME_BFI8(HW_LCD_WF45_ADDR(x), ((uint8_t)(v) << BP_LCD_WF45_BPBLCD45), BP_LCD_WF45_BPBLCD45, 1))
/*@}*/

/*!
 * @name Register LCD_WF45, field BPCLCD45[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF45_BPCLCD45 (2U)          /*!< Bit position for LCD_WF45_BPCLCD45. */
#define BM_LCD_WF45_BPCLCD45 (0x04U)       /*!< Bit mask for LCD_WF45_BPCLCD45. */
#define BS_LCD_WF45_BPCLCD45 (1U)          /*!< Bit field size in bits for LCD_WF45_BPCLCD45. */

/*! @brief Read current value of the LCD_WF45_BPCLCD45 field. */
#define BR_LCD_WF45_BPCLCD45(x) (BME_UBFX8(HW_LCD_WF45_ADDR(x), BP_LCD_WF45_BPCLCD45, BS_LCD_WF45_BPCLCD45))

/*! @brief Format value for bitfield LCD_WF45_BPCLCD45. */
#define BF_LCD_WF45_BPCLCD45(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF45_BPCLCD45) & BM_LCD_WF45_BPCLCD45)

/*! @brief Set the BPCLCD45 field to a new value. */
#define BW_LCD_WF45_BPCLCD45(x, v) (BME_BFI8(HW_LCD_WF45_ADDR(x), ((uint8_t)(v) << BP_LCD_WF45_BPCLCD45), BP_LCD_WF45_BPCLCD45, 1))
/*@}*/

/*!
 * @name Register LCD_WF45, field BPDLCD45[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF45_BPDLCD45 (3U)          /*!< Bit position for LCD_WF45_BPDLCD45. */
#define BM_LCD_WF45_BPDLCD45 (0x08U)       /*!< Bit mask for LCD_WF45_BPDLCD45. */
#define BS_LCD_WF45_BPDLCD45 (1U)          /*!< Bit field size in bits for LCD_WF45_BPDLCD45. */

/*! @brief Read current value of the LCD_WF45_BPDLCD45 field. */
#define BR_LCD_WF45_BPDLCD45(x) (BME_UBFX8(HW_LCD_WF45_ADDR(x), BP_LCD_WF45_BPDLCD45, BS_LCD_WF45_BPDLCD45))

/*! @brief Format value for bitfield LCD_WF45_BPDLCD45. */
#define BF_LCD_WF45_BPDLCD45(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF45_BPDLCD45) & BM_LCD_WF45_BPDLCD45)

/*! @brief Set the BPDLCD45 field to a new value. */
#define BW_LCD_WF45_BPDLCD45(x, v) (BME_BFI8(HW_LCD_WF45_ADDR(x), ((uint8_t)(v) << BP_LCD_WF45_BPDLCD45), BP_LCD_WF45_BPDLCD45, 1))
/*@}*/

/*!
 * @name Register LCD_WF45, field BPELCD45[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF45_BPELCD45 (4U)          /*!< Bit position for LCD_WF45_BPELCD45. */
#define BM_LCD_WF45_BPELCD45 (0x10U)       /*!< Bit mask for LCD_WF45_BPELCD45. */
#define BS_LCD_WF45_BPELCD45 (1U)          /*!< Bit field size in bits for LCD_WF45_BPELCD45. */

