nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Read current value of the LCD_WF47_BPHLCD47 field. */
#define BR_LCD_WF47_BPHLCD47(x) (BME_UBFX8(HW_LCD_WF47_ADDR(x), BP_LCD_WF47_BPHLCD47, BS_LCD_WF47_BPHLCD47))

/*! @brief Format value for bitfield LCD_WF47_BPHLCD47. */
#define BF_LCD_WF47_BPHLCD47(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF47_BPHLCD47) & BM_LCD_WF47_BPHLCD47)

/*! @brief Set the BPHLCD47 field to a new value. */
#define BW_LCD_WF47_BPHLCD47(x, v) (BME_BFI8(HW_LCD_WF47_ADDR(x), ((uint8_t)(v) << BP_LCD_WF47_BPHLCD47), BP_LCD_WF47_BPHLCD47, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF48 - LCD Waveform Register 48.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF48 - LCD Waveform Register 48. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf48
{
    uint8_t U;
    struct _hw_lcd_wf48_bitfields
    {
        uint8_t BPALCD48 : 1;          /*!< [0]  */
        uint8_t BPBLCD48 : 1;          /*!< [1]  */
        uint8_t BPCLCD48 : 1;          /*!< [2]  */
        uint8_t BPDLCD48 : 1;          /*!< [3]  */
        uint8_t BPELCD48 : 1;          /*!< [4]  */
        uint8_t BPFLCD48 : 1;          /*!< [5]  */
        uint8_t BPGLCD48 : 1;          /*!< [6]  */
        uint8_t BPHLCD48 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf48_t;

/*!
 * @name Constants and macros for entire LCD_WF48 register
 */
/*@{*/
#define HW_LCD_WF48_ADDR(x)      ((x) + 0x50U)

#define HW_LCD_WF48(x)           (*(__IO hw_lcd_wf48_t *) HW_LCD_WF48_ADDR(x))
#define HW_LCD_WF48_RD(x)        (HW_LCD_WF48(x).U)
#define HW_LCD_WF48_WR(x, v)     (HW_LCD_WF48(x).U = (v))
#define HW_LCD_WF48_SET(x, v)    (BME_OR8(HW_LCD_WF48_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF48_CLR(x, v)    (BME_AND8(HW_LCD_WF48_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF48_TOG(x, v)    (BME_XOR8(HW_LCD_WF48_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF48 bitfields
 */

/*!
 * @name Register LCD_WF48, field BPALCD48[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF48_BPALCD48 (0U)          /*!< Bit position for LCD_WF48_BPALCD48. */
#define BM_LCD_WF48_BPALCD48 (0x01U)       /*!< Bit mask for LCD_WF48_BPALCD48. */
#define BS_LCD_WF48_BPALCD48 (1U)          /*!< Bit field size in bits for LCD_WF48_BPALCD48. */

/*! @brief Read current value of the LCD_WF48_BPALCD48 field. */
#define BR_LCD_WF48_BPALCD48(x) (BME_UBFX8(HW_LCD_WF48_ADDR(x), BP_LCD_WF48_BPALCD48, BS_LCD_WF48_BPALCD48))

/*! @brief Format value for bitfield LCD_WF48_BPALCD48. */
#define BF_LCD_WF48_BPALCD48(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF48_BPALCD48) & BM_LCD_WF48_BPALCD48)

/*! @brief Set the BPALCD48 field to a new value. */
#define BW_LCD_WF48_BPALCD48(x, v) (BME_BFI8(HW_LCD_WF48_ADDR(x), ((uint8_t)(v) << BP_LCD_WF48_BPALCD48), BP_LCD_WF48_BPALCD48, 1))
/*@}*/

/*!
 * @name Register LCD_WF48, field BPBLCD48[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF48_BPBLCD48 (1U)          /*!< Bit position for LCD_WF48_BPBLCD48. */
#define BM_LCD_WF48_BPBLCD48 (0x02U)       /*!< Bit mask for LCD_WF48_BPBLCD48. */
#define BS_LCD_WF48_BPBLCD48 (1U)          /*!< Bit field size in bits for LCD_WF48_BPBLCD48. */

/*! @brief Read current value of the LCD_WF48_BPBLCD48 field. */
#define BR_LCD_WF48_BPBLCD48(x) (BME_UBFX8(HW_LCD_WF48_ADDR(x), BP_LCD_WF48_BPBLCD48, BS_LCD_WF48_BPBLCD48))

/*! @brief Format value for bitfield LCD_WF48_BPBLCD48. */
#define BF_LCD_WF48_BPBLCD48(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF48_BPBLCD48) & BM_LCD_WF48_BPBLCD48)

/*! @brief Set the BPBLCD48 field to a new value. */
#define BW_LCD_WF48_BPBLCD48(x, v) (BME_BFI8(HW_LCD_WF48_ADDR(x), ((uint8_t)(v) << BP_LCD_WF48_BPBLCD48), BP_LCD_WF48_BPBLCD48, 1))
/*@}*/

/*!
 * @name Register LCD_WF48, field BPCLCD48[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF48_BPCLCD48 (2U)          /*!< Bit position for LCD_WF48_BPCLCD48. */
#define BM_LCD_WF48_BPCLCD48 (0x04U)       /*!< Bit mask for LCD_WF48_BPCLCD48. */
#define BS_LCD_WF48_BPCLCD48 (1U)          /*!< Bit field size in bits for LCD_WF48_BPCLCD48. */

/*! @brief Read current value of the LCD_WF48_BPCLCD48 field. */
#define BR_LCD_WF48_BPCLCD48(x) (BME_UBFX8(HW_LCD_WF48_ADDR(x), BP_LCD_WF48_BPCLCD48, BS_LCD_WF48_BPCLCD48))

/*! @brief Format value for bitfield LCD_WF48_BPCLCD48. */
#define BF_LCD_WF48_BPCLCD48(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF48_BPCLCD48) & BM_LCD_WF48_BPCLCD48)

/*! @brief Set the BPCLCD48 field to a new value. */
#define BW_LCD_WF48_BPCLCD48(x, v) (BME_BFI8(HW_LCD_WF48_ADDR(x), ((uint8_t)(v) << BP_LCD_WF48_BPCLCD48), BP_LCD_WF48_BPCLCD48, 1))
/*@}*/

/*!
 * @name Register LCD_WF48, field BPDLCD48[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF48_BPDLCD48 (3U)          /*!< Bit position for LCD_WF48_BPDLCD48. */
#define BM_LCD_WF48_BPDLCD48 (0x08U)       /*!< Bit mask for LCD_WF48_BPDLCD48. */
#define BS_LCD_WF48_BPDLCD48 (1U)          /*!< Bit field size in bits for LCD_WF48_BPDLCD48. */

/*! @brief Read current value of the LCD_WF48_BPDLCD48 field. */
#define BR_LCD_WF48_BPDLCD48(x) (BME_UBFX8(HW_LCD_WF48_ADDR(x), BP_LCD_WF48_BPDLCD48, BS_LCD_WF48_BPDLCD48))

/*! @brief Format value for bitfield LCD_WF48_BPDLCD48. */
#define BF_LCD_WF48_BPDLCD48(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF48_BPDLCD48) & BM_LCD_WF48_BPDLCD48)

/*! @brief Set the BPDLCD48 field to a new value. */
#define BW_LCD_WF48_BPDLCD48(x, v) (BME_BFI8(HW_LCD_WF48_ADDR(x), ((uint8_t)(v) << BP_LCD_WF48_BPDLCD48), BP_LCD_WF48_BPDLCD48, 1))
/*@}*/

/*!
 * @name Register LCD_WF48, field BPELCD48[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF48_BPELCD48 (4U)          /*!< Bit position for LCD_WF48_BPELCD48. */
#define BM_LCD_WF48_BPELCD48 (0x10U)       /*!< Bit mask for LCD_WF48_BPELCD48. */
#define BS_LCD_WF48_BPELCD48 (1U)          /*!< Bit field size in bits for LCD_WF48_BPELCD48. */

/*! @brief Read current value of the LCD_WF48_BPELCD48 field. */
#define BR_LCD_WF48_BPELCD48(x) (BME_UBFX8(HW_LCD_WF48_ADDR(x), BP_LCD_WF48_BPELCD48, BS_LCD_WF48_BPELCD48))

/*! @brief Format value for bitfield LCD_WF48_BPELCD48. */
#define BF_LCD_WF48_BPELCD48(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF48_BPELCD48) & BM_LCD_WF48_BPELCD48)

/*! @brief Set the BPELCD48 field to a new value. */
#define BW_LCD_WF48_BPELCD48(x, v) (BME_BFI8(HW_LCD_WF48_ADDR(x), ((uint8_t)(v) << BP_LCD_WF48_BPELCD48), BP_LCD_WF48_BPELCD48, 1))
/*@}*/

/*!
 * @name Register LCD_WF48, field BPFLCD48[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF48_BPFLCD48 (5U)          /*!< Bit position for LCD_WF48_BPFLCD48. */
#define BM_LCD_WF48_BPFLCD48 (0x20U)       /*!< Bit mask for LCD_WF48_BPFLCD48. */
#define BS_LCD_WF48_BPFLCD48 (1U)          /*!< Bit field size in bits for LCD_WF48_BPFLCD48. */

