nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Format value for bitfield LCD_WF53_BPELCD53. */
#define BF_LCD_WF53_BPELCD53(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF53_BPELCD53) & BM_LCD_WF53_BPELCD53)

/*! @brief Set the BPELCD53 field to a new value. */
#define BW_LCD_WF53_BPELCD53(x, v) (BME_BFI8(HW_LCD_WF53_ADDR(x), ((uint8_t)(v) << BP_LCD_WF53_BPELCD53), BP_LCD_WF53_BPELCD53, 1))
/*@}*/

/*!
 * @name Register LCD_WF53, field BPFLCD53[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF53_BPFLCD53 (5U)          /*!< Bit position for LCD_WF53_BPFLCD53. */
#define BM_LCD_WF53_BPFLCD53 (0x20U)       /*!< Bit mask for LCD_WF53_BPFLCD53. */
#define BS_LCD_WF53_BPFLCD53 (1U)          /*!< Bit field size in bits for LCD_WF53_BPFLCD53. */

/*! @brief Read current value of the LCD_WF53_BPFLCD53 field. */
#define BR_LCD_WF53_BPFLCD53(x) (BME_UBFX8(HW_LCD_WF53_ADDR(x), BP_LCD_WF53_BPFLCD53, BS_LCD_WF53_BPFLCD53))

/*! @brief Format value for bitfield LCD_WF53_BPFLCD53. */
#define BF_LCD_WF53_BPFLCD53(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF53_BPFLCD53) & BM_LCD_WF53_BPFLCD53)

/*! @brief Set the BPFLCD53 field to a new value. */
#define BW_LCD_WF53_BPFLCD53(x, v) (BME_BFI8(HW_LCD_WF53_ADDR(x), ((uint8_t)(v) << BP_LCD_WF53_BPFLCD53), BP_LCD_WF53_BPFLCD53, 1))
/*@}*/

/*!
 * @name Register LCD_WF53, field BPGLCD53[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF53_BPGLCD53 (6U)          /*!< Bit position for LCD_WF53_BPGLCD53. */
#define BM_LCD_WF53_BPGLCD53 (0x40U)       /*!< Bit mask for LCD_WF53_BPGLCD53. */
#define BS_LCD_WF53_BPGLCD53 (1U)          /*!< Bit field size in bits for LCD_WF53_BPGLCD53. */

/*! @brief Read current value of the LCD_WF53_BPGLCD53 field. */
#define BR_LCD_WF53_BPGLCD53(x) (BME_UBFX8(HW_LCD_WF53_ADDR(x), BP_LCD_WF53_BPGLCD53, BS_LCD_WF53_BPGLCD53))

/*! @brief Format value for bitfield LCD_WF53_BPGLCD53. */
#define BF_LCD_WF53_BPGLCD53(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF53_BPGLCD53) & BM_LCD_WF53_BPGLCD53)

/*! @brief Set the BPGLCD53 field to a new value. */
#define BW_LCD_WF53_BPGLCD53(x, v) (BME_BFI8(HW_LCD_WF53_ADDR(x), ((uint8_t)(v) << BP_LCD_WF53_BPGLCD53), BP_LCD_WF53_BPGLCD53, 1))
/*@}*/

/*!
 * @name Register LCD_WF53, field BPHLCD53[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF53_BPHLCD53 (7U)          /*!< Bit position for LCD_WF53_BPHLCD53. */
#define BM_LCD_WF53_BPHLCD53 (0x80U)       /*!< Bit mask for LCD_WF53_BPHLCD53. */
#define BS_LCD_WF53_BPHLCD53 (1U)          /*!< Bit field size in bits for LCD_WF53_BPHLCD53. */

/*! @brief Read current value of the LCD_WF53_BPHLCD53 field. */
#define BR_LCD_WF53_BPHLCD53(x) (BME_UBFX8(HW_LCD_WF53_ADDR(x), BP_LCD_WF53_BPHLCD53, BS_LCD_WF53_BPHLCD53))

/*! @brief Format value for bitfield LCD_WF53_BPHLCD53. */
#define BF_LCD_WF53_BPHLCD53(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF53_BPHLCD53) & BM_LCD_WF53_BPHLCD53)

/*! @brief Set the BPHLCD53 field to a new value. */
#define BW_LCD_WF53_BPHLCD53(x, v) (BME_BFI8(HW_LCD_WF53_ADDR(x), ((uint8_t)(v) << BP_LCD_WF53_BPHLCD53), BP_LCD_WF53_BPHLCD53, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF54 - LCD Waveform Register 54.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF54 - LCD Waveform Register 54. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf54
{
    uint8_t U;
    struct _hw_lcd_wf54_bitfields
    {
        uint8_t BPALCD54 : 1;          /*!< [0]  */
        uint8_t BPBLCD54 : 1;          /*!< [1]  */
        uint8_t BPCLCD54 : 1;          /*!< [2]  */
        uint8_t BPDLCD54 : 1;          /*!< [3]  */
        uint8_t BPELCD54 : 1;          /*!< [4]  */
        uint8_t BPFLCD54 : 1;          /*!< [5]  */
        uint8_t BPGLCD54 : 1;          /*!< [6]  */
        uint8_t BPHLCD54 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf54_t;

/*!
 * @name Constants and macros for entire LCD_WF54 register
 */
/*@{*/
#define HW_LCD_WF54_ADDR(x)      ((x) + 0x56U)

#define HW_LCD_WF54(x)           (*(__IO hw_lcd_wf54_t *) HW_LCD_WF54_ADDR(x))
#define HW_LCD_WF54_RD(x)        (HW_LCD_WF54(x).U)
#define HW_LCD_WF54_WR(x, v)     (HW_LCD_WF54(x).U = (v))
#define HW_LCD_WF54_SET(x, v)    (BME_OR8(HW_LCD_WF54_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF54_CLR(x, v)    (BME_AND8(HW_LCD_WF54_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF54_TOG(x, v)    (BME_XOR8(HW_LCD_WF54_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF54 bitfields
 */

/*!
 * @name Register LCD_WF54, field BPALCD54[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF54_BPALCD54 (0U)          /*!< Bit position for LCD_WF54_BPALCD54. */
#define BM_LCD_WF54_BPALCD54 (0x01U)       /*!< Bit mask for LCD_WF54_BPALCD54. */
#define BS_LCD_WF54_BPALCD54 (1U)          /*!< Bit field size in bits for LCD_WF54_BPALCD54. */

/*! @brief Read current value of the LCD_WF54_BPALCD54 field. */
#define BR_LCD_WF54_BPALCD54(x) (BME_UBFX8(HW_LCD_WF54_ADDR(x), BP_LCD_WF54_BPALCD54, BS_LCD_WF54_BPALCD54))

/*! @brief Format value for bitfield LCD_WF54_BPALCD54. */
#define BF_LCD_WF54_BPALCD54(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF54_BPALCD54) & BM_LCD_WF54_BPALCD54)

/*! @brief Set the BPALCD54 field to a new value. */
#define BW_LCD_WF54_BPALCD54(x, v) (BME_BFI8(HW_LCD_WF54_ADDR(x), ((uint8_t)(v) << BP_LCD_WF54_BPALCD54), BP_LCD_WF54_BPALCD54, 1))
/*@}*/

/*!
 * @name Register LCD_WF54, field BPBLCD54[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF54_BPBLCD54 (1U)          /*!< Bit position for LCD_WF54_BPBLCD54. */
#define BM_LCD_WF54_BPBLCD54 (0x02U)       /*!< Bit mask for LCD_WF54_BPBLCD54. */
#define BS_LCD_WF54_BPBLCD54 (1U)          /*!< Bit field size in bits for LCD_WF54_BPBLCD54. */

/*! @brief Read current value of the LCD_WF54_BPBLCD54 field. */
#define BR_LCD_WF54_BPBLCD54(x) (BME_UBFX8(HW_LCD_WF54_ADDR(x), BP_LCD_WF54_BPBLCD54, BS_LCD_WF54_BPBLCD54))

/*! @brief Format value for bitfield LCD_WF54_BPBLCD54. */
#define BF_LCD_WF54_BPBLCD54(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF54_BPBLCD54) & BM_LCD_WF54_BPBLCD54)

/*! @brief Set the BPBLCD54 field to a new value. */
#define BW_LCD_WF54_BPBLCD54(x, v) (BME_BFI8(HW_LCD_WF54_ADDR(x), ((uint8_t)(v) << BP_LCD_WF54_BPBLCD54), BP_LCD_WF54_BPBLCD54, 1))
/*@}*/

/*!
 * @name Register LCD_WF54, field BPCLCD54[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF54_BPCLCD54 (2U)          /*!< Bit position for LCD_WF54_BPCLCD54. */
#define BM_LCD_WF54_BPCLCD54 (0x04U)       /*!< Bit mask for LCD_WF54_BPCLCD54. */
#define BS_LCD_WF54_BPCLCD54 (1U)          /*!< Bit field size in bits for LCD_WF54_BPCLCD54. */

/*! @brief Read current value of the LCD_WF54_BPCLCD54 field. */
#define BR_LCD_WF54_BPCLCD54(x) (BME_UBFX8(HW_LCD_WF54_ADDR(x), BP_LCD_WF54_BPCLCD54, BS_LCD_WF54_BPCLCD54))

/*! @brief Format value for bitfield LCD_WF54_BPCLCD54. */
#define BF_LCD_WF54_BPCLCD54(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF54_BPCLCD54) & BM_LCD_WF54_BPCLCD54)

/*! @brief Set the BPCLCD54 field to a new value. */
#define BW_LCD_WF54_BPCLCD54(x, v) (BME_BFI8(HW_LCD_WF54_ADDR(x), ((uint8_t)(v) << BP_LCD_WF54_BPCLCD54), BP_LCD_WF54_BPCLCD54, 1))
/*@}*/

/*!
 * @name Register LCD_WF54, field BPDLCD54[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF54_BPDLCD54 (3U)          /*!< Bit position for LCD_WF54_BPDLCD54. */
#define BM_LCD_WF54_BPDLCD54 (0x08U)       /*!< Bit mask for LCD_WF54_BPDLCD54. */
#define BS_LCD_WF54_BPDLCD54 (1U)          /*!< Bit field size in bits for LCD_WF54_BPDLCD54. */

/*! @brief Read current value of the LCD_WF54_BPDLCD54 field. */
#define BR_LCD_WF54_BPDLCD54(x) (BME_UBFX8(HW_LCD_WF54_ADDR(x), BP_LCD_WF54_BPDLCD54, BS_LCD_WF54_BPDLCD54))

/*! @brief Format value for bitfield LCD_WF54_BPDLCD54. */
#define BF_LCD_WF54_BPDLCD54(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF54_BPDLCD54) & BM_LCD_WF54_BPDLCD54)

/*! @brief Set the BPDLCD54 field to a new value. */
#define BW_LCD_WF54_BPDLCD54(x, v) (BME_BFI8(HW_LCD_WF54_ADDR(x), ((uint8_t)(v) << BP_LCD_WF54_BPDLCD54), BP_LCD_WF54_BPDLCD54, 1))
/*@}*/

/*!
 * @name Register LCD_WF54, field BPELCD54[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF54_BPELCD54 (4U)          /*!< Bit position for LCD_WF54_BPELCD54. */
#define BM_LCD_WF54_BPELCD54 (0x10U)       /*!< Bit mask for LCD_WF54_BPELCD54. */
#define BS_LCD_WF54_BPELCD54 (1U)          /*!< Bit field size in bits for LCD_WF54_BPELCD54. */

/*! @brief Read current value of the LCD_WF54_BPELCD54 field. */
#define BR_LCD_WF54_BPELCD54(x) (BME_UBFX8(HW_LCD_WF54_ADDR(x), BP_LCD_WF54_BPELCD54, BS_LCD_WF54_BPELCD54))

