nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Read current value of the LCD_WF55_BPBLCD55 field. */
#define BR_LCD_WF55_BPBLCD55(x) (BME_UBFX8(HW_LCD_WF55_ADDR(x), BP_LCD_WF55_BPBLCD55, BS_LCD_WF55_BPBLCD55))

/*! @brief Format value for bitfield LCD_WF55_BPBLCD55. */
#define BF_LCD_WF55_BPBLCD55(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF55_BPBLCD55) & BM_LCD_WF55_BPBLCD55)

/*! @brief Set the BPBLCD55 field to a new value. */
#define BW_LCD_WF55_BPBLCD55(x, v) (BME_BFI8(HW_LCD_WF55_ADDR(x), ((uint8_t)(v) << BP_LCD_WF55_BPBLCD55), BP_LCD_WF55_BPBLCD55, 1))
/*@}*/

/*!
 * @name Register LCD_WF55, field BPCLCD55[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF55_BPCLCD55 (2U)          /*!< Bit position for LCD_WF55_BPCLCD55. */
#define BM_LCD_WF55_BPCLCD55 (0x04U)       /*!< Bit mask for LCD_WF55_BPCLCD55. */
#define BS_LCD_WF55_BPCLCD55 (1U)          /*!< Bit field size in bits for LCD_WF55_BPCLCD55. */

/*! @brief Read current value of the LCD_WF55_BPCLCD55 field. */
#define BR_LCD_WF55_BPCLCD55(x) (BME_UBFX8(HW_LCD_WF55_ADDR(x), BP_LCD_WF55_BPCLCD55, BS_LCD_WF55_BPCLCD55))

/*! @brief Format value for bitfield LCD_WF55_BPCLCD55. */
#define BF_LCD_WF55_BPCLCD55(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF55_BPCLCD55) & BM_LCD_WF55_BPCLCD55)

/*! @brief Set the BPCLCD55 field to a new value. */
#define BW_LCD_WF55_BPCLCD55(x, v) (BME_BFI8(HW_LCD_WF55_ADDR(x), ((uint8_t)(v) << BP_LCD_WF55_BPCLCD55), BP_LCD_WF55_BPCLCD55, 1))
/*@}*/

/*!
 * @name Register LCD_WF55, field BPDLCD55[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF55_BPDLCD55 (3U)          /*!< Bit position for LCD_WF55_BPDLCD55. */
#define BM_LCD_WF55_BPDLCD55 (0x08U)       /*!< Bit mask for LCD_WF55_BPDLCD55. */
#define BS_LCD_WF55_BPDLCD55 (1U)          /*!< Bit field size in bits for LCD_WF55_BPDLCD55. */

/*! @brief Read current value of the LCD_WF55_BPDLCD55 field. */
#define BR_LCD_WF55_BPDLCD55(x) (BME_UBFX8(HW_LCD_WF55_ADDR(x), BP_LCD_WF55_BPDLCD55, BS_LCD_WF55_BPDLCD55))

/*! @brief Format value for bitfield LCD_WF55_BPDLCD55. */
#define BF_LCD_WF55_BPDLCD55(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF55_BPDLCD55) & BM_LCD_WF55_BPDLCD55)

/*! @brief Set the BPDLCD55 field to a new value. */
#define BW_LCD_WF55_BPDLCD55(x, v) (BME_BFI8(HW_LCD_WF55_ADDR(x), ((uint8_t)(v) << BP_LCD_WF55_BPDLCD55), BP_LCD_WF55_BPDLCD55, 1))
/*@}*/

/*!
 * @name Register LCD_WF55, field BPELCD55[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF55_BPELCD55 (4U)          /*!< Bit position for LCD_WF55_BPELCD55. */
#define BM_LCD_WF55_BPELCD55 (0x10U)       /*!< Bit mask for LCD_WF55_BPELCD55. */
#define BS_LCD_WF55_BPELCD55 (1U)          /*!< Bit field size in bits for LCD_WF55_BPELCD55. */

/*! @brief Read current value of the LCD_WF55_BPELCD55 field. */
#define BR_LCD_WF55_BPELCD55(x) (BME_UBFX8(HW_LCD_WF55_ADDR(x), BP_LCD_WF55_BPELCD55, BS_LCD_WF55_BPELCD55))

/*! @brief Format value for bitfield LCD_WF55_BPELCD55. */
#define BF_LCD_WF55_BPELCD55(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF55_BPELCD55) & BM_LCD_WF55_BPELCD55)

/*! @brief Set the BPELCD55 field to a new value. */
#define BW_LCD_WF55_BPELCD55(x, v) (BME_BFI8(HW_LCD_WF55_ADDR(x), ((uint8_t)(v) << BP_LCD_WF55_BPELCD55), BP_LCD_WF55_BPELCD55, 1))
/*@}*/

/*!
 * @name Register LCD_WF55, field BPFLCD55[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF55_BPFLCD55 (5U)          /*!< Bit position for LCD_WF55_BPFLCD55. */
#define BM_LCD_WF55_BPFLCD55 (0x20U)       /*!< Bit mask for LCD_WF55_BPFLCD55. */
#define BS_LCD_WF55_BPFLCD55 (1U)          /*!< Bit field size in bits for LCD_WF55_BPFLCD55. */

/*! @brief Read current value of the LCD_WF55_BPFLCD55 field. */
#define BR_LCD_WF55_BPFLCD55(x) (BME_UBFX8(HW_LCD_WF55_ADDR(x), BP_LCD_WF55_BPFLCD55, BS_LCD_WF55_BPFLCD55))

/*! @brief Format value for bitfield LCD_WF55_BPFLCD55. */
#define BF_LCD_WF55_BPFLCD55(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF55_BPFLCD55) & BM_LCD_WF55_BPFLCD55)

/*! @brief Set the BPFLCD55 field to a new value. */
#define BW_LCD_WF55_BPFLCD55(x, v) (BME_BFI8(HW_LCD_WF55_ADDR(x), ((uint8_t)(v) << BP_LCD_WF55_BPFLCD55), BP_LCD_WF55_BPFLCD55, 1))
/*@}*/

/*!
 * @name Register LCD_WF55, field BPGLCD55[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF55_BPGLCD55 (6U)          /*!< Bit position for LCD_WF55_BPGLCD55. */
#define BM_LCD_WF55_BPGLCD55 (0x40U)       /*!< Bit mask for LCD_WF55_BPGLCD55. */
#define BS_LCD_WF55_BPGLCD55 (1U)          /*!< Bit field size in bits for LCD_WF55_BPGLCD55. */

/*! @brief Read current value of the LCD_WF55_BPGLCD55 field. */
#define BR_LCD_WF55_BPGLCD55(x) (BME_UBFX8(HW_LCD_WF55_ADDR(x), BP_LCD_WF55_BPGLCD55, BS_LCD_WF55_BPGLCD55))

/*! @brief Format value for bitfield LCD_WF55_BPGLCD55. */
#define BF_LCD_WF55_BPGLCD55(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF55_BPGLCD55) & BM_LCD_WF55_BPGLCD55)

/*! @brief Set the BPGLCD55 field to a new value. */
#define BW_LCD_WF55_BPGLCD55(x, v) (BME_BFI8(HW_LCD_WF55_ADDR(x), ((uint8_t)(v) << BP_LCD_WF55_BPGLCD55), BP_LCD_WF55_BPGLCD55, 1))
/*@}*/

/*!
 * @name Register LCD_WF55, field BPHLCD55[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF55_BPHLCD55 (7U)          /*!< Bit position for LCD_WF55_BPHLCD55. */
#define BM_LCD_WF55_BPHLCD55 (0x80U)       /*!< Bit mask for LCD_WF55_BPHLCD55. */
#define BS_LCD_WF55_BPHLCD55 (1U)          /*!< Bit field size in bits for LCD_WF55_BPHLCD55. */

