nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Read current value of the LCD_WF57_BPCLCD57 field. */
#define BR_LCD_WF57_BPCLCD57(x) (BME_UBFX8(HW_LCD_WF57_ADDR(x), BP_LCD_WF57_BPCLCD57, BS_LCD_WF57_BPCLCD57))

/*! @brief Format value for bitfield LCD_WF57_BPCLCD57. */
#define BF_LCD_WF57_BPCLCD57(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF57_BPCLCD57) & BM_LCD_WF57_BPCLCD57)

/*! @brief Set the BPCLCD57 field to a new value. */
#define BW_LCD_WF57_BPCLCD57(x, v) (BME_BFI8(HW_LCD_WF57_ADDR(x), ((uint8_t)(v) << BP_LCD_WF57_BPCLCD57), BP_LCD_WF57_BPCLCD57, 1))
/*@}*/

/*!
 * @name Register LCD_WF57, field BPDLCD57[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF57_BPDLCD57 (3U)          /*!< Bit position for LCD_WF57_BPDLCD57. */
#define BM_LCD_WF57_BPDLCD57 (0x08U)       /*!< Bit mask for LCD_WF57_BPDLCD57. */
#define BS_LCD_WF57_BPDLCD57 (1U)          /*!< Bit field size in bits for LCD_WF57_BPDLCD57. */

/*! @brief Read current value of the LCD_WF57_BPDLCD57 field. */
#define BR_LCD_WF57_BPDLCD57(x) (BME_UBFX8(HW_LCD_WF57_ADDR(x), BP_LCD_WF57_BPDLCD57, BS_LCD_WF57_BPDLCD57))

/*! @brief Format value for bitfield LCD_WF57_BPDLCD57. */
#define BF_LCD_WF57_BPDLCD57(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF57_BPDLCD57) & BM_LCD_WF57_BPDLCD57)

/*! @brief Set the BPDLCD57 field to a new value. */
#define BW_LCD_WF57_BPDLCD57(x, v) (BME_BFI8(HW_LCD_WF57_ADDR(x), ((uint8_t)(v) << BP_LCD_WF57_BPDLCD57), BP_LCD_WF57_BPDLCD57, 1))
/*@}*/

/*!
 * @name Register LCD_WF57, field BPELCD57[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF57_BPELCD57 (4U)          /*!< Bit position for LCD_WF57_BPELCD57. */
#define BM_LCD_WF57_BPELCD57 (0x10U)       /*!< Bit mask for LCD_WF57_BPELCD57. */
#define BS_LCD_WF57_BPELCD57 (1U)          /*!< Bit field size in bits for LCD_WF57_BPELCD57. */

/*! @brief Read current value of the LCD_WF57_BPELCD57 field. */
#define BR_LCD_WF57_BPELCD57(x) (BME_UBFX8(HW_LCD_WF57_ADDR(x), BP_LCD_WF57_BPELCD57, BS_LCD_WF57_BPELCD57))

/*! @brief Format value for bitfield LCD_WF57_BPELCD57. */
#define BF_LCD_WF57_BPELCD57(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF57_BPELCD57) & BM_LCD_WF57_BPELCD57)

/*! @brief Set the BPELCD57 field to a new value. */
#define BW_LCD_WF57_BPELCD57(x, v) (BME_BFI8(HW_LCD_WF57_ADDR(x), ((uint8_t)(v) << BP_LCD_WF57_BPELCD57), BP_LCD_WF57_BPELCD57, 1))
/*@}*/

/*!
 * @name Register LCD_WF57, field BPFLCD57[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF57_BPFLCD57 (5U)          /*!< Bit position for LCD_WF57_BPFLCD57. */
#define BM_LCD_WF57_BPFLCD57 (0x20U)       /*!< Bit mask for LCD_WF57_BPFLCD57. */
#define BS_LCD_WF57_BPFLCD57 (1U)          /*!< Bit field size in bits for LCD_WF57_BPFLCD57. */

/*! @brief Read current value of the LCD_WF57_BPFLCD57 field. */
#define BR_LCD_WF57_BPFLCD57(x) (BME_UBFX8(HW_LCD_WF57_ADDR(x), BP_LCD_WF57_BPFLCD57, BS_LCD_WF57_BPFLCD57))

/*! @brief Format value for bitfield LCD_WF57_BPFLCD57. */
#define BF_LCD_WF57_BPFLCD57(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF57_BPFLCD57) & BM_LCD_WF57_BPFLCD57)

/*! @brief Set the BPFLCD57 field to a new value. */
#define BW_LCD_WF57_BPFLCD57(x, v) (BME_BFI8(HW_LCD_WF57_ADDR(x), ((uint8_t)(v) << BP_LCD_WF57_BPFLCD57), BP_LCD_WF57_BPFLCD57, 1))
/*@}*/

/*!
 * @name Register LCD_WF57, field BPGLCD57[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF57_BPGLCD57 (6U)          /*!< Bit position for LCD_WF57_BPGLCD57. */
#define BM_LCD_WF57_BPGLCD57 (0x40U)       /*!< Bit mask for LCD_WF57_BPGLCD57. */
#define BS_LCD_WF57_BPGLCD57 (1U)          /*!< Bit field size in bits for LCD_WF57_BPGLCD57. */

/*! @brief Read current value of the LCD_WF57_BPGLCD57 field. */
#define BR_LCD_WF57_BPGLCD57(x) (BME_UBFX8(HW_LCD_WF57_ADDR(x), BP_LCD_WF57_BPGLCD57, BS_LCD_WF57_BPGLCD57))

/*! @brief Format value for bitfield LCD_WF57_BPGLCD57. */
#define BF_LCD_WF57_BPGLCD57(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF57_BPGLCD57) & BM_LCD_WF57_BPGLCD57)

/*! @brief Set the BPGLCD57 field to a new value. */
#define BW_LCD_WF57_BPGLCD57(x, v) (BME_BFI8(HW_LCD_WF57_ADDR(x), ((uint8_t)(v) << BP_LCD_WF57_BPGLCD57), BP_LCD_WF57_BPGLCD57, 1))
/*@}*/

/*!
 * @name Register LCD_WF57, field BPHLCD57[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF57_BPHLCD57 (7U)          /*!< Bit position for LCD_WF57_BPHLCD57. */
#define BM_LCD_WF57_BPHLCD57 (0x80U)       /*!< Bit mask for LCD_WF57_BPHLCD57. */
#define BS_LCD_WF57_BPHLCD57 (1U)          /*!< Bit field size in bits for LCD_WF57_BPHLCD57. */

/*! @brief Read current value of the LCD_WF57_BPHLCD57 field. */
#define BR_LCD_WF57_BPHLCD57(x) (BME_UBFX8(HW_LCD_WF57_ADDR(x), BP_LCD_WF57_BPHLCD57, BS_LCD_WF57_BPHLCD57))

/*! @brief Format value for bitfield LCD_WF57_BPHLCD57. */
#define BF_LCD_WF57_BPHLCD57(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF57_BPHLCD57) & BM_LCD_WF57_BPHLCD57)

/*! @brief Set the BPHLCD57 field to a new value. */
#define BW_LCD_WF57_BPHLCD57(x, v) (BME_BFI8(HW_LCD_WF57_ADDR(x), ((uint8_t)(v) << BP_LCD_WF57_BPHLCD57), BP_LCD_WF57_BPHLCD57, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF58 - LCD Waveform Register 58.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF58 - LCD Waveform Register 58. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf58
{
    uint8_t U;
    struct _hw_lcd_wf58_bitfields
    {
        uint8_t BPALCD58 : 1;          /*!< [0]  */
        uint8_t BPBLCD58 : 1;          /*!< [1]  */
        uint8_t BPCLCD58 : 1;          /*!< [2]  */
        uint8_t BPDLCD58 : 1;          /*!< [3]  */
        uint8_t BPELCD58 : 1;          /*!< [4]  */
        uint8_t BPFLCD58 : 1;          /*!< [5]  */
        uint8_t BPGLCD58 : 1;          /*!< [6]  */
        uint8_t BPHLCD58 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf58_t;

/*!
 * @name Constants and macros for entire LCD_WF58 register
 */
/*@{*/
#define HW_LCD_WF58_ADDR(x)      ((x) + 0x5AU)

#define HW_LCD_WF58(x)           (*(__IO hw_lcd_wf58_t *) HW_LCD_WF58_ADDR(x))
#define HW_LCD_WF58_RD(x)        (HW_LCD_WF58(x).U)
#define HW_LCD_WF58_WR(x, v)     (HW_LCD_WF58(x).U = (v))
#define HW_LCD_WF58_SET(x, v)    (BME_OR8(HW_LCD_WF58_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF58_CLR(x, v)    (BME_AND8(HW_LCD_WF58_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF58_TOG(x, v)    (BME_XOR8(HW_LCD_WF58_ADDR(x), (uint8_t)(v)))
/*@}*/

