nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Read current value of the LCD_WF58_BPGLCD58 field. */
#define BR_LCD_WF58_BPGLCD58(x) (BME_UBFX8(HW_LCD_WF58_ADDR(x), BP_LCD_WF58_BPGLCD58, BS_LCD_WF58_BPGLCD58))

/*! @brief Format value for bitfield LCD_WF58_BPGLCD58. */
#define BF_LCD_WF58_BPGLCD58(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF58_BPGLCD58) & BM_LCD_WF58_BPGLCD58)

/*! @brief Set the BPGLCD58 field to a new value. */
#define BW_LCD_WF58_BPGLCD58(x, v) (BME_BFI8(HW_LCD_WF58_ADDR(x), ((uint8_t)(v) << BP_LCD_WF58_BPGLCD58), BP_LCD_WF58_BPGLCD58, 1))
/*@}*/

/*!
 * @name Register LCD_WF58, field BPHLCD58[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF58_BPHLCD58 (7U)          /*!< Bit position for LCD_WF58_BPHLCD58. */
#define BM_LCD_WF58_BPHLCD58 (0x80U)       /*!< Bit mask for LCD_WF58_BPHLCD58. */
#define BS_LCD_WF58_BPHLCD58 (1U)          /*!< Bit field size in bits for LCD_WF58_BPHLCD58. */

/*! @brief Read current value of the LCD_WF58_BPHLCD58 field. */
#define BR_LCD_WF58_BPHLCD58(x) (BME_UBFX8(HW_LCD_WF58_ADDR(x), BP_LCD_WF58_BPHLCD58, BS_LCD_WF58_BPHLCD58))

/*! @brief Format value for bitfield LCD_WF58_BPHLCD58. */
#define BF_LCD_WF58_BPHLCD58(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF58_BPHLCD58) & BM_LCD_WF58_BPHLCD58)

/*! @brief Set the BPHLCD58 field to a new value. */
#define BW_LCD_WF58_BPHLCD58(x, v) (BME_BFI8(HW_LCD_WF58_ADDR(x), ((uint8_t)(v) << BP_LCD_WF58_BPHLCD58), BP_LCD_WF58_BPHLCD58, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF59 - LCD Waveform Register 59.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF59 - LCD Waveform Register 59. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf59
{
    uint8_t U;
    struct _hw_lcd_wf59_bitfields
    {
        uint8_t BPALCD59 : 1;          /*!< [0]  */
        uint8_t BPBLCD59 : 1;          /*!< [1]  */
        uint8_t BPCLCD59 : 1;          /*!< [2]  */
        uint8_t BPDLCD59 : 1;          /*!< [3]  */
        uint8_t BPELCD59 : 1;          /*!< [4]  */
        uint8_t BPFLCD59 : 1;          /*!< [5]  */
        uint8_t BPGLCD59 : 1;          /*!< [6]  */
        uint8_t BPHLCD59 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf59_t;

/*!
 * @name Constants and macros for entire LCD_WF59 register
 */
/*@{*/
#define HW_LCD_WF59_ADDR(x)      ((x) + 0x5BU)

#define HW_LCD_WF59(x)           (*(__IO hw_lcd_wf59_t *) HW_LCD_WF59_ADDR(x))
#define HW_LCD_WF59_RD(x)        (HW_LCD_WF59(x).U)
#define HW_LCD_WF59_WR(x, v)     (HW_LCD_WF59(x).U = (v))
#define HW_LCD_WF59_SET(x, v)    (BME_OR8(HW_LCD_WF59_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF59_CLR(x, v)    (BME_AND8(HW_LCD_WF59_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF59_TOG(x, v)    (BME_XOR8(HW_LCD_WF59_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual LCD_WF59 bitfields
 */

/*!
 * @name Register LCD_WF59, field BPALCD59[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF59_BPALCD59 (0U)          /*!< Bit position for LCD_WF59_BPALCD59. */
#define BM_LCD_WF59_BPALCD59 (0x01U)       /*!< Bit mask for LCD_WF59_BPALCD59. */
#define BS_LCD_WF59_BPALCD59 (1U)          /*!< Bit field size in bits for LCD_WF59_BPALCD59. */

/*! @brief Read current value of the LCD_WF59_BPALCD59 field. */
#define BR_LCD_WF59_BPALCD59(x) (BME_UBFX8(HW_LCD_WF59_ADDR(x), BP_LCD_WF59_BPALCD59, BS_LCD_WF59_BPALCD59))

/*! @brief Format value for bitfield LCD_WF59_BPALCD59. */
#define BF_LCD_WF59_BPALCD59(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF59_BPALCD59) & BM_LCD_WF59_BPALCD59)

/*! @brief Set the BPALCD59 field to a new value. */
#define BW_LCD_WF59_BPALCD59(x, v) (BME_BFI8(HW_LCD_WF59_ADDR(x), ((uint8_t)(v) << BP_LCD_WF59_BPALCD59), BP_LCD_WF59_BPALCD59, 1))
/*@}*/

/*!
 * @name Register LCD_WF59, field BPBLCD59[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF59_BPBLCD59 (1U)          /*!< Bit position for LCD_WF59_BPBLCD59. */
#define BM_LCD_WF59_BPBLCD59 (0x02U)       /*!< Bit mask for LCD_WF59_BPBLCD59. */
#define BS_LCD_WF59_BPBLCD59 (1U)          /*!< Bit field size in bits for LCD_WF59_BPBLCD59. */

/*! @brief Read current value of the LCD_WF59_BPBLCD59 field. */
#define BR_LCD_WF59_BPBLCD59(x) (BME_UBFX8(HW_LCD_WF59_ADDR(x), BP_LCD_WF59_BPBLCD59, BS_LCD_WF59_BPBLCD59))

/*! @brief Format value for bitfield LCD_WF59_BPBLCD59. */
#define BF_LCD_WF59_BPBLCD59(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF59_BPBLCD59) & BM_LCD_WF59_BPBLCD59)

/*! @brief Set the BPBLCD59 field to a new value. */
#define BW_LCD_WF59_BPBLCD59(x, v) (BME_BFI8(HW_LCD_WF59_ADDR(x), ((uint8_t)(v) << BP_LCD_WF59_BPBLCD59), BP_LCD_WF59_BPBLCD59, 1))
/*@}*/

/*!
 * @name Register LCD_WF59, field BPCLCD59[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF59_BPCLCD59 (2U)          /*!< Bit position for LCD_WF59_BPCLCD59. */
#define BM_LCD_WF59_BPCLCD59 (0x04U)       /*!< Bit mask for LCD_WF59_BPCLCD59. */
#define BS_LCD_WF59_BPCLCD59 (1U)          /*!< Bit field size in bits for LCD_WF59_BPCLCD59. */

/*! @brief Read current value of the LCD_WF59_BPCLCD59 field. */
#define BR_LCD_WF59_BPCLCD59(x) (BME_UBFX8(HW_LCD_WF59_ADDR(x), BP_LCD_WF59_BPCLCD59, BS_LCD_WF59_BPCLCD59))

/*! @brief Format value for bitfield LCD_WF59_BPCLCD59. */
#define BF_LCD_WF59_BPCLCD59(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF59_BPCLCD59) & BM_LCD_WF59_BPCLCD59)

/*! @brief Set the BPCLCD59 field to a new value. */
#define BW_LCD_WF59_BPCLCD59(x, v) (BME_BFI8(HW_LCD_WF59_ADDR(x), ((uint8_t)(v) << BP_LCD_WF59_BPCLCD59), BP_LCD_WF59_BPCLCD59, 1))
/*@}*/

/*!
 * @name Register LCD_WF59, field BPDLCD59[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF59_BPDLCD59 (3U)          /*!< Bit position for LCD_WF59_BPDLCD59. */
#define BM_LCD_WF59_BPDLCD59 (0x08U)       /*!< Bit mask for LCD_WF59_BPDLCD59. */
#define BS_LCD_WF59_BPDLCD59 (1U)          /*!< Bit field size in bits for LCD_WF59_BPDLCD59. */

