nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*
 * Constants & macros for individual LCD_WF60 bitfields
 */

/*!
 * @name Register LCD_WF60, field BPALCD60[0] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase A
 * - 1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
#define BP_LCD_WF60_BPALCD60 (0U)          /*!< Bit position for LCD_WF60_BPALCD60. */
#define BM_LCD_WF60_BPALCD60 (0x01U)       /*!< Bit mask for LCD_WF60_BPALCD60. */
#define BS_LCD_WF60_BPALCD60 (1U)          /*!< Bit field size in bits for LCD_WF60_BPALCD60. */

/*! @brief Read current value of the LCD_WF60_BPALCD60 field. */
#define BR_LCD_WF60_BPALCD60(x) (BME_UBFX8(HW_LCD_WF60_ADDR(x), BP_LCD_WF60_BPALCD60, BS_LCD_WF60_BPALCD60))

/*! @brief Format value for bitfield LCD_WF60_BPALCD60. */
#define BF_LCD_WF60_BPALCD60(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF60_BPALCD60) & BM_LCD_WF60_BPALCD60)

/*! @brief Set the BPALCD60 field to a new value. */
#define BW_LCD_WF60_BPALCD60(x, v) (BME_BFI8(HW_LCD_WF60_ADDR(x), ((uint8_t)(v) << BP_LCD_WF60_BPALCD60), BP_LCD_WF60_BPALCD60, 1))
/*@}*/

/*!
 * @name Register LCD_WF60, field BPBLCD60[1] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase B
 * - 1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
#define BP_LCD_WF60_BPBLCD60 (1U)          /*!< Bit position for LCD_WF60_BPBLCD60. */
#define BM_LCD_WF60_BPBLCD60 (0x02U)       /*!< Bit mask for LCD_WF60_BPBLCD60. */
#define BS_LCD_WF60_BPBLCD60 (1U)          /*!< Bit field size in bits for LCD_WF60_BPBLCD60. */

/*! @brief Read current value of the LCD_WF60_BPBLCD60 field. */
#define BR_LCD_WF60_BPBLCD60(x) (BME_UBFX8(HW_LCD_WF60_ADDR(x), BP_LCD_WF60_BPBLCD60, BS_LCD_WF60_BPBLCD60))

/*! @brief Format value for bitfield LCD_WF60_BPBLCD60. */
#define BF_LCD_WF60_BPBLCD60(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF60_BPBLCD60) & BM_LCD_WF60_BPBLCD60)

/*! @brief Set the BPBLCD60 field to a new value. */
#define BW_LCD_WF60_BPBLCD60(x, v) (BME_BFI8(HW_LCD_WF60_ADDR(x), ((uint8_t)(v) << BP_LCD_WF60_BPBLCD60), BP_LCD_WF60_BPBLCD60, 1))
/*@}*/

/*!
 * @name Register LCD_WF60, field BPCLCD60[2] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase C
 * - 1 - LCD segment on or LCD backplane active for phase C
 */
/*@{*/
#define BP_LCD_WF60_BPCLCD60 (2U)          /*!< Bit position for LCD_WF60_BPCLCD60. */
#define BM_LCD_WF60_BPCLCD60 (0x04U)       /*!< Bit mask for LCD_WF60_BPCLCD60. */
#define BS_LCD_WF60_BPCLCD60 (1U)          /*!< Bit field size in bits for LCD_WF60_BPCLCD60. */

/*! @brief Read current value of the LCD_WF60_BPCLCD60 field. */
#define BR_LCD_WF60_BPCLCD60(x) (BME_UBFX8(HW_LCD_WF60_ADDR(x), BP_LCD_WF60_BPCLCD60, BS_LCD_WF60_BPCLCD60))

/*! @brief Format value for bitfield LCD_WF60_BPCLCD60. */
#define BF_LCD_WF60_BPCLCD60(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF60_BPCLCD60) & BM_LCD_WF60_BPCLCD60)

/*! @brief Set the BPCLCD60 field to a new value. */
#define BW_LCD_WF60_BPCLCD60(x, v) (BME_BFI8(HW_LCD_WF60_ADDR(x), ((uint8_t)(v) << BP_LCD_WF60_BPCLCD60), BP_LCD_WF60_BPCLCD60, 1))
/*@}*/

/*!
 * @name Register LCD_WF60, field BPDLCD60[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
#define BP_LCD_WF60_BPDLCD60 (3U)          /*!< Bit position for LCD_WF60_BPDLCD60. */
#define BM_LCD_WF60_BPDLCD60 (0x08U)       /*!< Bit mask for LCD_WF60_BPDLCD60. */
#define BS_LCD_WF60_BPDLCD60 (1U)          /*!< Bit field size in bits for LCD_WF60_BPDLCD60. */

/*! @brief Read current value of the LCD_WF60_BPDLCD60 field. */
#define BR_LCD_WF60_BPDLCD60(x) (BME_UBFX8(HW_LCD_WF60_ADDR(x), BP_LCD_WF60_BPDLCD60, BS_LCD_WF60_BPDLCD60))

/*! @brief Format value for bitfield LCD_WF60_BPDLCD60. */
#define BF_LCD_WF60_BPDLCD60(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF60_BPDLCD60) & BM_LCD_WF60_BPDLCD60)

/*! @brief Set the BPDLCD60 field to a new value. */
#define BW_LCD_WF60_BPDLCD60(x, v) (BME_BFI8(HW_LCD_WF60_ADDR(x), ((uint8_t)(v) << BP_LCD_WF60_BPDLCD60), BP_LCD_WF60_BPDLCD60, 1))
/*@}*/

/*!
 * @name Register LCD_WF60, field BPELCD60[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF60_BPELCD60 (4U)          /*!< Bit position for LCD_WF60_BPELCD60. */
#define BM_LCD_WF60_BPELCD60 (0x10U)       /*!< Bit mask for LCD_WF60_BPELCD60. */
#define BS_LCD_WF60_BPELCD60 (1U)          /*!< Bit field size in bits for LCD_WF60_BPELCD60. */

/*! @brief Read current value of the LCD_WF60_BPELCD60 field. */
#define BR_LCD_WF60_BPELCD60(x) (BME_UBFX8(HW_LCD_WF60_ADDR(x), BP_LCD_WF60_BPELCD60, BS_LCD_WF60_BPELCD60))

/*! @brief Format value for bitfield LCD_WF60_BPELCD60. */
#define BF_LCD_WF60_BPELCD60(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF60_BPELCD60) & BM_LCD_WF60_BPELCD60)

/*! @brief Set the BPELCD60 field to a new value. */
#define BW_LCD_WF60_BPELCD60(x, v) (BME_BFI8(HW_LCD_WF60_ADDR(x), ((uint8_t)(v) << BP_LCD_WF60_BPELCD60), BP_LCD_WF60_BPELCD60, 1))
/*@}*/

/*!
 * @name Register LCD_WF60, field BPFLCD60[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF60_BPFLCD60 (5U)          /*!< Bit position for LCD_WF60_BPFLCD60. */
#define BM_LCD_WF60_BPFLCD60 (0x20U)       /*!< Bit mask for LCD_WF60_BPFLCD60. */
#define BS_LCD_WF60_BPFLCD60 (1U)          /*!< Bit field size in bits for LCD_WF60_BPFLCD60. */

/*! @brief Read current value of the LCD_WF60_BPFLCD60 field. */
#define BR_LCD_WF60_BPFLCD60(x) (BME_UBFX8(HW_LCD_WF60_ADDR(x), BP_LCD_WF60_BPFLCD60, BS_LCD_WF60_BPFLCD60))

/*! @brief Format value for bitfield LCD_WF60_BPFLCD60. */
#define BF_LCD_WF60_BPFLCD60(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF60_BPFLCD60) & BM_LCD_WF60_BPFLCD60)

/*! @brief Set the BPFLCD60 field to a new value. */
#define BW_LCD_WF60_BPFLCD60(x, v) (BME_BFI8(HW_LCD_WF60_ADDR(x), ((uint8_t)(v) << BP_LCD_WF60_BPFLCD60), BP_LCD_WF60_BPFLCD60, 1))
/*@}*/

/*!
 * @name Register LCD_WF60, field BPGLCD60[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF60_BPGLCD60 (6U)          /*!< Bit position for LCD_WF60_BPGLCD60. */
#define BM_LCD_WF60_BPGLCD60 (0x40U)       /*!< Bit mask for LCD_WF60_BPGLCD60. */
#define BS_LCD_WF60_BPGLCD60 (1U)          /*!< Bit field size in bits for LCD_WF60_BPGLCD60. */

