nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Read current value of the LCD_WF61_BPDLCD61 field. */
#define BR_LCD_WF61_BPDLCD61(x) (BME_UBFX8(HW_LCD_WF61_ADDR(x), BP_LCD_WF61_BPDLCD61, BS_LCD_WF61_BPDLCD61))

/*! @brief Format value for bitfield LCD_WF61_BPDLCD61. */
#define BF_LCD_WF61_BPDLCD61(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF61_BPDLCD61) & BM_LCD_WF61_BPDLCD61)

/*! @brief Set the BPDLCD61 field to a new value. */
#define BW_LCD_WF61_BPDLCD61(x, v) (BME_BFI8(HW_LCD_WF61_ADDR(x), ((uint8_t)(v) << BP_LCD_WF61_BPDLCD61), BP_LCD_WF61_BPDLCD61, 1))
/*@}*/

/*!
 * @name Register LCD_WF61, field BPELCD61[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF61_BPELCD61 (4U)          /*!< Bit position for LCD_WF61_BPELCD61. */
#define BM_LCD_WF61_BPELCD61 (0x10U)       /*!< Bit mask for LCD_WF61_BPELCD61. */
#define BS_LCD_WF61_BPELCD61 (1U)          /*!< Bit field size in bits for LCD_WF61_BPELCD61. */

/*! @brief Read current value of the LCD_WF61_BPELCD61 field. */
#define BR_LCD_WF61_BPELCD61(x) (BME_UBFX8(HW_LCD_WF61_ADDR(x), BP_LCD_WF61_BPELCD61, BS_LCD_WF61_BPELCD61))

/*! @brief Format value for bitfield LCD_WF61_BPELCD61. */
#define BF_LCD_WF61_BPELCD61(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF61_BPELCD61) & BM_LCD_WF61_BPELCD61)

/*! @brief Set the BPELCD61 field to a new value. */
#define BW_LCD_WF61_BPELCD61(x, v) (BME_BFI8(HW_LCD_WF61_ADDR(x), ((uint8_t)(v) << BP_LCD_WF61_BPELCD61), BP_LCD_WF61_BPELCD61, 1))
/*@}*/

/*!
 * @name Register LCD_WF61, field BPFLCD61[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF61_BPFLCD61 (5U)          /*!< Bit position for LCD_WF61_BPFLCD61. */
#define BM_LCD_WF61_BPFLCD61 (0x20U)       /*!< Bit mask for LCD_WF61_BPFLCD61. */
#define BS_LCD_WF61_BPFLCD61 (1U)          /*!< Bit field size in bits for LCD_WF61_BPFLCD61. */

/*! @brief Read current value of the LCD_WF61_BPFLCD61 field. */
#define BR_LCD_WF61_BPFLCD61(x) (BME_UBFX8(HW_LCD_WF61_ADDR(x), BP_LCD_WF61_BPFLCD61, BS_LCD_WF61_BPFLCD61))

/*! @brief Format value for bitfield LCD_WF61_BPFLCD61. */
#define BF_LCD_WF61_BPFLCD61(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF61_BPFLCD61) & BM_LCD_WF61_BPFLCD61)

/*! @brief Set the BPFLCD61 field to a new value. */
#define BW_LCD_WF61_BPFLCD61(x, v) (BME_BFI8(HW_LCD_WF61_ADDR(x), ((uint8_t)(v) << BP_LCD_WF61_BPFLCD61), BP_LCD_WF61_BPFLCD61, 1))
/*@}*/

/*!
 * @name Register LCD_WF61, field BPGLCD61[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF61_BPGLCD61 (6U)          /*!< Bit position for LCD_WF61_BPGLCD61. */
#define BM_LCD_WF61_BPGLCD61 (0x40U)       /*!< Bit mask for LCD_WF61_BPGLCD61. */
#define BS_LCD_WF61_BPGLCD61 (1U)          /*!< Bit field size in bits for LCD_WF61_BPGLCD61. */

/*! @brief Read current value of the LCD_WF61_BPGLCD61 field. */
#define BR_LCD_WF61_BPGLCD61(x) (BME_UBFX8(HW_LCD_WF61_ADDR(x), BP_LCD_WF61_BPGLCD61, BS_LCD_WF61_BPGLCD61))

/*! @brief Format value for bitfield LCD_WF61_BPGLCD61. */
#define BF_LCD_WF61_BPGLCD61(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF61_BPGLCD61) & BM_LCD_WF61_BPGLCD61)

/*! @brief Set the BPGLCD61 field to a new value. */
#define BW_LCD_WF61_BPGLCD61(x, v) (BME_BFI8(HW_LCD_WF61_ADDR(x), ((uint8_t)(v) << BP_LCD_WF61_BPGLCD61), BP_LCD_WF61_BPGLCD61, 1))
/*@}*/

/*!
 * @name Register LCD_WF61, field BPHLCD61[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF61_BPHLCD61 (7U)          /*!< Bit position for LCD_WF61_BPHLCD61. */
#define BM_LCD_WF61_BPHLCD61 (0x80U)       /*!< Bit mask for LCD_WF61_BPHLCD61. */
#define BS_LCD_WF61_BPHLCD61 (1U)          /*!< Bit field size in bits for LCD_WF61_BPHLCD61. */

/*! @brief Read current value of the LCD_WF61_BPHLCD61 field. */
#define BR_LCD_WF61_BPHLCD61(x) (BME_UBFX8(HW_LCD_WF61_ADDR(x), BP_LCD_WF61_BPHLCD61, BS_LCD_WF61_BPHLCD61))

/*! @brief Format value for bitfield LCD_WF61_BPHLCD61. */
#define BF_LCD_WF61_BPHLCD61(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF61_BPHLCD61) & BM_LCD_WF61_BPHLCD61)

/*! @brief Set the BPHLCD61 field to a new value. */
#define BW_LCD_WF61_BPHLCD61(x, v) (BME_BFI8(HW_LCD_WF61_ADDR(x), ((uint8_t)(v) << BP_LCD_WF61_BPHLCD61), BP_LCD_WF61_BPHLCD61, 1))
/*@}*/
/*******************************************************************************
 * HW_LCD_WF62 - LCD Waveform Register 62.
 ******************************************************************************/

/*!
 * @brief HW_LCD_WF62 - LCD Waveform Register 62. (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_lcd_wf62
{
    uint8_t U;
    struct _hw_lcd_wf62_bitfields
    {
        uint8_t BPALCD62 : 1;          /*!< [0]  */
        uint8_t BPBLCD62 : 1;          /*!< [1]  */
        uint8_t BPCLCD62 : 1;          /*!< [2]  */
        uint8_t BPDLCD62 : 1;          /*!< [3]  */
        uint8_t BPELCD62 : 1;          /*!< [4]  */
        uint8_t BPFLCD62 : 1;          /*!< [5]  */
        uint8_t BPGLCD62 : 1;          /*!< [6]  */
        uint8_t BPHLCD62 : 1;          /*!< [7]  */
    } B;
} hw_lcd_wf62_t;

/*!
 * @name Constants and macros for entire LCD_WF62 register
 */
/*@{*/
#define HW_LCD_WF62_ADDR(x)      ((x) + 0x5EU)

#define HW_LCD_WF62(x)           (*(__IO hw_lcd_wf62_t *) HW_LCD_WF62_ADDR(x))
#define HW_LCD_WF62_RD(x)        (HW_LCD_WF62(x).U)
#define HW_LCD_WF62_WR(x, v)     (HW_LCD_WF62(x).U = (v))
#define HW_LCD_WF62_SET(x, v)    (BME_OR8(HW_LCD_WF62_ADDR(x), (uint8_t)(v)))
#define HW_LCD_WF62_CLR(x, v)    (BME_AND8(HW_LCD_WF62_ADDR(x), (uint8_t)(~(v))))
#define HW_LCD_WF62_TOG(x, v)    (BME_XOR8(HW_LCD_WF62_ADDR(x), (uint8_t)(v)))
/*@}*/

