nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_lcd.h
/*! @brief Set the BPDLCD63 field to a new value. */
#define BW_LCD_WF63_BPDLCD63(x, v) (BME_BFI8(HW_LCD_WF63_ADDR(x), ((uint8_t)(v) << BP_LCD_WF63_BPDLCD63), BP_LCD_WF63_BPDLCD63, 1))
/*@}*/

/*!
 * @name Register LCD_WF63, field BPELCD63[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
#define BP_LCD_WF63_BPELCD63 (4U)          /*!< Bit position for LCD_WF63_BPELCD63. */
#define BM_LCD_WF63_BPELCD63 (0x10U)       /*!< Bit mask for LCD_WF63_BPELCD63. */
#define BS_LCD_WF63_BPELCD63 (1U)          /*!< Bit field size in bits for LCD_WF63_BPELCD63. */

/*! @brief Read current value of the LCD_WF63_BPELCD63 field. */
#define BR_LCD_WF63_BPELCD63(x) (BME_UBFX8(HW_LCD_WF63_ADDR(x), BP_LCD_WF63_BPELCD63, BS_LCD_WF63_BPELCD63))

/*! @brief Format value for bitfield LCD_WF63_BPELCD63. */
#define BF_LCD_WF63_BPELCD63(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF63_BPELCD63) & BM_LCD_WF63_BPELCD63)

/*! @brief Set the BPELCD63 field to a new value. */
#define BW_LCD_WF63_BPELCD63(x, v) (BME_BFI8(HW_LCD_WF63_ADDR(x), ((uint8_t)(v) << BP_LCD_WF63_BPELCD63), BP_LCD_WF63_BPELCD63, 1))
/*@}*/

/*!
 * @name Register LCD_WF63, field BPFLCD63[5] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase F
 * - 1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
#define BP_LCD_WF63_BPFLCD63 (5U)          /*!< Bit position for LCD_WF63_BPFLCD63. */
#define BM_LCD_WF63_BPFLCD63 (0x20U)       /*!< Bit mask for LCD_WF63_BPFLCD63. */
#define BS_LCD_WF63_BPFLCD63 (1U)          /*!< Bit field size in bits for LCD_WF63_BPFLCD63. */

/*! @brief Read current value of the LCD_WF63_BPFLCD63 field. */
#define BR_LCD_WF63_BPFLCD63(x) (BME_UBFX8(HW_LCD_WF63_ADDR(x), BP_LCD_WF63_BPFLCD63, BS_LCD_WF63_BPFLCD63))

/*! @brief Format value for bitfield LCD_WF63_BPFLCD63. */
#define BF_LCD_WF63_BPFLCD63(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF63_BPFLCD63) & BM_LCD_WF63_BPFLCD63)

/*! @brief Set the BPFLCD63 field to a new value. */
#define BW_LCD_WF63_BPFLCD63(x, v) (BME_BFI8(HW_LCD_WF63_ADDR(x), ((uint8_t)(v) << BP_LCD_WF63_BPFLCD63), BP_LCD_WF63_BPFLCD63, 1))
/*@}*/

/*!
 * @name Register LCD_WF63, field BPGLCD63[6] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase G
 * - 1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
#define BP_LCD_WF63_BPGLCD63 (6U)          /*!< Bit position for LCD_WF63_BPGLCD63. */
#define BM_LCD_WF63_BPGLCD63 (0x40U)       /*!< Bit mask for LCD_WF63_BPGLCD63. */
#define BS_LCD_WF63_BPGLCD63 (1U)          /*!< Bit field size in bits for LCD_WF63_BPGLCD63. */

/*! @brief Read current value of the LCD_WF63_BPGLCD63 field. */
#define BR_LCD_WF63_BPGLCD63(x) (BME_UBFX8(HW_LCD_WF63_ADDR(x), BP_LCD_WF63_BPGLCD63, BS_LCD_WF63_BPGLCD63))

/*! @brief Format value for bitfield LCD_WF63_BPGLCD63. */
#define BF_LCD_WF63_BPGLCD63(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF63_BPGLCD63) & BM_LCD_WF63_BPGLCD63)

/*! @brief Set the BPGLCD63 field to a new value. */
#define BW_LCD_WF63_BPGLCD63(x, v) (BME_BFI8(HW_LCD_WF63_ADDR(x), ((uint8_t)(v) << BP_LCD_WF63_BPGLCD63), BP_LCD_WF63_BPGLCD63, 1))
/*@}*/

/*!
 * @name Register LCD_WF63, field BPHLCD63[7] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase H
 * - 1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
#define BP_LCD_WF63_BPHLCD63 (7U)          /*!< Bit position for LCD_WF63_BPHLCD63. */
#define BM_LCD_WF63_BPHLCD63 (0x80U)       /*!< Bit mask for LCD_WF63_BPHLCD63. */
#define BS_LCD_WF63_BPHLCD63 (1U)          /*!< Bit field size in bits for LCD_WF63_BPHLCD63. */

/*! @brief Read current value of the LCD_WF63_BPHLCD63 field. */
#define BR_LCD_WF63_BPHLCD63(x) (BME_UBFX8(HW_LCD_WF63_ADDR(x), BP_LCD_WF63_BPHLCD63, BS_LCD_WF63_BPHLCD63))

/*! @brief Format value for bitfield LCD_WF63_BPHLCD63. */
#define BF_LCD_WF63_BPHLCD63(v) ((uint8_t)((uint8_t)(v) << BP_LCD_WF63_BPHLCD63) & BM_LCD_WF63_BPHLCD63)

/*! @brief Set the BPHLCD63 field to a new value. */
#define BW_LCD_WF63_BPHLCD63(x, v) (BME_BFI8(HW_LCD_WF63_ADDR(x), ((uint8_t)(v) << BP_LCD_WF63_BPHLCD63), BP_LCD_WF63_BPHLCD63, 1))
/*@}*/

/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma push
  #pragma anon_unions
#elif defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/*******************************************************************************
 * hw_lcd_t - module struct
 ******************************************************************************/
/*!
 * @brief All LCD module registers.
 */
#pragma pack(1)
typedef struct _hw_lcd
{
    __IO hw_lcd_gcr_t GCR;                 /*!< [0x0] LCD General Control Register */
    __IO hw_lcd_ar_t AR;                   /*!< [0x4] LCD Auxiliary Register */
    __IO hw_lcd_fdcr_t FDCR;               /*!< [0x8] LCD Fault Detect Control Register */
    __IO hw_lcd_fdsr_t FDSR;               /*!< [0xC] LCD Fault Detect Status Register */
    __IO hw_lcd_penl_t PENL;               /*!< [0x10] LCD Pin Enable register */
    __IO hw_lcd_penh_t PENH;               /*!< [0x14] LCD Pin Enable register */
    __IO hw_lcd_bpenl_t BPENL;             /*!< [0x18] LCD Back Plane Enable register */
    __IO hw_lcd_bpenh_t BPENH;             /*!< [0x1C] LCD Back Plane Enable register */
    union {
        struct {
            __IO hw_lcd_wf3to0_t WF3TO0;   /*!< [0x20] LCD Waveform register */
            __IO hw_lcd_wf7to4_t WF7TO4;   /*!< [0x24] LCD Waveform register */
            __IO hw_lcd_wf11to8_t WF11TO8; /*!< [0x28] LCD Waveform register */
            __IO hw_lcd_wf15to12_t WF15TO12; /*!< [0x2C] LCD Waveform register */
            __IO hw_lcd_wf19to16_t WF19TO16; /*!< [0x30] LCD Waveform register */
            __IO hw_lcd_wf23to20_t WF23TO20; /*!< [0x34] LCD Waveform register */
            __IO hw_lcd_wf27to24_t WF27TO24; /*!< [0x38] LCD Waveform register */
            __IO hw_lcd_wf31to28_t WF31TO28; /*!< [0x3C] LCD Waveform register */
            __IO hw_lcd_wf35to32_t WF35TO32; /*!< [0x40] LCD Waveform register */
            __IO hw_lcd_wf39to36_t WF39TO36; /*!< [0x44] LCD Waveform register */
            __IO hw_lcd_wf43to40_t WF43TO40; /*!< [0x48] LCD Waveform register */
            __IO hw_lcd_wf47to44_t WF47TO44; /*!< [0x4C] LCD Waveform register */
            __IO hw_lcd_wf51to48_t WF51TO48; /*!< [0x50] LCD Waveform register */
            __IO hw_lcd_wf55to52_t WF55TO52; /*!< [0x54] LCD Waveform register */
            __IO hw_lcd_wf59to56_t WF59TO56; /*!< [0x58] LCD Waveform register */
            __IO hw_lcd_wf63to60_t WF63TO60; /*!< [0x5C] LCD Waveform register */
        } WFACCESS32BIT;
        struct {
            __IO hw_lcd_wf0_t WF0;         /*!< [0x20] LCD Waveform Register 0. */
            __IO hw_lcd_wf1_t WF1;         /*!< [0x21] LCD Waveform Register 1. */
            __IO hw_lcd_wf2_t WF2;         /*!< [0x22] LCD Waveform Register 2. */
            __IO hw_lcd_wf3_t WF3;         /*!< [0x23] LCD Waveform Register 3. */
            __IO hw_lcd_wf4_t WF4;         /*!< [0x24] LCD Waveform Register 4. */
            __IO hw_lcd_wf5_t WF5;         /*!< [0x25] LCD Waveform Register 5. */
            __IO hw_lcd_wf6_t WF6;         /*!< [0x26] LCD Waveform Register 6. */
            __IO hw_lcd_wf7_t WF7;         /*!< [0x27] LCD Waveform Register 7. */
            __IO hw_lcd_wf8_t WF8;         /*!< [0x28] LCD Waveform Register 8. */
            __IO hw_lcd_wf9_t WF9;         /*!< [0x29] LCD Waveform Register 9. */
            __IO hw_lcd_wf10_t WF10;       /*!< [0x2A] LCD Waveform Register 10. */
            __IO hw_lcd_wf11_t WF11;       /*!< [0x2B] LCD Waveform Register 11. */
            __IO hw_lcd_wf12_t WF12;       /*!< [0x2C] LCD Waveform Register 12. */
            __IO hw_lcd_wf13_t WF13;       /*!< [0x2D] LCD Waveform Register 13. */
            __IO hw_lcd_wf14_t WF14;       /*!< [0x2E] LCD Waveform Register 14. */
            __IO hw_lcd_wf15_t WF15;       /*!< [0x2F] LCD Waveform Register 15. */
            __IO hw_lcd_wf16_t WF16;       /*!< [0x30] LCD Waveform Register 16. */
            __IO hw_lcd_wf17_t WF17;       /*!< [0x31] LCD Waveform Register 17. */
            __IO hw_lcd_wf18_t WF18;       /*!< [0x32] LCD Waveform Register 18. */
            __IO hw_lcd_wf19_t WF19;       /*!< [0x33] LCD Waveform Register 19. */
            __IO hw_lcd_wf20_t WF20;       /*!< [0x34] LCD Waveform Register 20. */
            __IO hw_lcd_wf21_t WF21;       /*!< [0x35] LCD Waveform Register 21. */
            __IO hw_lcd_wf22_t WF22;       /*!< [0x36] LCD Waveform Register 22. */
            __IO hw_lcd_wf23_t WF23;       /*!< [0x37] LCD Waveform Register 23. */
            __IO hw_lcd_wf24_t WF24;       /*!< [0x38] LCD Waveform Register 24. */
            __IO hw_lcd_wf25_t WF25;       /*!< [0x39] LCD Waveform Register 25. */
            __IO hw_lcd_wf26_t WF26;       /*!< [0x3A] LCD Waveform Register 26. */
            __IO hw_lcd_wf27_t WF27;       /*!< [0x3B] LCD Waveform Register 27. */
            __IO hw_lcd_wf28_t WF28;       /*!< [0x3C] LCD Waveform Register 28. */
            __IO hw_lcd_wf29_t WF29;       /*!< [0x3D] LCD Waveform Register 29. */
            __IO hw_lcd_wf30_t WF30;       /*!< [0x3E] LCD Waveform Register 30. */
            __IO hw_lcd_wf31_t WF31;       /*!< [0x3F] LCD Waveform Register 31. */
            __IO hw_lcd_wf32_t WF32;       /*!< [0x40] LCD Waveform Register 32. */
            __IO hw_lcd_wf33_t WF33;       /*!< [0x41] LCD Waveform Register 33. */
            __IO hw_lcd_wf34_t WF34;       /*!< [0x42] LCD Waveform Register 34. */
            __IO hw_lcd_wf35_t WF35;       /*!< [0x43] LCD Waveform Register 35. */
            __IO hw_lcd_wf36_t WF36;       /*!< [0x44] LCD Waveform Register 36. */
            __IO hw_lcd_wf37_t WF37;       /*!< [0x45] LCD Waveform Register 37. */
            __IO hw_lcd_wf38_t WF38;       /*!< [0x46] LCD Waveform Register 38. */
            __IO hw_lcd_wf39_t WF39;       /*!< [0x47] LCD Waveform Register 39. */
            __IO hw_lcd_wf40_t WF40;       /*!< [0x48] LCD Waveform Register 40. */
            __IO hw_lcd_wf41_t WF41;       /*!< [0x49] LCD Waveform Register 41. */
            __IO hw_lcd_wf42_t WF42;       /*!< [0x4A] LCD Waveform Register 42. */
            __IO hw_lcd_wf43_t WF43;       /*!< [0x4B] LCD Waveform Register 43. */
            __IO hw_lcd_wf44_t WF44;       /*!< [0x4C] LCD Waveform Register 44. */
            __IO hw_lcd_wf45_t WF45;       /*!< [0x4D] LCD Waveform Register 45. */
            __IO hw_lcd_wf46_t WF46;       /*!< [0x4E] LCD Waveform Register 46. */
            __IO hw_lcd_wf47_t WF47;       /*!< [0x4F] LCD Waveform Register 47. */
            __IO hw_lcd_wf48_t WF48;       /*!< [0x50] LCD Waveform Register 48. */
            __IO hw_lcd_wf49_t WF49;       /*!< [0x51] LCD Waveform Register 49. */
            __IO hw_lcd_wf50_t WF50;       /*!< [0x52] LCD Waveform Register 50. */
            __IO hw_lcd_wf51_t WF51;       /*!< [0x53] LCD Waveform Register 51. */
            __IO hw_lcd_wf52_t WF52;       /*!< [0x54] LCD Waveform Register 52. */
            __IO hw_lcd_wf53_t WF53;       /*!< [0x55] LCD Waveform Register 53. */
            __IO hw_lcd_wf54_t WF54;       /*!< [0x56] LCD Waveform Register 54. */
            __IO hw_lcd_wf55_t WF55;       /*!< [0x57] LCD Waveform Register 55. */
            __IO hw_lcd_wf56_t WF56;       /*!< [0x58] LCD Waveform Register 56. */
            __IO hw_lcd_wf57_t WF57;       /*!< [0x59] LCD Waveform Register 57. */
            __IO hw_lcd_wf58_t WF58;       /*!< [0x5A] LCD Waveform Register 58. */
            __IO hw_lcd_wf59_t WF59;       /*!< [0x5B] LCD Waveform Register 59. */
            __IO hw_lcd_wf60_t WF60;       /*!< [0x5C] LCD Waveform Register 60. */
            __IO hw_lcd_wf61_t WF61;       /*!< [0x5D] LCD Waveform Register 61. */
            __IO hw_lcd_wf62_t WF62;       /*!< [0x5E] LCD Waveform Register 62. */
            __IO hw_lcd_wf63_t WF63;       /*!< [0x5F] LCD Waveform Register 63. */
        } WFACCESS8BIT;
    };
} hw_lcd_t;
#pragma pack()

/*! @brief Macro to access all LCD registers. */
/*! @param x LCD module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_LCD(LCD_BASE)</code>. */
#define HW_LCD(x)      (*(hw_lcd_t *)(x))

/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

#endif /* __HW_LCD_REGISTERS_H__ */
/* EOF */
